Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/basic_mapping.po
Languages: es_es

source: A typical <literal>many-to-one</literal> declaration looks as simple as this:
es_es: Una declaración típica <literal>muchos-a-uno</literal> se parece a esto:

source: The <literal>property-ref</literal> attribute should only be used for mapping legacy data where a foreign key refers to a unique key of the associated table other than the primary key. This is an ugly relational model. For example, suppose the <literal>Product</literal> class had a unique serial number, that is not the primary key. (The <literal>unique</literal> attribute controls Hibernate's DDL generation with the SchemaExport tool.)
es_es: El atributo <literal>property-ref</literal> debe ser usado solamente para el mapeo de datos heredados donde una clave foránea referencia una clave única de la tabla asociada, distinta de la clave primaria. Este es un modelo relacional feo. Por ejemplo, supón que la clase <literal>Product</literal> tuviera un número único serial que no es la clave primaria. (El atributo <literal>unique</literal> controla la generación de DDL con la herramienta SchemaExport.)

source: Then the mapping for <literal>OrderItem</literal> might use:
es_es: Entonces el mapeo para <literal>OrderItem</literal> debería usar:

source: This is certainly not encouraged, however.
es_es: Sin embargo, esto no esta ciertamente alentado.

source: If the referenced unique key comprises multiple properties of the associated entity, you should map the referenced properties inside a named <literal>&lt;properties&gt;</literal> element.
es_es: Si la clave única referenciada abarca múltiples propiedades de la entidad asociada, debes mapear las propiedades dentro de un elemento <literal>&lt;properties&gt;</literal>.

source: If the referenced unique key is the property of a component, you may specify a property path:
es_es: UNTRANSLATED! If the referenced unique key is the property of a component, you may specify a property path:

source: A one-to-one association to another persistent class is declared using a <literal>one-to-one</literal> element.
es_es: Una asociación uno-a-uno a otra clase persistente se declara usando un elemento <literal>one-to-one</literal>.

source: <literal>cascade</literal> (optional) specifies which operations should be cascaded from the parent object to the associated object.
es_es: <literal>cascade</literal> (opcional) especifica qué operaciones deben ir en cascada desde el objeto padre al objeto asociado.

source: <literal>constrained</literal> (optional) specifies that a foreign key constraint on the primary key of the mapped table references the table of the associated class. This option affects the order in which <literal>save()</literal> and <literal>delete()</literal> are cascaded, and determines whether the association may be proxied (it is also used by the schema export tool).
es_es: <literal>constrained</literal> (opcional) especifica que una restricción de clave foránea de la tabla mapeada referencia a la tabla de la clase asociada. Esta opción afecta el orden en que van en cascada <literal>save()</literal> y <literal>delete()</literal>, y determina cuándo la asociación pueden ser virtualizados por proxies (es también usado por la herramienta de exportación de esquemas).

source: <literal>property-ref</literal>: (optional) The name of a property of the associated class that is joined to the primary key of this class. If not specified, the primary key of the associated class is used.
es_es: <literal>property-ref</literal>: (opcional) El nombre de una propiedad de la clase asociada que esté unida a la clave primaria de esta clase. Si no se especifica, se usa la clave primaria de la clase asociada.

source: <literal>formula</literal> (optional): Almost all one to one associations map to the primary key of the owning entity. In the rare case that this is not the case, you may specify a some other column, columns or expression to join on using an SQL formula. (See <literal>org.hibernate.test.onetooneformula</literal> for an example.)
es_es: <literal>formula</literal> (opcional): Casi todas las asociaciones uno-a-uno mapean a la clave primaria de la entidad propietaria. En el raro caso en que este no sea el caso, puedes especificar alguna otra columna, o columnas, o expresión para unir usando una fórmula SQL. (Para un ejemplo ver <literal>org.hibernate.test.onetooneformula</literal>).

source: <literal>lazy</literal> (optional - defaults to <literal>proxy</literal>): By default, single point associations are proxied. <literal>lazy="no-proxy"</literal> specifies that the property should be fetched lazily when the instance variable is first accessed (requires build-time bytecode instrumentation). <literal>lazy="false"</literal> specifies that the association will always be eagerly fetched. <emphasis>Note that if <literal>constrained="false"</literal>, proxying is impossible and Hibernate will eager fetch the association!</emphasis>
es_es: <literal>lazy</literal> (opcional - por defecto a <literal>proxy</literal>): Por defecto, las asociaciones de punto único van con proxies. <literal>lazy="true"</literal> especifica que esta propiedad debe ser traída perezosamente cuando la variable de instancia sea accedida por primera vez (requiere instrumentación del bytecode en tiempo de compilación). <literal>lazy="false"</literal> especifica que la asociación siempre será recuperada tempranamente. <emphasis>Observa que si <literal>constrained="false"</literal>, la aplicación de proxies es imposible e Hibernate traerá temprano la asociación!</emphasis>

source: There are two varieties of one-to-one association:
es_es: Hay dos variedades de asociaciones uno-a-uno:

source: primary key associations
es_es: asociaciones de clave primaria

source: unique foreign key associations
es_es: asociaciones de clave foráneas única

source: Primary key associations don't need an extra table column; if two rows are related by the association then the two table rows share the same primary key value. So if you want two objects to be related by a primary key association, you must make sure that they are assigned the same identifier value!
es_es: Las asociaciones de clave primaria no necesitan una columna de tabla extra; si dos filas están relacionadas por la asociación entonces las dos filas de tablas comparten el mismo valor de clave primaria. Por lo tanto, si quieres que dos objetos estén relacionados por una asociación de clave primaria, debes asegurarte que se les asigne el mismo valor de identificador!

source: For a primary key association, add the following mappings to <literal>Employee</literal> and <literal>Person</literal>, respectively.
es_es: Para una asociación de clave primaria, añade los siguientes mapeos a <literal>Employee</literal> y <literal>Person</literal>, respectivamente.

source: Now we must ensure that the primary keys of related rows in the PERSON and EMPLOYEE tables are equal. We use a special Hibernate identifier generation strategy called <literal>foreign</literal>:
es_es: Ahora debemos asegurarnos que las claves primarias de las filas relacionadas en las tablas PERSON y EMPLOYEE sean iguales. Usamos una estrategia especial de generación de identificador de Hibernate llamada <literal>foreign</literal>:

source: A newly saved instance of <literal>Person</literal> is then assigned the same primary key value as the <literal>Employee</literal> instance refered with the <literal>employee</literal> property of that <literal>Person</literal>.
es_es: A una instancia recién salvada de <literal>Person</literal> se le asigna entonces el mismo valor de clave primaria con que la instancia <literal>Employee</literal> referida por la propiedad <literal>employee</literal> de esta <literal>Person</literal>.

source: Alternatively, a foreign key with a unique constraint, from <literal>Employee</literal> to <literal>Person</literal>, may be expressed as:
es_es: Alternativamente, una clave foránea con una restricción de unicidad, desde <literal>Employee</literal> a <literal>Person</literal>, puede ser expresada como:

source: And this association may be made bidirectional by adding the following to the <literal>Person</literal> mapping:
es_es: Y esta asociación puede hacerse bidireccional agregando lo siguiente al mapeo de <literal>Person</literal> :

source: Even though we recommend the use of surrogate keys as primary keys, you should still try to identify natural keys for all entities. A natural key is a property or combination of properties that is unique and non-null. If it is also immutable, even better. Map the properties of the natural key inside the <literal>&lt;natural-id&gt;</literal> element. Hibernate will generate the necessary unique key and nullability constraints, and your mapping will be more self-documenting.
es_es: Aunque recomendamos el uso de claves delegadas como claves primarias, todavía debes intentar identificar claves naturales para todas las entidades. Una clave natural es una propiedad o combinación de propiedades que es única y no nula. Si además es inmutable, mejor aún. Mapea las propiedades de la clave natural dentro del elemento <literal>&lt;natural-id&gt;</literal>. Hibernate generará las restricciones de clave única y nulabilidad necesarias, y tu mapeo será más auto-documentado.

source: We strongly recommend that you implement <literal>equals()</literal> and <literal>hashCode()</literal> to compare the natural key properties of the entity.
es_es: Recomendamos fuertemente que implementes <literal>equals()</literal> y <literal>hashCode()</literal> para comparar las propiedades de clave natural de la entidad.

source: This mapping is not intended for use with entities with natural primary keys.
es_es: Este mapeo no está concebido para usar con entidades con claves primarias naturales.

source: <literal>mutable</literal> (optional, defaults to <literal>false</literal>): By default, natural identifier properties as assumed to be immutable (constant).
es_es: <literal>mutable</literal> (opcional, por defecto a <literal>false</literal>): Por defecto, se asume que las propiedades de identificadores naturales son inmutables (constantes).

source: The <literal>&lt;component&gt;</literal> element maps properties of a child object to columns of the table of a parent class. Components may, in turn, declare their own properties, components or collections. See "Components" below.
es_es: El elemento <literal>&lt;component&gt;</literal> mapea propiedades de un objeto hijo a columnas de la tabla de la clase padre. Los componentes pueden a su vez declarar sus propias propiedades, componentes o colecciones. Ver debajo "Componentes".

source: <literal>class</literal> (optional - defaults to the property type determined by reflection): The name of the component (child) class.
es_es: <literal>class</literal> (opcional - por defecto al tipo de la propiedad determinado por reflección): El nombre de la clase del componente (hijo).

source: <literal>insert</literal>: Do the mapped columns appear in SQL <literal>INSERT</literal>s?
es_es: <literal>insert</literal>: Aparecen las columnas mapeadas en <literal>INSERT</literal>s SQL?

source: <literal>update</literal>: Do the mapped columns appear in SQL <literal>UPDATE</literal>s?
es_es: <literal>update</literal>: Aparecen las columnas mapeadas en <literal>UPDATE</literal>s SQL?

source: <literal>lazy</literal> (optional - defaults to <literal>false</literal>): Specifies that this component should be fetched lazily when the instance variable is first accessed (requires build-time bytecode instrumentation).
es_es: <literal>lazy</literal> (opcional - por defecto a <literal>false</literal>): Especifica que este componente debe ser recuperado perezosamente cuando la variable de instancia sea accedida por primera vez (requiere instrumentación de bytecode en tiempo de compilación).

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Specifies that updates to this component do or do not require acquisition of the optimistic lock. In other words, determines if a version increment should occur when this property is dirty.
es_es: <literal>optimistic-lock</literal> (opcional - por defecto a <literal>true</literal>): Especifica si las actualizaciones de este componente requieren o no la adquisición de un bloqueo optimista. En otras palabras, determina si debe ocurrir un incremento de versión cuando esta propiedad está desactualizada.

source: <literal>unique</literal> (optional - defaults to <literal>false</literal>): Specifies that a unique constraint exists upon all mapped columns of the component.
es_es: <literal>unique</literal> (opcional - por defecto a <literal>false</literal>): Especifica que existe una restricción de unicidad sobre todas las columnas mapeadas del componente.

source: The child <literal>&lt;property&gt;</literal> tags map properties of the child class to table columns.
es_es: Las etiquetas hijas <literal>&lt;property&gt;</literal> mapean propiedades de la clase hija columnas de la tabla.

source: The <literal>&lt;component&gt;</literal> element allows a <literal>&lt;parent&gt;</literal> subelement that maps a property of the component class as a reference back to the containing entity.
es_es: El elemento <literal>&lt;component&gt;</literal> permite un subelemento <literal>&lt;parent&gt;</literal> que mapea una propiedad de la clase del componente como una referencia de regreso a la entidad contenedora.

source: The <literal>&lt;dynamic-component&gt;</literal> element allows a <literal>Map</literal> to be mapped as a component, where the property names refer to keys of the map, see <xref linkend="components-dynamic"/>.
es_es: El elemento <literal>&lt;dynamic-component&gt;</literal> permite que un <literal>Map</literal> sea mapeado como un componente, donde los nombres de las propiedades se corresponden a las claves del mapa, ver <xref linkend="components-dynamic"/>.

source: The <literal>&lt;properties&gt;</literal> element allows the definition of a named, logical grouping of properties of a class. The most important use of the construct is that it allows a combination of properties to be the target of a <literal>property-ref</literal>. It is also a convenient way to define a multi-column unique constraint.
es_es: El elemento <literal>&lt;properties&gt;</literal> permite la definición de un grupo de propiedades lógico con nombre de una clase. El uso más importante de la contrucción es que permite que una combinación de propiedades sea objetivo de una <literal>property-ref</literal>. Es también una forma conveniente de definir una restricción de unicidad multicolumna.

source: <literal>name</literal>: The logical name of the grouping - <emphasis>not</emphasis> an actual property name.
es_es: <literal>name</literal>: El nombre lógico del agrupamiento - <emphasis>no</emphasis> un nombre de propiedad real.

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Specifies that updates to these properties do or do not require acquisition of the optimistic lock. In other words, determines if a version increment should occur when these properties are dirty.
es_es: <literal>optimistic-lock</literal> (opcional - por defecto a <literal>true</literal>): Especifica si las actualizaciones de estas propiedades requieren o no de la adquisición de un bloqueo optimista. En otras palabras, determina si debe ocurrir un incremento de versión cuando estas propiedades están desactualizadas.

source: For example, if we have the following <literal>&lt;properties&gt;</literal> mapping:
es_es: Por ejemplo, si tenemos el siguiente mapeo de <literal>&lt;properties&gt;</literal>:

source: Then we might have some legacy data association which refers to this unique key of the <literal>Person</literal> table, instead of to the primary key:
es_es: Entonces puede que tengamos alguna asociación de datos heredados que se refiera a esta clave única de la tabla de <literal>Person</literal>, en vez de la clave primaria:

source: We don't recommend the use of this kind of thing outside the context of mapping legacy data.
es_es: No recomendamos el uso de este tipo de cosas fuera del contexto del mapeo de datos heredados.

source: Finally, polymorphic persistence requires the declaration of each subclass of the root persistent class. For the table-per-class-hierarchy mapping strategy, the <literal>&lt;subclass&gt;</literal> declaration is used.
es_es: Finalmente, la persistencia polimórfica requiere la declaración de la clase persistente raíz. Para la estrategia de mapeo tabla-por-jerarquía-de-clases, se usa la declaración de <literal>&lt;subclass&gt;</literal>.

source: <literal>discriminator-value</literal> (optional - defaults to the class name): A value that distiguishes individual subclasses.
es_es: <literal>discriminator-value</literal> (opcional - por defecto al nombre de la clase): Un valor que distingue a subclases individuales.

source: <literal>lazy</literal> (optional, defaults to <literal>true</literal>): Setting <literal>lazy="false"</literal> disables the use of lazy fetching.
es_es: <literal>lazy</literal> (opcional, por defecto a <literal>true</literal>): Establecer <literal>lazy="false"</literal> deshabilita el uso de recuperación perezosa.

source: Each subclass should declare its own persistent properties and subclasses. <literal>&lt;version&gt;</literal> and <literal>&lt;id&gt;</literal> properties are assumed to be inherited from the root class. Each subclass in a heirarchy must define a unique <literal>discriminator-value</literal>. If none is specified, the fully qualified Java class name is used.
es_es: UNTRANSLATED! Each subclass should declare its own persistent properties and subclasses. <literal>&lt;version&gt;</literal> and <literal>&lt;id&gt;</literal> properties are assumed to be inherited from the root class. Each subclass in a heirarchy must define a unique <literal>discriminator-value</literal>. If none is specified, the fully qualified Java class name is used.

source: For information about inheritance mappings, see <xref linkend="inheritance"/>.
es_es: Para información acerca de mapeos de herencia, ver <xref linkend="inheritance"/>.

source: Alternatively, each subclass may be mapped to its own table (table-per-subclass mapping strategy). Inherited state is retrieved by joining with the table of the superclass. We use the <literal>&lt;joined-subclass&gt;</literal> element.
es_es: Alternativamente, cada subclase puede ser mapeada a su propia tabla (estrategia de mapeo tabla-por-subclase). El estado heredado se recupera uniendo con la tabla de la superclase. Usamos el elemento <literal>&lt;joined-subclass&gt;</literal>.

source: <literal>table</literal>: The name of the subclass table.
es_es: <literal>table</literal>: El nombre de tabla de la subclase.

source: No discriminator column is required for this mapping strategy. Each subclass must, however, declare a table column holding the object identifier using the <literal>&lt;key&gt;</literal> element. The mapping at the start of the chapter would be re-written as:
es_es: No se requiere de una columna discriminadora para esta estrategia de mapeo. Cada subclase debe, sin embargo, declarar una columna de tabla que tenga el identificador del objeto usando el elemento <literal>&lt;key&gt;</literal>. El mapeo del comienzo del capítulo debería ser reescrito como:

source: A third option is to map only the concrete classes of an inheritance hierarchy to tables, (the table-per-concrete-class strategy) where each table defines all persistent state of the class, including inherited state. In Hibernate, it is not absolutely necessary to explicitly map such inheritance hierarchies. You can simply map each class with a separate <literal>&lt;class&gt;</literal> declaration. However, if you wish use polymorphic associations (e.g. an association to the superclass of your hierarchy), you need to use the <literal>&lt;union-subclass&gt;</literal> mapping.
es_es: Una tercera opción es mapear sólo las clases concretas de una jerarquía de clases a tablas, (la estrategia tabla-por-clase-concreta) donde cada tabla define todo el estado persistente de la clase, incluyendo el estado heredado. En Hibernate, no es absolutamente necesario mapear dichas jerarquías de herencia. Puedes simplemente mapear cada clase con una declaración <literal>&lt;class&gt;</literal> separada. Sin embargo, si deseas usar asociaciones polimórficas (por ejemplo, una asociación a la superclase de tu jerarquía), debes usar el mapeo <literal>&lt;union-subclass&gt;</literal>.

source: No discriminator column or key column is required for this mapping strategy.
es_es: No se requiere columna o columna clave discriminadora para esta estrategia de mapeo.

source: Using the <literal>&lt;join&gt;</literal> element, it is possible to map properties of one class to several tables, when there's a 1-to-1 relationship between the tables.
es_es: Usando el elemento <literal>&lt;join&gt;</literal>, es posible mapear propiedades de una clase a varias tablas.

source: <literal>table</literal>: The name of the joined table.
es_es: <literal>table</literal>: El nombre de la clase unida.

source: <literal>fetch</literal> (optional - defaults to <literal>join</literal>): If set to <literal>join</literal>, the default, Hibernate will use an inner join to retrieve a <literal>&lt;join&gt;</literal> defined by a class or its superclasses and an outer join for a <literal>&lt;join&gt;</literal> defined by a subclass. If set to <literal>select</literal> then Hibernate will use a sequential select for a <literal>&lt;join&gt;</literal> defined on a subclass, which will be issued only if a row turns out to represent an instance of the subclass. Inner joins will still be used to retrieve a <literal>&lt;join&gt;</literal> defined by the class and its superclasses.
es_es: <literal>fetch</literal> (opcional - por defecto a <literal>join</literal>): Si se establece a <literal>join</literal>, por defecto, Hibernate usará una unión interior (inner join) para recuperar un <literal>&lt;join&gt;</literal> definido por una clase o sus superclases y una unión externa (outer join) para un <literal>&lt;join&gt;</literal> definido por una subclase. Si se establece a <literal>select</literal>, entonces Hibernate usará una select secuencial para un <literal>&lt;join&gt;</literal> definido en una subclase, que será publicada sólo si una fila resulta representar una instancia de la subclase. Las uniones interiores todavía serán usados para recuperar un <literal>&lt;join&gt;</literal> definido por la clase y sus superclases.

source: <literal>inverse</literal> (optional - defaults to <literal>false</literal>): If enabled, Hibernate will not try to insert or update the properties defined by this join.
es_es: <literal>inverse</literal> (opcional - por defecto a <literal>false</literal>): De habilitarse, Hibernate no intentará insertar o actualizar las propiedades definidas por esta unión.

source: <literal>optional</literal> (optional - defaults to <literal>false</literal>): If enabled, Hibernate will insert a row only if the properties defined by this join are non-null and will always use an outer join to retrieve the properties.
es_es: <literal>optional</literal> (opcional - por defecto a <literal>false</literal>): De habilitarse, Hibernate insertará una fila sólo si las propiedades definidas por esta unión son no nulas y siempre usará una unión externa para recuperar las propiedades.

source: For example, the address information for a person can be mapped to a separate table (while preserving value type semantics for all properties):
es_es: Por ejemplo, la información domiciliaria de una persona puede ser mapeada a una tabla separada (preservando a la vez la semántica de tipo de valor para todas las propiedades):
