Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/basic_mapping.po
Languages: es_es

source: We <emphasis>very</emphasis> strongly recommend that you use version/timestamp columns for optimistic locking with Hibernate. This is the optimal strategy with respect to performance and is the only strategy that correctly handles modifications made to detached instances (ie. when <literal>Session.merge()</literal> is used).
es_es: Recomendamos <emphasis>muy</emphasis> fuertemente que uses columnas de versión/timestamp para bloqueo optimista con Hibernate. Esta es la estrategia óptima con respecto al rendimiento y es la única estrategia que maneja correctamente las modificaciones hechas a las instancias separadas. (por ejemplo, cuando se usa <literal>Session.merge()</literal>).

source: There is no difference between a view and a base table for a Hibernate mapping, as expected this is transparent at the database level (note that some DBMS don't support views properly, especially with updates). Sometimes you want to use a view, but can't create one in the database (ie. with a legacy schema). In this case, you can map an immutable and read-only entity to a given SQL subselect expression:
es_es: Para un mapeo de Hibernate, no hay diferencia entre una vista y una tabla base. Como se supone esto es transparente a nivel de base de datos (observa que algunos DBMS no soportan correctamente las vistas, especialmente con las actualizaciones). A veces quieres usar una vista, pero no puedes crear una en la base de datos (por ejemplo, con un esquema heredado). En este caso, puedes mapear una entidad inmutable de sólo lectura a una expresión de subconsulta SQL dada.

source: Declare the tables to synchronize this entity with, ensuring that auto-flush happens correctly, and that queries against the derived entity do not return stale data. The <literal>&lt;subselect&gt;</literal> is available as both as an attribute and a nested mapping element.
es_es: Declara las tablas con las que sincronizar esta entidad, asegurando que el auto-flush ocurre correctamente, y que las consultas contra la entidad derivada no devuelven datos desactualizados. El <literal>&lt;subselect&gt;</literal> está disponible tanto como un atributo o como un elemento anidado de mapeo.

source: Mapped classes <emphasis>must</emphasis> declare the primary key column of the database table. Most classes will also have a JavaBeans-style property holding the unique identifier of an instance. The <literal>&lt;id&gt;</literal> element defines the mapping from that property to the primary key column.
es_es: Las clases mapeadas <emphasis>deben</emphasis> declarar la columna de clave primaria de la tabla de la base de datos. En la mayoría de los casos tendrá también una propiedad estilo Javabeans que tenga el identificador único de una instancia. El elemento <literal>&lt;id&gt;</literal> define el mapeo de esa propiedad a la columna de clave primaria.

source: <literal>name</literal> (optional): The name of the identifier property.
es_es: <literal>name</literal> (opcional): El nombre de la propiedad del indentificador.

source: <literal>type</literal> (optional): A name that indicates the Hibernate type.
es_es: <literal>type</literal> (opcional): Un nombre que indica el tipo Hibernate.

source: <literal>column</literal> (optional - defaults to the property name): The name of the primary key column.
es_es: <literal>column</literal> (opcional - por defecto al nombre de la propiedad): El nombre de la columna de clave primaria.

source: <literal>unsaved-value</literal> (optional - defaults to a "sensible" value): An identifier property value that indicates that an instance is newly instantiated (unsaved), distinguishing it from detached instances that were saved or loaded in a previous session.
es_es: <literal>unsaved-value</literal> (opcional - por defecto al valor "sensible"): Una valor de la propiedad identificadora que indica que una instancia está recién instanciada (sin salvar), distinguiéndola de instancias separadas que fueran salvadas o cargadas en una sesión previa.

source: If the <literal>name</literal> attribute is missing, it is assumed that the class has no identifier property.
es_es: Si se omite el atributo <literal>name</literal>, se asume que la clase no tiene propiedad identificadora.

source: The <literal>unsaved-value</literal> attribute is almost never needed in Hibernate3.
es_es: El atributo <literal>unsaved-value</literal> es importante! Si la propiedad identificadora de tu clase no tiene por defecto el valor por defecto normal de Java (null o cero), entonces debes especificar el valor por defecto real.

source: There is an alternative <literal>&lt;composite-id&gt;</literal> declaration to allow access to legacy data with composite keys. We strongly discourage its use for anything else.
es_es: Hay una declaración <literal>&lt;composite-id&gt;</literal> alternativa para permitir acceso a datos heredados con claves compuestas. Desalentamos fuertemente su uso para cualquier otra cosa.

source: The optional <literal>&lt;generator&gt;</literal> child element names a Java class used to generate unique identifiers for instances of the persistent class. If any parameters are required to configure or initialize the generator instance, they are passed using the <literal>&lt;param&gt;</literal> element.
es_es: El elemento hijo opcional <literal>&lt;generator&gt;</literal> nombra una clase Java usada en generar identificadores únicos para instancias de la clase persistente. De requerirse algún parámetro para configurar o inicializar la instancia del generador, se pasa usando el elemento <literal>&lt;param&gt;</literal>.

source: generates identifiers of type <literal>long</literal>, <literal>short</literal> or <literal>int</literal> that are unique only when no other process is inserting data into the same table. <emphasis>Do not use in a cluster.</emphasis>
es_es: genera indentificadores de tipo <literal>long</literal>, <literal>short</literal> o <literal>int</literal> que sólo son únicos cuando ningún otro proceso está insertando datos en la misma tabla. <emphasis>No usar en un cluster.</emphasis>

source: supports identity columns in DB2, MySQL, MS SQL Server, Sybase and HypersonicSQL. The returned identifier is of type <literal>long</literal>, <literal>short</literal> or <literal>int</literal>.
es_es: soporta columnas de identidad en DB2, MySQL, MS SQL Server, Sybase y HypersonicSQL. El identificador devuelto es de tipo <literal>long</literal>, <literal>short</literal> o <literal>int</literal>.

source: uses a sequence in DB2, PostgreSQL, Oracle, SAP DB, McKoi or a generator in Interbase. The returned identifier is of type <literal>long</literal>, <literal>short</literal> or <literal>int</literal>
es_es: usa una secuencia en DB2, PostgreSQL, Oracle, SAP DB, McKoi o un generador en Interbase. El identificador devuelto es de tipo <literal>long</literal>, <literal>short</literal> o <literal>int</literal>.

source: uses a hi/lo algorithm to efficiently generate identifiers of type <literal>long</literal>, <literal>short</literal> or <literal>int</literal>, given a table and column (by default <literal>hibernate_unique_key</literal> and <literal>next_hi</literal> respectively) as a source of hi values. The hi/lo algorithm generates identifiers that are unique only for a particular database.
es_es: usa un algoritmo alto/bajo para generar eficientemente identificadores de tipo <literal>long</literal>, <literal>short</literal> o <literal>int</literal>, dada una tabla y columna como fuente de valores altos (por defecto <literal>hibernate_unique_key</literal> y <literal>next_hi</literal> respectivamente). El algoritmo alto/bajo genera identificadores que son únicos sólo para una base de datos particular.

source: uses a hi/lo algorithm to efficiently generate identifiers of type <literal>long</literal>, <literal>short</literal> or <literal>int</literal>, given a named database sequence.
es_es: usa un algoritmo alto/bajo para generar eficientemente identificadores de tipo <literal>long</literal>, <literal>short</literal> o <literal>int</literal>, dada una secuencia de base de datos.

source: uses a 128-bit UUID algorithm to generate identifiers of type string, unique within a network (the IP address is used). The UUID is encoded as a string of hexadecimal digits of length 32.
es_es: usa un algoritmo UUID de 128 bits para generar identificadore de tipo cadena, únicos en una ref (se usa la direccón IP). El UUID se codifica como una cadena hexadecimal de 32 dígitos de largo.

source: uses a database-generated GUID string on MS SQL Server and MySQL.
es_es: usa una cadena GUID generada por base de datos en MS SQL Server y MySQL.

source: picks <literal>identity</literal>, <literal>sequence</literal> or <literal>hilo</literal> depending upon the capabilities of the underlying database.
es_es: selecciona <literal>identity</literal>, <literal>sequence</literal> o <literal>hilo</literal> dependiendo de las capacidades de la base de datos subyacente.

source: lets the application to assign an identifier to the object before <literal>save()</literal> is called. This is the default strategy if no <literal>&lt;generator&gt;</literal> element is specified.
es_es: deja a la aplicación asignar un identificador al objeto antes de que se llame a <literal>save()</literal>. Esta es la estrategia por defecto si no se especifica un elemento <literal>&lt;generator&gt;</literal>.

source: retrieves a primary key assigned by a database trigger by selecting the row by some unique key and retrieving the primary key value.
es_es: recupera una clave primaria asignada por un disparador de base de datos seleccionando la fila por alguna clave única y recuperando el valor de la clave primaria.

source: uses the identifier of another associated object. Usually used in conjunction with a <literal>&lt;one-to-one&gt;</literal> primary key association.
es_es: usa el identificador de otro objeto asociado. Generalmente usado en conjuncón a una asociacón de clave primaria <literal>&lt;uno-a-uno&gt;</literal>

source: sequence-identity
es_es: UNTRANSLATED! sequence-identity

source: Hi/lo algorithm
es_es: Algoritmo alto/bajo

source: The <literal>hilo</literal> and <literal>seqhilo</literal> generators provide two alternate implementations of the hi/lo algorithm, a favorite approach to identifier generation. The first implementation requires a "special" database table to hold the next available "hi" value. The second uses an Oracle-style sequence (where supported).
es_es: Los generadores <literal>hilo</literal> y <literal>seqhilo</literal> proveen dos implementaciones alternativas del algoritmo alto/bajo, un enfoque favorito en generación de identificadores. La primera implementación requiere de una tabla "especial" de base de datos para tener el siguiente valor "alto" disponible. La segunda usa una secuencia del estilo de Oracle (donde se soporte).

source: Unfortunately, you can't use <literal>hilo</literal> when supplying your own <literal>Connection</literal> to Hibernate. When Hibernate is using an application server datasource to obtain connections enlisted with JTA, you must properly configure the <literal>hibernate.transaction.manager_lookup_class</literal>.
es_es: Desafortunadamente, no puedes usar <literal>hilo</literal> cuando le proveas tu propia <literal>Connection</literal> a Hibernate. Cuando Hibernate está usando un datasource del servidor de aplicaciones para obtener conexiones alistadas con JTA, debes configurar correctamente el <literal>hibernate.transaction.manager_lookup_class</literal>.

source: UUID algorithm
es_es: Algoritmo UUID

source: The UUID contains: IP address, startup time of the JVM (accurate to a quarter second), system time and a counter value (unique within the JVM). It's not possible to obtain a MAC address or memory address from Java code, so this is the best we can do without using JNI.
es_es: El UUID contiene: la dirección IP, el instante de arranque de la JVM (con una precisión de un cuarto de segundo), el tiempo de sistema y un valor de contador (único en la JVM). No es posible obtener una dirección MAC o una dirección de memoria desde código Java, así que esto es lo mejor que podemos hacer sin usar JNI.

source: Identity columns and sequences
es_es: Columnas de identidad y secuencias

source: For databases which support identity columns (DB2, MySQL, Sybase, MS SQL), you may use <literal>identity</literal> key generation. For databases that support sequences (DB2, Oracle, PostgreSQL, Interbase, McKoi, SAP DB) you may use <literal>sequence</literal> style key generation. Both these strategies require two SQL queries to insert a new object.
es_es: Para las bases de datos que soportan columnas de identidad (DB2, MySQL, Sybase, MS SQL), puedes usar generación de claves <literal>identity</literal>. Para las bases de datos que soportan secuencias (DB2, Oracle, PostgreSQL, Interbase, McKoi, SAP DB) puedes usar la generación de claves del estilo <literal>sequence</literal>. Ambas estrategias requieren dos consultas SQL para insertar un nuevo objeto.

source: For cross-platform development, the <literal>native</literal> strategy will choose from the <literal>identity</literal>, <literal>sequence</literal> and <literal>hilo</literal> strategies, dependant upon the capabilities of the underlying database.
es_es: Para desarrollos multiplataforma, la estrategia <literal>native</literal> eiligirá de entre las estrategias <literal>identity</literal>, <literal>sequence</literal> y <literal>hilo</literal>, dependiendo de las capacidades de la base de datos subyacentes.

source: Assigned identifiers
es_es: Identificadores asignados

source: If you want the application to assign identifiers (as opposed to having Hibernate generate them), you may use the <literal>assigned</literal> generator. This special generator will use the identifier value already assigned to the object's identifier property. This generator is used when the primary key is a natural key instead of a surrogate key. This is the default behavior if you do no specify a <literal>&lt;generator&gt;</literal> element.
es_es: Si quieres que la aplicación asigne los identificadores (en contraposición a que los genere Hibernate), puedes usar el generador <literal>assigned</literal>. Este generador especial usará el valor identificador ya asignado a la propiedad identificadora del objeto. Este generador se usa cuandola clave primaria es una clave natural en vez de una clave sustituta. Este es el comportamiento por defecto si no especificas un elemento <literal>&lt;generator&gt;</literal>.

source: Choosing the <literal>assigned</literal> generator makes Hibernate use <literal>unsaved-value="undefined"</literal>, forcing Hibernate to go to the database to determine if an instance is transient or detached, unless there is a version or timestamp property, or you define <literal>Interceptor.isUnsaved()</literal>.
es_es: Elegir el generador <literal>assigned</literal> hace que Hibernate use <literal>unsaved-value="undefined"</literal>, forzando a Hibernate a ir a la base de datos para determinar si una instancia es transitoria o separada, a menos que haya una propiedad de versión o timestamp, o que tu definas <literal>Interceptor.isUnsaved()</literal>.

source: Primary keys assigned by triggers
es_es: Claves primarias asignadas por disparadores

source: For legacy schemas only (Hibernate does not generate DDL with triggers).
es_es: Para esquemas heredados solamente (Hibernate no genera DDL con disparadores).

source: In the above example, there is a unique valued property named <literal>socialSecurityNumber</literal> defined by the class, as a natural key, and a surrogate key named <literal>person_id</literal> whose value is generated by a trigger.
es_es: En el ejemplo de arriba, hay una propiedad ánica llamada <literal>socialSecurityNumber</literal> definida por la clase, como una clave natural, y una clave sustituta llamada <literal>person_id</literal> cuyo valor es generado por un disparador.

source: For a table with a composite key, you may map multiple properties of the class as identifier properties. The <literal>&lt;composite-id&gt;</literal> element accepts <literal>&lt;key-property&gt;</literal> property mappings and <literal>&lt;key-many-to-one&gt;</literal> mappings as child elements.
es_es: Para una tabla con clave compuesta, puedes mapear múltiples propiedades de la clase como propiedades identificadoras. El elemento <literal>&lt;composite-id&gt;</literal> acepta los mapeos de propiedad <literal>&lt;key-property&gt;</literal> y los mapeos <literal>&lt;key-many-to-one&gt;</literal> como elementos hijo.

source: Your persistent class <emphasis>must</emphasis> override <literal>equals()</literal> and <literal>hashCode()</literal> to implement composite identifier equality. It must also implements <literal>Serializable</literal>.
es_es: Tu clase persistente <emphasis>debe</emphasis> sobreescribir <literal>equals()</literal> y <literal>hashCode()</literal> para implementar igualdad de identificador compuesto. Debe también implementar <literal>Serializable</literal>.

source: Unfortunately, this approach to composite identifiers means that a persistent object is its own identifier. There is no convenient "handle" other than the object itself. You must instantiate an instance of the persistent class itself and populate its identifier properties before you can <literal>load()</literal> the persistent state associated with a composite key. We call this approach an <emphasis>embedded</emphasis> composite identifier, and discourage it for serious applications.
es_es: Desafortunadamente, este enfoque de identificadores compuestos significa que un objeto persistente es su propio identificador. No existe otra "asa" conveniente más que el objeto mismo. Debes instanciar una instancia de la clase misma y poblar sus propiedades identificadoras antes que puedas <literal>load()</literal> el estado persistente asociado a una clave compuesta. Describiremos un enfoque mucho más conveniente donde el identificador compuesto está implementado como una clase separada en <xref linkend="components-compositeid"/>. Los atributos descriptos debajo solamente se aplican a este enfoque alternativo:

source: <literal>name</literal> (optional, required for this approach): A property of component type that holds the composite identifier (see chapter 9).
es_es: <literal>name</literal> (opcional): Una propiedad de tipo componente que tiene el identificador compuesto (ver siguiente sección).

source: <literal>class</literal> (optional - defaults to the property type determined by reflection): The component class used as a composite identifier (see next section).
es_es: <literal>class</literal> (opcional - por defecto al tipo de la propiedad determinado por reflección): La clase del componente usado como identificador compuesto (ver siguiente sección).

source: The <literal>&lt;discriminator&gt;</literal> element is required for polymorphic persistence using the table-per-class-hierarchy mapping strategy and declares a discriminator column of the table. The discriminator column contains marker values that tell the persistence layer what subclass to instantiate for a particular row. A restricted set of types may be used: <literal>string</literal>, <literal>character</literal>, <literal>integer</literal>, <literal>byte</literal>, <literal>short</literal>, <literal>boolean</literal>, <literal>yes_no</literal>, <literal>true_false</literal>.
es_es: El elemento <literal>&lt;discriminator&gt;</literal> es requerido para la persistencia polimórfica usando la estrategia de mapeo de tabla-por-jerarquía-de-clases y declara una columna discriminadora de la tabla. La columna discriminidora contiene valores de marca que le dicen a la capa de persistencia qué subclase instanciar para una fila en particular. Un conjunto restringido de tipos puede ser usado: <literal>string</literal>, <literal>character</literal>, <literal>integer</literal>, <literal>byte</literal>, <literal>short</literal>, <literal>boolean</literal>, <literal>yes_no</literal>, <literal>true_false</literal>.

source: <literal>column</literal> (optional - defaults to <literal>class</literal>) the name of the discriminator column.
es_es: <literal>column</literal> (opcional - por defecto a <literal>class</literal>) el nombre de la columna discriminadora.

source: <literal>type</literal> (optional - defaults to <literal>string</literal>) a name that indicates the Hibernate type
es_es: <literal>type</literal> (opcional - por defecto a <literal>string</literal>) un nombre que indique el tipo Hibernate

source: <literal>force</literal> (optional - defaults to <literal>false</literal>) "force" Hibernate to specify allowed discriminator values even when retrieving all instances of the root class.
es_es: <literal>force</literal> (optconal - por defecto a <literal>false</literal>) "fuerza" a Hibernate a especificar valores discriminadores permitidos incluso cuando se recuperan todas las instancias de la clase raíz.

source: <literal>insert</literal> (optional - defaults to <literal>true</literal>) set this to <literal>false</literal> if your discriminator column is also part of a mapped composite identifier. (Tells Hibernate to not include the column in SQL <literal>INSERT</literal>s.)
es_es: <literal>insert</literal> (opcional - por defecto a <literal>true</literal>) establezca este a <literal>false</literal> si tu columna discriminadora es también parte de un identificador mapeado compuesto. (Le dice a Hibernate que no incluya la columna en los SQL <literal>INSERT</literal>s.)

source: <literal>formula</literal> (optional) an arbitrary SQL expression that is executed when a type has to be evaluated. Allows content-based discrimination.
es_es: <literal>formula</literal> (opcional) una expresión SQL arbitraria que es ejecutada cuando un tipo tenga que ser evaluado. Permite dicriminación basada en el contenido.

source: Actual values of the discriminator column are specified by the <literal>discriminator-value</literal> attribute of the <literal>&lt;class&gt;</literal> and <literal>&lt;subclass&gt;</literal> elements.
es_es: Los valores reales de la columna discriminadora están especificados por el atributo <literal>discriminator-value</literal> de los elementos <literal>&lt;class&gt;</literal> y <literal>&lt;subclass&gt;</literal>.

source: The <literal>force</literal> attribute is (only) useful if the table contains rows with "extra" discriminator values that are not mapped to a persistent class. This will not usually be the case.
es_es: El atributo <literal>force</literal> es (sólo) útil si la tabla contiene filas con valores discriminadores "extra" que no están mapeados a la clase persistente. Generalmente este no es el caso.

source: Using the <literal>formula</literal> attribute you can declare an arbitrary SQL expression that will be used to evaluate the type of a row:
es_es: Usando el atributo <literal>formula</literal> puedes declarar una expresión SQL arbitraria que será usada para evaluar el tipo de una fila:

source: version (optional)
es_es: version (opcional)

source: The <literal>&lt;version&gt;</literal> element is optional and indicates that the table contains versioned data. This is particularly useful if you plan to use <emphasis>long transactions</emphasis> (see below).
es_es: El elemento <literal>&lt;version&gt;</literal> es opcional e indica que la tabla contiene datos versionados. Esto es particularmente útil si planeas usar <emphasis>transacciones largas</emphasis> (ver debajo).

source: <literal>column</literal> (optional - defaults to the property name): The name of the column holding the version number.
es_es: <literal>column</literal> (opcional - por defecto al nombre de la propiedad): El nombre de la columna que tiene el número de versión.
