Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/basic_mapping.po
Languages: es_es

source: <literal>name</literal>: The name of a property of the persistent class.
es_es: <literal>name</literal>: El nombre de una propiedad de la clase persistente.

source: <literal>type</literal> (optional - defaults to <literal>integer</literal>): The type of the version number.
es_es: <literal>type</literal> (opcional - por defecto a <literal>integer</literal>): El tipo del nú.mero de vesión.

source: <literal>unsaved-value</literal> (optional - defaults to <literal>undefined</literal>): A version property value that indicates that an instance is newly instantiated (unsaved), distinguishing it from detached instances that were saved or loaded in a previous session. (<literal>undefined</literal> specifies that the identifier property value should be used.)
es_es: <literal>unsaved-value</literal> (opcional - por defecto a <literal>undefined</literal>): Un valor de la propiedad de versión que indica que una instancia está recién instanciada (sin guardar), distinguiéndola de instancias separadas que fueran guardadas o cargadas en una sesión previa. (<literal>undefined</literal> especifica que debe usarse el valor de la propiedad identificadora.)

source: <literal>generated</literal> (optional - defaults to <literal>never</literal>): Specifies that this version property value is actually generated by the database. See the discussion of <link linkend="mapping-generated">generated properties</link>.
es_es: UNTRANSLATED! <literal>generated</literal> (optional - defaults to <literal>never</literal>): Specifies that this version property value is actually generated by the database. See the discussion of <link linkend="mapping-generated">generated properties</link>.

source: <literal>insert</literal> (optional - defaults to <literal>true</literal>): Specifies whether the version column should be included in SQL insert statements. May be set to <literal>false</literal> if and only if the database column is defined with a default value of <literal>0</literal>.
es_es: UNTRANSLATED! <literal>insert</literal> (optional - defaults to <literal>true</literal>): Specifies whether the version column should be included in SQL insert statements. May be set to <literal>false</literal> if and only if the database column is defined with a default value of <literal>0</literal>.

source: Version numbers may be of Hibernate type <literal>long</literal>, <literal>integer</literal>, <literal>short</literal>, <literal>timestamp</literal> or <literal>calendar</literal>.
es_es: Los números de versión deben ser de tipo <literal>long</literal>, <literal>integer</literal>, <literal>short</literal>, <literal>timestamp</literal> o <literal>calendar</literal> de Hibernate.

source: A version or timestamp property should never be null for a detached instance, so Hibernate will detect any instance with a null version or timestamp as transient, no matter what other <literal>unsaved-value</literal> strategies are specified. <emphasis>Declaring a nullable version or timestamp property is an easy way to avoid any problems with transitive reattachment in Hibernate, especially useful for people using assigned identifiers or composite keys!</emphasis>
es_es: Una propiedad de versión o timestamp nunca debe ser nula para una instancia separada, de modo que Hibernate detectará cualquier instancia con una versión o timestamp nulo como transitoria, sin importar qué otras estrategias <literal>unsaved-value</literal> se hayan especificado. <emphasis>Declarar una propiedad de versón o timestamp nulable es una forma fácil de evitar cualquier problema con la re-unión transitiva en Hibernate, especialmente útil para que usa identificadores asignados o claves compuestas!</emphasis>

source: timestamp (optional)
es_es: timestamp (opcional)

source: The optional <literal>&lt;timestamp&gt;</literal> element indicates that the table contains timestamped data. This is intended as an alternative to versioning. Timestamps are by nature a less safe implementation of optimistic locking. However, sometimes the application might use the timestamps in other ways.
es_es: El elemento opcional <literal>&lt;timestamp&gt;</literal> indica que la tabla contiene datos con sellos de tiempo. Esto esta concebido como una alternativa al versionado. Los timestamps (sellos de tiempo) son por su naturaleza una implementación menos segura de bloqueo optimista. Sin embrago, a veces la aplicación puede usar los timestamps en otras formas.

source: <literal>column</literal> (optional - defaults to the property name): The name of a column holding the timestamp.
es_es: <literal>column</literal> (opcional - por defecto al nombre de la propiedad): El nombre de una columna que tiene el timestamp.

source: <literal>name</literal>: The name of a JavaBeans style property of Java type <literal>Date</literal> or <literal>Timestamp</literal> of the persistent class.
es_es: <literal>name</literal>: El nombre de una propiedad del estilo JavaBeans de tipo Java <literal>Date</literal> o <literal>Timestamp</literal> de la clase persistente.

source: <literal>unsaved-value</literal> (optional - defaults to <literal>null</literal>): A version property value that indicates that an instance is newly instantiated (unsaved), distinguishing it from detached instances that were saved or loaded in a previous session. (<literal>undefined</literal> specifies that the identifier property value should be used.)
es_es: <literal>unsaved-value</literal> (opcional - por defecto a <literal>null</literal>): Un valor de propiedad de versión que indica que una instancia está recién instanciada (sin guardar), distinguiéndola de instancias separadas que hayan sido guardadas o cargadas en una sesión previa. (<literal>undefined</literal> especifica que debe usarse el valor de la propiedad identificadora.)

source: <literal>source</literal> (optional - defaults to <literal>vm</literal>): From where should Hibernate retrieve the timestamp value? From the database, or from the current JVM? Database-based timestamps incur an overhead because Hibernate must hit the database in order to determine the "next value", but will be safer for use in clustered environments. Note also, that not all <literal>Dialect</literal>s are known to support retrieving of the database's current timestamp, while others might be unsafe for usage in locking due to lack of precision (Oracle 8 for example).
es_es: UNTRANSLATED! <literal>source</literal> (optional - defaults to <literal>vm</literal>): From where should Hibernate retrieve the timestamp value? From the database, or from the current JVM? Database-based timestamps incur an overhead because Hibernate must hit the database in order to determine the "next value", but will be safer for use in clustered environments. Note also, that not all <literal>Dialect</literal>s are known to support retrieving of the database's current timestamp, while others might be unsafe for usage in locking due to lack of precision (Oracle 8 for example).

source: <literal>generated</literal> (optional - defaults to <literal>never</literal>): Specifies that this timestamp property value is actually generated by the database. See the discussion of <link linkend="mapping-generated">generated properties</link>.
es_es: UNTRANSLATED! <literal>generated</literal> (optional - defaults to <literal>never</literal>): Specifies that this timestamp property value is actually generated by the database. See the discussion of <link linkend="mapping-generated">generated properties</link>.

source: Note that <literal>&lt;timestamp&gt;</literal> is equivalent to <literal>&lt;version type="timestamp"&gt;</literal>. And <literal>&lt;timestamp source="db"&gt;</literal> is equivalent to <literal>&lt;version type="dbtimestamp"&gt;</literal>
es_es: Note that <literal>&lt;timestamp&gt;</literal> is equivalent to <literal>&lt;version type="timestamp"&gt;</literal>.

source: The <literal>&lt;property&gt;</literal> element declares a persistent, JavaBean style property of the class.
es_es: El elemento <literal>&lt;property&gt;</literal> declara una propiedad persistente estilo JavaBean de la clase.

source: <literal>name</literal>: the name of the property, with an initial lowercase letter.
es_es: <literal>name</literal>: el nombre de la propiedad, con la letra inicial en minúsculas.

source: <literal>column</literal> (optional - defaults to the property name): the name of the mapped database table column. This may also be specified by nested <literal>&lt;column&gt;</literal> element(s).
es_es: <literal>column</literal> (opcional - por defecto al nombre de la propiedad): el nombre de la columna de tabla de base de datos mapeada. Esto puede también ser especificado con elemento(s) <literal>&lt;column&gt;</literal> anidado(s).

source: <literal>type</literal> (optional): a name that indicates the Hibernate type.
es_es: <literal>type</literal> (opcional): un nombre que indica el nobre Hibernate.

source: <literal>update, insert</literal> (optional - defaults to <literal>true</literal>) : specifies that the mapped columns should be included in SQL <literal>UPDATE</literal> and/or <literal>INSERT</literal> statements. Setting both to <literal>false</literal> allows a pure "derived" property whose value is initialized from some other property that maps to the same colum(s) or by a trigger or other application.
es_es: <literal>update, insert</literal> (opcional - por defecto a <literal>true</literal>) : especifica que las columnas mapeadas deben ser incluídas en las sentencias SQL <literal>UPDATE</literal> y/o <literal>INSERT</literal> . Especificando ambas a <literal>false</literal> permite una propiedad "derivada" cuyo valor es inicializado desde alguna otra propiedad que mapee a la misma columna (o columnas) o por un disparador u otra aplicación.

source: <literal>formula</literal> (optional): an SQL expression that defines the value for a <emphasis>computed</emphasis> property. Computed properties do not have a column mapping of their own.
es_es: <literal>formula</literal> (opcional): una expresión SQL que define el valor para una propiedad <emphasis>computada</emphasis>. Las propiedades computadas no tienen una columna mapeada propia.

source: <literal>lazy</literal> (optional - defaults to <literal>false</literal>): Specifies that this property should be fetched lazily when the instance variable is first accessed (requires build-time bytecode instrumentation).
es_es: <literal>lazy</literal> (opcional - por defecto a <literal>false</literal>): Especifica que esta propiedad debe ser traída perezosamente cuando la variable de instancia sea accedida por primera vez (requiere instrumentación en tiempo de compilación).

source: <literal>unique</literal> (optional): Enable the DDL generation of a unique constraint for the columns. Also, allow this to be the target of a <literal>property-ref</literal>.
es_es: <literal>unique</literal> (opcional): Habilita la generació DDL de una restricción de unicidad para las columnas. Además, permite que ésta sea un blanco objetivo de una <literal>property-ref</literal>.

source: <literal>not-null</literal> (optional): Enable the DDL generation of a nullability constraint for the columns.
es_es: <literal>not-null</literal> (opcional): Habilita la generació DDL de una restricción de nulabilidad para las columnas.

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Specifies that updates to this property do or do not require acquisition of the optimistic lock. In other words, determines if a version increment should occur when this property is dirty.
es_es: <literal>optimistic-lock</literal> (opcional - por defecto a <literal>true</literal>): Especifica que las actualizaciones a esta propiedad requieran o no de la obtención de un bloqueo optimista. En otras palabras, determina si debe ocurrir un incremento de versión cuando la propiedad este sucia (desactualizada).

source: <literal>generated</literal> (optional - defaults to <literal>never</literal>): Specifies that this property value is actually generated by the database. See the discussion of <link linkend="mapping-generated">generated properties</link>.
es_es: UNTRANSLATED! <literal>generated</literal> (optional - defaults to <literal>never</literal>): Specifies that this property value is actually generated by the database. See the discussion of <link linkend="mapping-generated">generated properties</link>.

source: <emphasis>typename</emphasis> could be:
es_es: <emphasis>typename</emphasis> puede ser:

source: The name of a Hibernate basic type (eg. <literal>integer, string, character, date, timestamp, float, binary, serializable, object, blob</literal>).
es_es: El nombre de un tipo básico Hibernate (por ejemplo, <literal>integer, string, character, date, timestamp, float, binary, serializable, object, blob</literal>).

source: The name of a Java class with a default basic type (eg. <literal>int, float, char, java.lang.String, java.util.Date, java.lang.Integer, java.sql.Clob</literal>).
es_es: El nombre de una clase Java de tipo básico (por ejemplo, <literal>int, float, char, java.lang.String, java.util.Date, java.lang.Integer, java.sql.Clob</literal>).

source: The name of a serializable Java class.
es_es: El nombre de una clase Java serializable.

source: The class name of a custom type (eg. <literal>com.illflow.type.MyCustomType</literal>).
es_es: El nombre de un tipo personalizado (por ejemplo, <literal>com.illflow.type.MyCustomType</literal>).

source: If you do not specify a type, Hibernate will use reflection upon the named property to take a guess at the correct Hibernate type. Hibernate will try to interpret the name of the return class of the property getter using rules 2, 3, 4 in that order. However, this is not always enough. In certain cases you will still need the <literal>type</literal> attribute. (For example, to distinguish between <literal>Hibernate.DATE</literal> and <literal>Hibernate.TIMESTAMP</literal>, or to specify a custom type.)
es_es: Si no especificas un tipo, Hibernate usará reflección sobre la propiedad mencionada para deducir el tipo Hibernate correcto. Hibernate intentará interpretar el nombre de la clase de retorno del getter de la propiedad usando las reglas 2, 3 y 4 en ese orden. Sin embargo, esto no siempre suficiente. En ciertos casos, necesitarás aún el atributo <literal>type</literal>. (Por ejemplo, para distinguir entre <literal>Hibernate.DATE</literal> y <literal>Hibernate.TIMESTAMP</literal>, o especificar un tipo personalizado.)

source: The <literal>access</literal> attribute lets you control how Hibernate will access the property at runtime. By default, Hibernate will call the property get/set pair. If you specify <literal>access="field"</literal>, Hibernate will bypass the get/set pair and access the field directly, using reflection. You may specify your own strategy for property access by naming a class that implements the interface <literal>org.hibernate.property.PropertyAccessor</literal>.
es_es: El atributo <literal>access</literal> te deja controlar cómo Hibernate accederá a la propiedad en tiempo de ejecución. Por defecto, Hibernate llamará al par de getter/setter de la propiedad. Si especificas <literal>access="field"</literal>, Hibernate se saltará el par get/set y accederá al campo directamente usando reflección. Puedes especificar tu propia estrategia de acceso a la propiedad mencionando una clase que implemente la interface <literal>org.hibernate.property.PropertyAccessor</literal>.

source: An especially powerful feature are derived properties. These properties are by definition read-only, the property value is computed at load time. You declare the computation as a SQL expression, this translates to a <literal>SELECT</literal> clause subquery in the SQL query that loads an instance:
es_es: Una aspecto especialmente poderoso son las propiedades derivadas. Estas propiedades son por definición de sólo lectura, el valor de la propiedad es computado en tiempo de carga. Tu declaras la computación como una expresión SQL, y ésta se traduce a cláusula de subconsulta <literal>SELECT</literal> en la consulta SQL que cargue una instancia:

source: Note that you can reference the entities own table by not declaring an alias on a particular column (<literal>customerId</literal> in the given example). Also note that you can use the nested <literal>&lt;formula&gt;</literal> mapping element if you don't like to use the attribute.
es_es: Observa que puedes referenciar la propia tabla de las entidades sin declarar un alias o una columna particular (<literal>customerId</literal> en el ejemplo dado). Observa además que puedes usar el elemento anidado de mapeo <literal>&lt;formula&gt;</literal> si no te gusta usar el atributo.

source: An ordinary association to another persistent class is declared using a <literal>many-to-one</literal> element. The relational model is a many-to-one association: a foreign key in one table is referencing the primary key column(s) of the target table.
es_es: Una asociación ordinaria a otra clase persistente se declara usando el elemento <literal>many-to-one</literal>. El modelo relacional es una asociación muchos-a-uno: una clave foránea en una tabla está referenciando la columna (o columnas) de la clave primaria de la tabla objetivo.

source: <literal>name</literal>: The name of the property.
es_es: <literal>name</literal>: El nombre de la propiedad.

source: <literal>class</literal> (optional - defaults to the property type determined by reflection): The name of the associated class.
es_es: <literal>class</literal> (opcional - por defecto al tipo de la propiedad determinado por reflección): El nombre de la clase asociada.

source: <literal>cascade</literal> (optional): Specifies which operations should be cascaded from the parent object to the associated object.
es_es: <literal>cascade</literal> (opcional): Especifica qué operaciones deben ir en cascada desde el objeto padre al objeto asociado

source: <literal>update, insert</literal> (optional - defaults to <literal>true</literal>) specifies that the mapped columns should be included in SQL <literal>UPDATE</literal> and/or <literal>INSERT</literal> statements. Setting both to <literal>false</literal> allows a pure "derived" association whose value is initialized from some other property that maps to the same colum(s) or by a trigger or other application.
es_es: <literal>update, insert</literal> (opcional - por defecto a <literal>true</literal>) especifica que las columnas mapeadas deben ser incluídas en las sentencias SQL <literal>UPDATE</literal> y/o <literal>INSERT</literal>. Establecer ambas a <literal>false</literal> permite una asociación puramente "derivada" cuyo valor es inicializado desde alguna otra propiedad que mapea a las misma columna (o columnas), o por un disparador, o por otra aplicación.

source: <literal>property-ref</literal>: (optional) The name of a property of the associated class that is joined to this foreign key. If not specified, the primary key of the associated class is used.
es_es: <literal>property-ref</literal>: (opcional) El nombre de la propiedad de la clase asociada que está unida a la clave foránea. Si no se especifica, se usa la clave primaria de la clase asociada.

source: <literal>unique</literal> (optional): Enable the DDL generation of a unique constraint for the foreign-key column. Also, allow this to be the target of a <literal>property-ref</literal>. This makes the association multiplicity effectively one to one.
es_es: <literal>unique</literal> (opcional): Habilita la generación DDL de una restricción de unicidad para la columna de clave foránea. Además, permite que ésta sea el objetivo de una <literal>property-ref</literal>. Esto hace efectivamente la multiplicidad de la asociación uno a uno.

source: <literal>not-null</literal> (optional): Enable the DDL generation of a nullability constraint for the foreign key columns.
es_es: <literal>not-null</literal> (opcional): Habilita la generación DDL de una restricción de nulabilidad para las columnas de clave foránea.

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Specifies that updates to this property do or do not require acquisition of the optimistic lock. In other words, dertermines if a version increment should occur when this property is dirty.
es_es: <literal>optimistic-lock</literal> (opcional - por defecto a <literal>true</literal>): Especifica que las actualizaciones a esta propiedad requieran o no la obtención del bloqueo optimista. En otras palabras, determina si debe darse un incremento de versión cuando esta propiedad esté desactualizada.

source: <literal>lazy</literal> (optional - defaults to <literal>proxy</literal>): By default, single point associations are proxied. <literal>lazy="no-proxy"</literal> specifies that the property should be fetched lazily when the instance variable is first accessed (requires build-time bytecode instrumentation). <literal>lazy="false"</literal> specifies that the association will always be eagerly fetched.
es_es: <literal>lazy</literal> (opcional - por defecto a <literal>proxy</literal>): Por defecto, las asociaciones de punto único van con proxies. <literal>lazy="true"</literal> especifica que esta propiedad debe ser traída perezosamente cuando la variable de instancia sea accedida por primera vez (requiere instrumentación del bytecode en tiempo de compilación). <literal>lazy="false"</literal> especifica que la asociación siempre será recuperada tempranamente.

source: <literal>not-found</literal> (optional - defaults to <literal>exception</literal>): Specifies how foreign keys that reference missing rows will be handled: <literal>ignore</literal> will treat a missing row as a null association.
es_es: <literal>not-found</literal> (opcional - por defecto a <literal>exception</literal>): Especifica cómo deben manejarse las claves foráneas que referencien filas inexistentes: <literal>ignore</literal> tratará una fila perdida como una asociación nula.

source: <literal>formula</literal> (optional): an SQL expression that defines the value for a <emphasis>computed</emphasis> foreign key.
es_es: <literal>formula</literal> (opcional): una expresión SQL que define el valor para una clave foránea <emphasis>computada</emphasis>.

source: Setting a value of the <literal>cascade</literal> attribute to any meaningful value other than <literal>none</literal> will propagate certain operations to the associated object. The meaningful values are the names of Hibernate's basic operations, <literal>persist, merge, delete, save-update, evict, replicate, lock, refresh</literal>, as well as the special values <literal>delete-orphan</literal> and <literal>all</literal> and comma-separated combinations of operation names, for example, <literal>cascade="persist,merge,evict"</literal> or <literal>cascade="all,delete-orphan"</literal>. See <xref linkend="objectstate-transitive"/> for a full explanation. Note that single valued associations (many-to-one and one-to-one associations) do not support orphan delete.
es_es: Establecer el valor del atributo <literal>cascade</literal> a cualquier valor significativo distinto de <literal>none</literal> propagará ciertas operaciones al objeto asociado. Los valores significativos son los nombres de las operaciones básicas de Hibernate, <literal>persist, merge, delete, save-update, evict, replicate, lock, refresh</literal>, así como los valores especiales <literal>delete-orphan</literal> y <literal>all</literal> y combinaciones de operaciones separadas por coma, por ejemplo, <literal>cascade="persist,merge,evict"</literal> o <literal>cascade="all,delete-orphan"</literal>. Para una explicación completa, ver <xref linkend="objectstate-transitive"/>.
