Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/basic_mapping.po
Languages: es_es

source: To implement a custom type, implement either <literal>org.hibernate.UserType</literal> or <literal>org.hibernate.CompositeUserType</literal> and declare properties using the fully qualified classname of the type. Check out <literal>org.hibernate.test.DoubleStringType</literal> to see the kind of things that are possible.
es_es: Para implementar un tipo personalizado, implementa bien <literal>org.hibernate.UserType</literal> o <literal>org.hibernate.CompositeUserType</literal> y declara las propiedades usando el nombre de clase completamente cualificado del tipo. Revisa <literal>org.hibernate.test.DoubleStringType</literal> para ver qué tipo de cosas son posibles.

source: Notice the use of <literal>&lt;column&gt;</literal> tags to map a property to multiple columns.
es_es: Observa el uso de etiquetas <literal>&lt;column&gt;</literal> para mapear una propiedad a múltiples columnas.

source: The <literal>CompositeUserType</literal>, <literal>EnhancedUserType</literal>, <literal>UserCollectionType</literal>, and <literal>UserVersionType</literal> interfaces provide support for more specialized uses.
es_es: Las interfaces <literal>CompositeUserType</literal>, <literal>EnhancedUserType</literal>, <literal>UserCollectionType</literal>, y <literal>UserVersionType</literal> proveen soporte a usos más especializados.

source: You may even supply parameters to a <literal>UserType</literal> in the mapping file. To do this, your <literal>UserType</literal> must implement the <literal>org.hibernate.usertype.ParameterizedType</literal> interface. To supply parameters to your custom type, you can use the <literal>&lt;type&gt;</literal> element in your mapping files.
es_es: Puedes incluso proveer de parámetros a un <literal>UserType</literal> en el fichero de mapeo. Para hacer esto, tu <literal>UserType</literal> debe implementar la interface <literal>org.hibernate.usertype.ParameterizedType</literal>. Para proveer de parámetros a tu tipo personalizado, puedes usar el elemento <literal>&lt;type&gt;</literal> en tus ficheros de mapeo.

source: The <literal>UserType</literal> can now retrieve the value for the parameter named <literal>default</literal> from the <literal>Properties</literal> object passed to it.
es_es: Ahora el <literal>UserType</literal> puede recuperar el valor del parámetro llamado <literal>default</literal> del objeto <literal>Properties</literal> que se le pasa.

source: If you use a certain <literal>UserType</literal> very often, it may be useful to define a shorter name for it. You can do this using the <literal>&lt;typedef&gt;</literal> element. Typedefs assign a name to a custom type, and may also contain a list of default parameter values if the type is parameterized.
es_es: Si usas cierto <literal>UserType</literal> muy frecuentemente, puede ser útil definir un nombre corto para é. Puedes hacer esto usando el elemento <literal>&lt;typedef&gt;</literal>. Los typedefs asignan un nombre a un tipo personalizado, y pueden también contener una lista de valores por defecto de parámetros si el tipo fuese parametrizado.

source: It is also possible to override the parameters supplied in a typedef on a case-by-case basis by using type parameters on the property mapping.
es_es: también es posible sobrescribir los parámetros provistos en un typedef sobre una base caso por caso usando parámetros de tipo en el mapeo de la propiedad.

source: Even though Hibernate's rich range of built-in types and support for components means you will very rarely <emphasis>need</emphasis> to use a custom type, it is nevertheless considered good form to use custom types for (non-entity) classes that occur frequently in your application. For example, a <literal>MonetaryAmount</literal> class is a good candidate for a <literal>CompositeUserType</literal>, even though it could easily be mapped as a component. One motivation for this is abstraction. With a custom type, your mapping documents would be future-proofed against possible changes in your way of representing monetary values.
es_es: Aunque el rico espectro de tipos prefabricados y soporte de componentes de Hibernate significa que raramente <emphasis>necesites</emphasis> usar un tipo personalizado; sin embargo se considera una buena forma usar tipos personalizados para clases (no-entidades) que aparezcan frecuentemente en tu aplicación. Por ejemplo, una clase <literal>MonetaryAmount</literal> es una buena candidata para un <literal>CompositeUserType</literal>, incluso cuando puede ser facilmente mapeada como un componente. Un motivo para esto es la abstracción. Con un tipo personalizado, tus documentos de mapeo estará impermeabilizados contra posibles cambios futuros en la forma de representar valores monetarios.

source: Mapping a class more than once
es_es: Mapeando una clase más de una vez

source: It is possible to provide more than one mapping for a particular persistent class. In this case you must specify an <emphasis>entity name</emphasis> do disambiguate between instances of the two mapped entities. (By default, the entity name is the same as the class name.) Hibernate lets you specify the entity name when working with persistent objects, when writing queries, or when mapping associations to the named entity.
es_es: Es posible proveer más de un mapeo para una clase persistente en particular. En este caso debes especificar un <emphasis>nombre de entidad</emphasis> para desambiguar entr las instancias de las dos entidades mapeadas. (Por defectom, el nombre de la entidad es el mismo que el nombre de la clase.) Hibernate te deja especificar el nombre de entidad al trabajar con objetos persistentes, al escribir consultas, o al mapear asociaciones a la entidad mencionada.

source: Notice how associations are now specified using <literal>entity-name</literal> instead of <literal>class</literal>.
es_es: Observa cómo las asociaciones ahora se especifican usando <literal>entity-name</literal> en vez de <literal>class</literal>.

source: SQL quoted identifiers
es_es: identificadores SQL encomillados

source: You may force Hibernate to quote an identifier in the generated SQL by enclosing the table or column name in backticks in the mapping document. Hibernate will use the correct quotation style for the SQL <literal>Dialect</literal> (usually double quotes, but brackets for SQL Server and backticks for MySQL).
es_es: Puedes forzar a Hibernate a encomillar un identificador en el SQL generado encerrando el nombre de tabla o columna entre backticks en el documento de mapeo. Hibernate usará el estilo de encomillado para el <literal>Dialect</literal> SQL (usualmente comillas dobles, excepto corchetes para SQL Server y backsticks para MySQL).

source: Metadata alternatives
es_es: Alternativas de metadatos

source: XML isn't for everyone, and so there are some alternative ways to define O/R mapping metadata in Hibernate.
es_es: XML no es para todos, asá que hay algunas formas alternativas de definir metadatos de mapeo O/R en Hibernate.

source: Using XDoclet markup
es_es: Usando marcado de XDoclet

source: Many Hibernate users prefer to embed mapping information directly in sourcecode using XDoclet <literal>@hibernate.tags</literal>. We will not cover this approach in this document, since strictly it is considered part of XDoclet. However, we include the following example of the <literal>Cat</literal> class with XDoclet mappings.
es_es: Muchos usuarios de Hibernate prefieren embeber la información de mapeo directamente en el código fuente usando las <literal>@hibernate.etiquetas</literal> XDoclet. No cubriremos este enfoque en este documento, pues estrictamente es considerado parte de XDoclet. Sin embargo, incluímos el siguiente ejemplo de la clase <literal>Cat</literal> con mapeos XDoclet.

source: See the Hibernate web site for more examples of XDoclet and Hibernate.
es_es: Para más ejemplos de XDoclet e Hibernate ver en el sitio web de Hibernate.

source: Using JDK 5.0 Annotations
es_es: Usando anotaciones JDK 5.0

source: JDK 5.0 introduced XDoclet-style annotations at the language level, type-safe and checked at compile time. This mechnism is more powerful than XDoclet annotations and better supported by tools and IDEs. IntelliJ IDEA, for example, supports auto-completion and syntax highlighting of JDK 5.0 annotations. The new revision of the EJB specification (JSR-220) uses JDK 5.0 annotations as the primary metadata mechanism for entity beans. Hibernate3 implements the <literal>EntityManager</literal> of JSR-220 (the persistence API), support for mapping metadata is available via the <emphasis>Hibernate Annotations</emphasis> package, as a separate download. Both EJB3 (JSR-220) and Hibernate3 metadata is supported.
es_es: El JDK 5.0 introdujo anotaciones del estilo XDoclet a nivel del lenguaje, con chequeo seguro de tipos en tiempo de compilación. Este mecanismo es más potente y que las anotaciones XDoclet, y mejor soportado por herramientas e IDEs. IntelliJ IDEA, por ejemplo, soporta auto-compleción y resaltado de sintaxis de anotaciones JDK 5.0. La nueva revisión de la especificación de EJB (JSR-220) usa anotaciones JDK 5.0 como el mecanismo primario de metadatos para beans de entidad. Hibernate3 implementa el <literal>EntityManager</literal> del JSR-220 (la API de persistencia), y el soporte para metadatos de mapeo está disponible vía el paquete <emphasis>Hibernate Annotations</emphasis>, como una descarga por separado. Tanto metadatos de EJB3 (JSR-220) como de Hibernate3 están soportados.

source: This is an example of a POJO class annotated as an EJB entity bean:
es_es: Este es un ejemplo de una clase POJO anotada como un bean de entidad EJB:

source: Note that support for JDK 5.0 Annotations (and JSR-220) is still work in progress and not completed. Please refer to the Hibernate Annotations module for more details.
es_es: Ten en cuenta que el soporte a anotaciones JDK 5.0 (y JSR-220) es todavía un trabajo en progreso y no completado. Por favor, para más detalles refiérete al modulo de Anotaciones de Hibernate.

source: Generated Properties
es_es: translator-credits
