Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/basic_mapping.po
Languages: es_es

source: Basic O/R Mapping
es_es: Mapeo O/R Básico

source: Mapping declaration
es_es: Declaración de mapeo

source: Object/relational mappings are usually defined in an XML document. The mapping document is designed to be readable and hand-editable. The mapping language is Java-centric, meaning that mappings are constructed around persistent class declarations, not table declarations.
es_es: Los mapeos objeto/relacional se definen usualmente en un documento XML. El documento de mapeo está diseñado para ser leíble y editable a mano. El lenguaje de mapeo es Java-céntrico, o sea que los mapeos se construyen alrededor de declaraciones de clases persistentes, no declaraciones de tablas.

source: Note that, even though many Hibernate users choose to write the XML by hand, a number of tools exist to generate the mapping document, including XDoclet, Middlegen and AndroMDA.
es_es: Observa que, incluso aunque muchos usuarios de Hibernate eligen escribir el XML a mano, existe una cantidad de herramientas para generar el documento de mapeo, incluyendo XDoclet, Middlegen y AndroMDA.

source: Lets kick off with an example mapping:
es_es: Comencemos por un mapeo de ejemplo:

source: We will now discuss the content of the mapping document. We will only describe the document elements and attributes that are used by Hibernate at runtime. The mapping document also contains some extra optional attributes and elements that affect the database schemas exported by the schema export tool. (For example the <literal> not-null</literal> attribute.)
es_es: Discutiremos ahora el contenido del documento de mapeo. Describiremos sólo los elementos y atributos que son usados por Hibernate en tiempo de ejecución. El documento de mapeo contiene además algunos atributos y elementos extra opcionales que afectan los esquemas de base de datos exportados por la herramienta de exportación de esquemas. (Por ejemplo, el atributo <literal>not-null</literal>.)

source: All XML mappings should declare the doctype shown. The actual DTD may be found at the URL above, in the directory <literal>hibernate-x.x.x/src/org/hibernate </literal> or in <literal>hibernate3.jar</literal>. Hibernate will always look for the DTD in its classpath first. If you experience lookups of the DTD using an Internet connection, check your DTD declaration against the contents of your claspath.
es_es: Todos los mapeos XML deben declarar el doctype mostrado. El DTD actual puede ser encontrado en el URL mencionado arriba, en el directorio <literal>hibernate-x.x.x/src/org/hibernate</literal>, o en <literal>hibernate3.jar</literal>. Hibernate siempre buscará el DTD primero en el classpath. Si experimentas búsquedas del DTD usando una conexión de Internet, chequea tu declaración de DTD contra la contenida en el classpath.

source: EntityResolver
es_es: UNTRANSLATED! EntityResolver

source: This element has several optional attributes. The <literal>schema</literal> and <literal>catalog</literal> attributes specify that tables referred to in this mapping belong to the named schema and/or catalog. If specified, tablenames will be qualified by the given schema and catalog names. If missing, tablenames will be unqualified. The <literal>default-cascade</literal> attribute specifies what cascade style should be assumed for properties and collections which do not specify a <literal>cascade</literal> attribute. The <literal>auto-import</literal> attribute lets us use unqualified class names in the query language, by default.
es_es: Este elemento tiene muchos atributos opcionales. Los atributos <literal>schema</literal> y <literal>catalog</literal> especifican que las tablas a las que se refiere en el mapeo pertenecen al esquema y/o catálogo mencionado(s). De especificarse, los nombres de tablas serán cualificados por el nombre de esquema y catálogo dados. De omitirse, los nombres de tablas no serán cualificados. El atributo <literal>default-cascade</literal> especifica qué estilo de cascada debe asumirse para las propiedades y colecciones que no especifican un atributo <literal>cascade</literal>. El atributo <literal>auto-import</literal> nos permite usar nombres de clase sin cualificar en el lenguaje de consulta, por defecto.

source: <literal>schema</literal> (optional): The name of a database schema.
es_es: <literal>schema</literal> (opcional): El nombre de un esquema de la base de datos.

source: <literal>catalog</literal> (optional): The name of a database catalog.
es_es: <literal>catalog</literal> (opcional): El nombre de un catálogo de la base de datos.

source: <literal>default-cascade</literal> (optional - defaults to <literal>none</literal>): A default cascade style.
es_es: <literal>default-cascade</literal> (opcional - por defecto a <literal>none</literal>): Un estilo de cascada por defecto.

source: <literal>default-access</literal> (optional - defaults to <literal>property</literal>): The strategy Hibernate should use for accessing all properties. Can be a custom implementation of <literal>PropertyAccessor</literal>.
es_es: <literal>default-access</literal> (opcional - por defecto a <literal>property</literal>): La estrategia que Hibernate debe usar para acceder a todas las propiedades. Puede ser una implementación personalizada de <literal>PropertyAccessor</literal>.

source: <literal>default-lazy</literal> (optional - defaults to <literal>true</literal>): The default value for unspecifed <literal>lazy</literal> attributes of class and collection mappings.
es_es: <literal>default-lazy</literal> (opcional - por defecto a <literal>true</literal>): El valor por defecto para los atributos <literal>lazy</literal> de mapeos de clase y colleción no especificados.

source: <literal>auto-import</literal> (optional - defaults to <literal>true</literal>): Specifies whether we can use unqualified class names (of classes in this mapping) in the query language.
es_es: <literal>auto-import</literal> (opcional - por defecto a <literal>true</literal>): Especifica si podemos usar nombres de clases no cualificados (de clases en este mapeo) en el lenguaje de consulta.

source: <literal>package</literal> (optional): Specifies a package prefix to assume for unqualified class names in the mapping document.
es_es: <literal>package</literal> (opcional): Especifica un prefijo de paquete a asumir para los nombres no cualificados de clase en el documento de mapeo.

source: If you have two persistent classes with the same (unqualified) name, you should set <literal>auto-import="false"</literal>. Hibernate will throw an exception if you attempt to assign two classes to the same "imported" name.
es_es: Si tienes dos clases persistentes con el mismo nombre (sin cualificar), debes establecer <literal>auto-import="false"</literal>. Hibernate lanzará una excepción si intentas asignar dos clases al mismo nombre "importado".

source: Note that the <literal>hibernate-mapping</literal> element allows you to nest several persistent <literal>&lt;class&gt;</literal> mappings, as shown above. It is however good practice (and expected by some tools) to map only a single persistent class (or a single class hierarchy) in one mapping file and name it after the persistent superclass, e.g. <literal>Cat.hbm.xml</literal>, <literal>Dog.hbm.xml</literal>, or if using inheritance, <literal>Animal.hbm.xml</literal>.
es_es: Observa que el elemento <literal>hibernate-mapping</literal> te permite anidar muchos mapeos <literal>&lt;class&gt;</literal> persistentes, como se muestra arriba. Sin embargo, es una buena práctica (y se espera de algunas herramientas) mapear sólo a una sola clase persistente (o a una sola jerarquía de clases) en un fichero de mapeo y nombrarlo después de la superclase persistente; por ejemplo, <literal>Cat.hbm.xml</literal>, <literal>Dog.hbm.xml</literal>, o, si se usa herencia, <literal>Animal.hbm.xml</literal>.

source: You may declare a persistent class using the <literal>class</literal> element:
es_es: Puedes declarar una clase persistente usando el elemento <literal>class</literal>:

source: <literal>name</literal> (optional): The fully qualified Java class name of the persistent class (or interface). If this attribute is missing, it is assumed that the mapping is for a non-POJO entity.
es_es: <literal>name</literal> (opcional): El nombre completamente cualificado de la clase Java persistente (o interface). Si este atributo es omitido, se asume que el mapeo es para una entidad non-POJO.

source: <literal>table</literal> (optional - defaults to the unqualified class name): The name of its database table.
es_es: <literal>table</literal> (opcional - por defecto al nombre no cualificado de la clase): El nombre de su tabla en base de datos.

source: <literal>discriminator-value</literal> (optional - defaults to the class name): A value that distiguishes individual subclasses, used for polymorphic behaviour. Acceptable values include <literal>null</literal> and <literal>not null</literal>.
es_es: <literal>discriminator-value</literal> (opcional - por defecto al nombre de la clase): Un valor que distingue subclases individuales, usado para el comportamiento polimórfico. Los valores aceptables incluyen <literal>null</literal> y <literal>not null</literal>.

source: <literal>mutable</literal> (optional, defaults to <literal>true</literal>): Specifies that instances of the class are (not) mutable.
es_es: <literal>mutable</literal> (opcional, por defecto a <literal>true</literal>): Especifica que las instancias de la clase (no) son mutables.

source: <literal>proxy</literal> (optional): Specifies an interface to use for lazy initializing proxies. You may specify the name of the class itself.
es_es: <literal>proxy</literal> (opcional): Especifica una interface a usar para proxies de inicialización perezosa. Puedes especificar el nombre mismo de la clase.

source: <literal>dynamic-update</literal> (optional, defaults to <literal>false</literal>): Specifies that <literal>UPDATE</literal> SQL should be generated at runtime and contain only those columns whose values have changed.
es_es: <literal>dynamic-update</literal> (opcional, por defecto a <literal>false</literal>): Especifica que el SQL <literal>UPDATE</literal> debe ser generado en tiempo de ejecución y contener solamente aquellas columnas cuyo valor haya cambiado.

source: <literal>dynamic-insert</literal> (optional, defaults to <literal>false</literal>): Specifies that <literal>INSERT</literal> SQL should be generated at runtime and contain only the columns whose values are not null.
es_es: <literal>dynamic-insert</literal> (opcional, por defecto a <literal>false</literal>): Especifica que el SQL <literal>INSERT</literal> debe ser generado en tiempo de ejecución y contener solamente aquellas columnas cuyo valores no son nulos.

source: <literal>select-before-update</literal> (optional, defaults to <literal>false</literal>): Specifies that Hibernate should <emphasis>never</emphasis> perform an SQL <literal>UPDATE</literal> unless it is certain that an object is actually modified. In certain cases (actually, only when a transient object has been associated with a new session using <literal>update()</literal>), this means that Hibernate will perform an extra SQL <literal>SELECT</literal> to determine if an <literal>UPDATE</literal> is actually required.
es_es: <literal>select-before-update</literal> (opcional, por defecto a <literal>false</literal>): Especifica que Hibernate <emphasis>nunca</emphasis> debe realizar un SQL <literal>UPDATE</literal> a menos que se tenga certeza que un objeto haya sido modificado realmente. En ciertos casos, (realmente, sólo cuando un objeto transitorio ha sido asociado con una sesión nueva usando <literal>update()</literal>), esto significa que Hibernate realizará una SQL <literal>SELECT</literal> extra para determinar si un <literal>UPDATE</literal> es realmente requerido.

source: <literal>polymorphism</literal> (optional, defaults to <literal>implicit</literal>): Determines whether implicit or explicit query polymorphism is used.
es_es: <literal>polymorphism</literal> (opcional, por defecto a <literal>implicit</literal>): Determina si se usa polimorfismo de consulta implícito o explícito.

source: <literal>where</literal> (optional) specify an arbitrary SQL <literal>WHERE</literal> condition to be used when retrieving objects of this class
es_es: <literal>where</literal> (opcional) especifica una condición SQL <literal>WHERE</literal> arbitraria paraa ser usada al recuperar objetos de esta clase.

source: <literal>persister</literal> (optional): Specifies a custom <literal>ClassPersister</literal>.
es_es: <literal>persister</literal> (opcional): Especifica un <literal>ClassPersister</literal> personalizado.

source: <literal>batch-size</literal> (optional, defaults to <literal>1</literal>) specify a "batch size" for fetching instances of this class by identifier.
es_es: <literal>batch-size</literal> (opcional, por defecto a <literal>1</literal>) especifica un "tamaño de lote" para traer instancias de esta clase por identificador.

source: <literal>optimistic-lock</literal> (optional, defaults to <literal>version</literal>): Determines the optimistic locking strategy.
es_es: <literal>optimistic-lock</literal> (opcional, por defecto a <literal>version</literal>): Determina la estrategia optimista de bloqueo.

source: <literal>lazy</literal> (optional): Lazy fetching may be completely disabled by setting <literal>lazy="false"</literal>.
es_es: <literal>lazy</literal> (opcional): La recuperación perezosa puede ser deshabilitada por completo estableciendo <literal>lazy="false"</literal>.

source: <literal>entity-name</literal> (optional, defaults to the class name): Hibernate3 allows a class to be mapped multiple times (to different tables, potentially), and allows entity mappings that are represented by Maps or XML at the Java level. In these cases, you should provide an explicit arbitrary name for the entity. See <xref linkend="persistent-classes-dynamicmodels"/> and <xref linkend="xml"/> for more information.
es_es: <literal>entity-name</literal> (opcional): Hibernate3 permite que una clase sea mapeada varias veces (potencialmente a tablas diferentes), y permite que los mapeos de entidad sean representados por Maps o XML al nivel de Java. En estos casos, debes proveer un nombre explícito arbitrario para la entidad. Para más información, mira <xref linkend="persistent-classes-dynamicmodels"/> y <xref linkend="xml"/>.

source: <literal>check</literal> (optional): A SQL expression used to generate a multi-row <emphasis>check</emphasis> constraint for automatic schema generation.
es_es: <literal>check</literal> (opcional): Una expresión SQL usada para generar una restricción <emphasis>check</emphasis> multi-fila para la generación automática de esquema.

source: <literal>rowid</literal> (optional): Hibernate can use so called ROWIDs on databases which support. E.g. on Oracle, Hibernate can use the <literal>rowid</literal> extra column for fast updates if you set this option to <literal>rowid</literal>. A ROWID is an implementation detail and represents the physical location of a stored tuple.
es_es: <literal>rowid</literal> (opcional): Hibernate puede usar los llamados ROWIDs en las bases de datos que los soporten. Por ejemplo, en Oracle, Hibernate puede usar la columna extra <literal>rowid</literal> para actualizaciones rápidas si estableces esta opción a <literal>rowid</literal>. Un ROWID es un detalle de implementación y representa la posición física de la tupla almacenada.

source: <literal>subselect</literal> (optional): Maps an immutable and read-only entity to a database subselect. Useful if you want to have a view instead of a base table, but don't. See below for more information.
es_es: <literal>subselect</literal> (opcional): Mapea una entidad inmutable y de sólo lectura a una subselect de base de datos. Es útil si quieres tener una vista en vez de una tabla base, pero no tienes vistas. Mira debajo para más información.

source: <literal>abstract</literal> (optional): Used to mark abstract superclasses in <literal>&lt;union-subclass&gt;</literal> hierarchies.
es_es: <literal>abstract</literal> (opcional): Usado para marcar superclases abstractas en jerarquías <literal>&lt;union-subclass&gt;</literal>.

source: It is perfectly acceptable for the named persistent class to be an interface. You would then declare implementing classes of that interface using the <literal>&lt;subclass&gt;</literal> element. You may persist any <emphasis>static</emphasis> inner class. You should specify the class name using the standard form ie. <literal>eg.Foo$Bar</literal>.
es_es: Es perfectamente aceptable que la clase persistente mencionada sea una interface. Entonces declararías clases que implementan esa interface usando el elemento <literal>&lt;subclass&gt;</literal>. Puedes persistir cualquier clase interna <emphasis>estática</emphasis>. Debes especificar el nombre de la clase usando la forma estándar. Por ejemplo, <literal>eg.Foo$Bar</literal>.

source: Immutable classes, <literal>mutable="false"</literal>, may not be updated or deleted by the application. This allows Hibernate to make some minor performance optimizations.
es_es: Las clases inmutables, <literal>mutable="false"</literal>, no pueden ser actualizadas o borradas por la aplicación. Esto permite a Hibernate hacer ciertas optimizaciones menores de rendimiento.

source: The optional <literal>proxy</literal> attribute enables lazy initialization of persistent instances of the class. Hibernate will initially return CGLIB proxies which implement the named interface. The actual persistent object will be loaded when a method of the proxy is invoked. See "Initializing collections and proxies" below.
es_es: El atributo opcional <literal>proxy</literal> habilita la inicialización postergada de instancias persistentes de la clase. Hibernate inicialmente retornará proxies CGLIB que implementan la interface mencionada. El objeto persistente real será cargado cuando se invoque un método del proxy. Mira "Proxies para Inicialización Postergada" debajo.

source: <emphasis>Implicit</emphasis> polymorphism means that instances of the class will be returned by a query that names any superclass or implemented interface or the class and that instances of any subclass of the class will be returned by a query that names the class itself. <emphasis>Explicit</emphasis> polymorphism means that class instances will be returned only by queries that explicitly name that class and that queries that name the class will return only instances of subclasses mapped inside this <literal>&lt;class&gt;</literal> declaration as a <literal>&lt;subclass&gt;</literal> or <literal>&lt;joined-subclass&gt;</literal>. For most purposes the default, <literal>polymorphism="implicit"</literal>, is appropriate. Explicit polymorphism is useful when two different classes are mapped to the same table (this allows a "lightweight" class that contains a subset of the table columns).
es_es: Por polimorfismo <emphasis>implícito</emphasis> se entiende que las instancias de la clase serán devueltas por una consulta que mencione cualquier superclase, o interface implementada, o la clase misma; y que las instancias de cualquier subclase de la clase serán devueltas por una clase que mencione a la clase en sí. Por polimorfismo <emphasis>explícito</emphasis> se entiende que instancias de la clase serán devueltas sólo por consultas que mencionen explícitamente la clase; y que las consultas que mencionen la clase devolverán sólo instancias de subclases mapeadas dentro de esta declaración <literal>&lt;class&gt;</literal> como una <literal>&lt;subclass&gt;</literal> o <literal>&lt;joined-subclass&gt;</literal>. Para la mayoría de los propósitos el defecto, <literal>polymorphism="implicit"</literal>, resulta apropiado. El polimorfismo explícito es útil cuando dos clases diferentes están mapeadas a la misma tabla (esto permite tener una clase "liviana" que contenga un subconjunto de columnas de la tabla).

source: The <literal>persister</literal> attribute lets you customize the persistence strategy used for the class. You may, for example, specify your own subclass of <literal>org.hibernate.persister.EntityPersister</literal> or you might even provide a completely new implementation of the interface <literal>org.hibernate.persister.ClassPersister</literal> that implements persistence via, for example, stored procedure calls, serialization to flat files or LDAP. See <literal>org.hibernate.test.CustomPersister</literal> for a simple example (of "persistence" to a <literal>Hashtable</literal>).
es_es: El atributo <literal>persister</literal> te permite personalizar la estrategia de persistencia para la clase. Puedes, por ejemplo, especificar tu propia subclase de <literal>org.hibernate.persister.EntityPersister</literal> o incluso puedes proveer una implementación completamente nueva de la interface <literal>org.hibernate.persister.ClassPersister</literal> que implemente la persistencia por medio, por ejemplo, de llamadas a procedimientos almacenados, serialización a ficheros planos o LDAP. Para un ejemplo simple (de persistencia a una <literal>Hashtable</literal>) mira <literal>org.hibernate.test.CustomPersister</literal>.

source: Note that the <literal>dynamic-update</literal> and <literal>dynamic-insert</literal> settings are not inherited by subclasses and so may also be specified on the <literal>&lt;subclass&gt;</literal> or <literal>&lt;joined-subclass&gt;</literal> elements. These settings may increase performance in some cases, but might actually decrease performance in others. Use judiciously.
es_es: Observa que los valores de <literal>dynamic-update</literal> y <literal>dynamic-insert</literal> no son heredados por las subclases y por lo tanto deben especificarse en los elementos <literal>&lt;subclass&gt;</literal> o <literal>&lt;joined-subclass&gt;</literal>. Estos ajustes pueden incrementar el rendimiento en algunos casos, pero podrían mermarlo en otros. Ten juicio en su uso.

source: Use of <literal>select-before-update</literal> will usually decrease performance. It is very useful to prevent a database update trigger being called unnecessarily if you reattach a graph of detached instances to a <literal>Session</literal>.
es_es: Generalmente el uso de <literal>select-before-update</literal> disminuirá el rendimiento. Es muy útil prevenir que se llame innecesariamente a un disparador de actualización de base de datos al volver a unir un grafo de instancias separadas a una <literal>Session</literal>.

source: If you enable <literal>dynamic-update</literal>, you will have a choice of optimistic locking strategies:
es_es: Si habilitas <literal>dynamic-update</literal>, tendrás opción de estrategias de bloqueo optimistas:

source: <literal>version</literal> check the version/timestamp columns
es_es: <literal>version</literal> chequea las columnas de versión/timestamp

source: <literal>all</literal> check all columns
es_es: <literal>all</literal> chequea todas las columnas

source: <literal>dirty</literal> check the changed columns, allowing some concurrent updates
es_es: <literal>dirty</literal> chequea las columnas modificadas, permitiendo algunas actualizaciones concurrentes

source: <literal>none</literal> do not use optimistic locking
es_es: <literal>none</literal> no usa bloqueo optimista
