Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/basic_mapping.po
Languages: es_es

source: This feature is often only useful for legacy data models, we recommend fewer tables than classes and a fine-grained domain model. However, it is useful for switching between inheritance mapping strategies in a single hierarchy, as explained later.
es_es: Esta funcionalidad es a menudo solamente útil para modelos de datos heredados; recomendamos menos tablas que clases un modelo de dominio más granularizado. Sin embargo, es útil para cambiar entre estrategias de mapeo de herencias en una misma jerarquía, como se explica luego.

source: We've seen the <literal>&lt;key&gt;</literal> element crop up a few times now. It appears anywhere the parent mapping element defines a join to a new table, and defines the foreign key in the joined table, that references the primary key of the original table.
es_es: Hasta ahora hemos visto el elemento <literal>&lt;key&gt;</literal> pocas veces. Aparece en cualquier sitio en que el elemento padre de mapeo defina una unión a una nueva tabla, y define la clave foránea en la tabla unida, que referencia la clave primaria de la tabla original.

source: <literal>on-delete</literal> (optional, defaults to <literal>noaction</literal>): Specifies whether the foreign key constraint has database-level cascade delete enabled.
es_es: <literal>on-delete</literal> (opcional, por defecto a <literal>noaction</literal>): Especifica si la restricción de clave foránea tiene el borrado en cascada habilitado a nivel de base de datos.

source: <literal>property-ref</literal> (optional): Specifies that the foreign key refers to columns that are not the primary key of the orginal table. (Provided for legacy data.)
es_es: <literal>property-ref</literal> (opcional): Especifica que la clave foránea referencia columnas que no son del la clave primaria de la tabla original. (Provisto para datos heredados.)

source: <literal>not-null</literal> (optional): Specifies that the foreign key columns are not nullable (this is implied whenever the foreign key is also part of the primary key).
es_es: <literal>not-null</literal> (opcional): Especifica que las columnas de la clave foránea son no nulables (esto está implicado si la clave foránea es también parte de la clave primaria).

source: <literal>update</literal> (optional): Specifies that the foreign key should never be updated (this is implied whenever the foreign key is also part of the primary key).
es_es: <literal>update</literal> (opcional): Especifica que la clave foránea nunca debe ser actualizada (esto está implicado si la clave foránea es también parte de la clave primaria).

source: <literal>unique</literal> (optional): Specifies that the foreign key should have a unique constraint (this is implied whenever the foreign key is also the primary key).
es_es: <literal>unique</literal> (opcional): Especifica que la clave foránea debe tener una restricción de unicidad (esto está implicado si la clave foránea es también la clave primaria).

source: We recommend that for systems where delete performance is important, all keys should be defined <literal>on-delete="cascade"</literal>, and Hibernate will use a database-level <literal>ON CASCADE DELETE</literal> constraint, instead of many individual <literal>DELETE</literal> statements. Be aware that this feature bypasses Hibernate's usual optimistic locking strategy for versioned data.
es_es: Recomendamos que, para los sistemas en donde el rendimiento sea importante, todas las claves deben ser definidas <literal>on-delete="cascade"</literal>, e Hibernate usará una restricción <literal>ON CASCADE DELETE</literal> a nivel de base de datos, en vez de muchas sentencias <literal>DELETE</literal> individuales. Ten en cuenta que esta funcionalidad se salta la habitual estrategia de bloqueo optimista de Hibernate para datos versionados.

source: The <literal>not-null</literal> and <literal>update</literal> attributes are useful when mapping a unidirectional one to many association. If you map a unidirectional one to many to a non-nullable foreign key, you <emphasis>must</emphasis> declare the key column using <literal>&lt;key not-null="true"&gt;</literal>.
es_es: Los atributos <literal>not-null</literal> y <literal>update</literal> son útiles al mapear una asociación uno a muchos unidireccional. Si mapeas una uno a muchos unidireccional a una clave foránea no nulable, <emphasis>debes</emphasis> declarar la columna clave usando <literal>&lt;key not-null="true"&gt;</literal>.

source: column and formula elements
es_es: los elementos column y formula

source: Any mapping element which accepts a <literal>column</literal> attribute will alternatively accept a <literal>&lt;column&gt;</literal> subelement. Likewise, <literal>&lt;formula&gt;</literal> is an alternative to the <literal>formula</literal> attribute.
es_es: Cualquier elemento de mapeo que acepte un atributo <literal>column</literal> aceptará alternativamente un subelemento <literal>&lt;column&gt;</literal>. De forma similar, <literal>&lt;formula&gt;</literal> es una alternativa al atributo <literal>formula</literal>.

source: <literal>column</literal> and <literal>formula</literal> attributes may even be combined within the same property or association mapping to express, for example, exotic join conditions.
es_es: Los atributos <literal>column</literal> y <literal>formula</literal> pueden incluso ser combinados dentro del mismo mapeo de propiedad o asociación para expresar, por ejemplo, condiciones de unión exóticas.

source: Suppose your application has two persistent classes with the same name, and you don't want to specify the fully qualified (package) name in Hibernate queries. Classes may be "imported" explicitly, rather than relying upon <literal>auto-import="true"</literal>. You may even import classes and interfaces that are not explicitly mapped.
es_es: Supón que tu aplicación tiene dos clases persistentes con el mismo nombre, y no quieres especificar el nombre completamenta cualificado (paquete) en las consultas Hibernate. Las clases pueden ser "importadas" explícitamente, en vez de confiar en <literal>auto-import="true"</literal>. Puedes incluso importar clases e interfaces que no estén mapeadas explícitamente.

source: <literal>class</literal>: The fully qualified class name of of any Java class.
es_es: <literal>class</literal>: El nombre de clase completamente cualificado de cualquier clase Java.

source: <literal>rename</literal> (optional - defaults to the unqualified class name): A name that may be used in the query language.
es_es: <literal>rename</literal> (opcional - por defecto al nombre de clase sin cualificar): Un nombre que será usado en el leguaje de consulta.

source: There is one further type of property mapping. The <literal>&lt;any&gt;</literal> mapping element defines a polymorphic association to classes from multiple tables. This type of mapping always requires more than one column. The first column holds the type of the associated entity. The remaining columns hold the identifier. It is impossible to specify a foreign key constraint for this kind of association, so this is most certainly not meant as the usual way of mapping (polymorphic) associations. You should use this only in very special cases (eg. audit logs, user session data, etc).
es_es: Hay un tipo más de mapeo de propiedad. El elemento de mapeo <literal>&lt;any&gt;</literal> define una asociacián polimórfica a clases desde múltiples tablas. Este tipo de mapeo siempre requiere más de una columna. La primera columna contiene el tipo de la entidad asociada. Las columnas restantes contienen el identificador. Es imposible especificar una restricción de clave foránea para este tipo de asociación, por lo que esto ciertamente no está concebido como la forma habitual de mapear asociaciones (polimórficas). Sólo debes usar esto en casos muy especiales (por ejemplo, trazas de auditoréa, datos de sesión de usuario, etc).

source: The <literal>meta-type</literal> attribute lets the application specify a custom type that maps database column values to persistent classes which have identifier properties of the type specified by <literal>id-type</literal>. You must specify the mapping from values of the meta-type to class names.
es_es: El atributo <literal>meta-type</literal> permite a la aplicación especificar un tipo personalizado que mapee columnas de base de datos a clases persistentes que tengan propiedades identificadoras del tipo especificado por <literal>id-type</literal>. Debes especificar el mapeo de valores del meta-type a nombres de clase.

source: <literal>name</literal>: the property name.
es_es: <literal>name</literal>: el nombre de la propiedad.

source: <literal>id-type</literal>: the identifier type.
es_es: <literal>id-type</literal>: el tipo del identificador.

source: <literal>meta-type</literal> (optional - defaults to <literal>string</literal>): Any type that is allowed for a discriminator mapping.
es_es: <literal>meta-type</literal> (opcional - por defecto a <literal>string</literal>): Cualquier tipo que sea permitido para un mapeo de discriminador.

source: <literal>cascade</literal> (optional- defaults to <literal>none</literal>): the cascade style.
es_es: <literal>cascade</literal> (opcional- por defecto a <literal>none</literal>): el estilo de cascada.

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Specifies that updates to this property do or do not require acquisition of the optimistic lock. In other words, define if a version increment should occur if this property is dirty.
es_es: <literal>optimistic-lock</literal> (opcional - por defecto a <literal>true</literal>): Especifica si las actualizaciones de esta propiedad requieren o no de la adquisición del bloqueo optimista. En otras palabras, determina si debe ocurrir un incremento de versión cuando esta propiedad está desactualizada.

source: Hibernate Types
es_es: Tipos de Hibernate

source: Entities and values
es_es: Entidades y Valores

source: To understand the behaviour of various Java language-level objects with respect to the persistence service, we need to classify them into two groups:
es_es: Para entender el comportamiento de varios objetos a nivel de lenguaje Java con respecto al servicio de persistencia, necesitamos clasificarlos en dos grupos:

source: An <emphasis>entity</emphasis> exists independently of any other objects holding references to the entity. Contrast this with the usual Java model where an unreferenced object is garbage collected. Entities must be explicitly saved and deleted (except that saves and deletions may be <emphasis>cascaded</emphasis> from a parent entity to its children). This is different from the ODMG model of object persistence by reachablity - and corresponds more closely to how application objects are usually used in large systems. Entities support circular and shared references. They may also be versioned.
es_es: Una <emphasis>entidad</emphasis> existe independientemente de cualquier otros objetos que referencien a la entidad. Contrasta esto con el model habitual de Java donde un objeto desreferenciado es recolectado como basura. Las entidades deben ser salvadas y borradas explícitamente (excepto que las grabaciones y borrados puedan ser <emphasis>tratados en cascada</emphasis> desde una entidad padre a sus hijos). Esto es diferente al modelo de persistencia de objetos por alcance - y se corresponde más de cerca a cómo los objetos de aplicación son usados habitualmente en grandes sistemas. Las entidades soportan referencias circulares y compartidas, que tambié pueden ser versionadas.

source: An entity's persistent state consists of references to other entities and instances of <emphasis>value</emphasis> types. Values are primitives, collections (not what's inside a collection), components and certain immutable objects. Unlike entities, values (in particular collections and components) <emphasis>are</emphasis> persisted and deleted by reachability. Since value objects (and primitives) are persisted and deleted along with their containing entity they may not be independently versioned. Values have no independent identity, so they cannot be shared by two entities or collections.
es_es: El estado persistente de una entidad consiste en referencias a otras entidades e instancias de tipo <emphasis>valor</emphasis>. Los valores son primitivos, colecciones (no lo que está dentro de la colección), componentes y ciertos objetos inmutables. A diferencia de las entidades, los valores (en particular las colecciones y los componentes) <emphasis>son</emphasis> hechos persitentes y borrados por alcance. Como los objetos valor (y primitivos) son persistidos y borrados junto a sus entidades contenedoras, no pueden ser versionados independientemente. Los valores no tienen identidad independiente, por los que no pueden ser compartidos por dos entidades o colleciones.

source: Up until now, we've been using the term "persistent class" to refer to entities. We will continue to do that. Strictly speaking, however, not all user-defined classes with persistent state are entities. A <emphasis>component</emphasis> is a user defined class with value semantics. A Java property of type <literal>java.lang.String</literal> also has value semantics. Given this definition, we can say that all types (classes) provided by the JDK have value type semantics in Java, while user-defined types may be mapped with entity or value type semantics. This decision is up to the application developer. A good hint for an entity class in a domain model are shared references to a single instance of that class, while composition or aggregation usually translates to a value type.
es_es: Hasta ahora, hemos estado usando el término "clase persistente" para referirnos a entidades. Continuaremos haciéndolo. Hablando estrictamente, sin embargo, no todas la clases con estado persistente definidas por el usuario son entidades. Un <emphasis>componente</emphasis> es una clase definida por el usuario con semántica de valor. Una propiedad Java de tipo <literal>java.lang.String</literal> también tiene semántica de valor. Dada esta definición, podemos decir que todos los tipo (clases) provistos por el JDK tienen una semántica de tipo valor en Java, mientras que los tipos definidos por el usuario pueden ser mapeados con semántica de tipo valor o de entidad. La desición corre por cuenta del desarrollador de la aplicación. Un buen consejo para una clase entidad en un modelo de dominio son las referencias compartidas a una sola instancia de esa clase, mientras que la composición o agregación usualmente se traducen a un tipo de valor.

source: We'll revisit both concepts throughout the documentation.
es_es: Volveremos a visitar ambos conceptos a lo largo de la documentación.

source: The challenge is to map the Java type system (and the developers' definition of entities and value types) to the SQL/database type system. The bridge between both systems is provided by Hibernate: for entities we use <literal>&lt;class&gt;</literal>, <literal>&lt;subclass&gt;</literal> and so on. For value types we use <literal>&lt;property&gt;</literal>, <literal>&lt;component&gt;</literal>, etc, usually with a <literal>type</literal> attribute. The value of this attribute is the name of a Hibernate <emphasis>mapping type</emphasis>. Hibernate provides many mappings (for standard JDK value types) out of the box. You can write your own mapping types and implement your custom conversion strategies as well, as you'll see later.
es_es: EL desafío es mapear el sistema de tipos de Java (y la definición de entidades y tipos de valor de los desarrolladores) al sistema de tipos de SQL/base de datos. EL puente entre ambos sistemas es provisto por Hibernate: para las entidades usamos <literal>&lt;class&gt;</literal>, <literal>&lt;subclass&gt;</literal>, etc. Para los tipos de valor usamos <literal>&lt;property&gt;</literal>, <literal>&lt;component&gt;</literal>, etc, usualmente con un atributo <literal>type</literal>. El valor de este atributo es el nombre de un <emphasis>tipo de mapeo</emphasis> de Hibernate. Hibernate provee de fábrica muchos mapeos (para tipos de valores del JDK estándar). Puedes escribir tus propios mapeos de tipo, así como implementar tus estrategias de conversión personalizadas, como veremos luego.

source: All built-in Hibernate types except collections support null semantics.
es_es: Todos los tipos prefabricados de Hibernate soportan semántica de nulos excepto las colecciones.

source: Basic value types
es_es: Tipos de valores básicos

source: Type mappings from Java primitives or wrapper classes to appropriate (vendor-specific) SQL column types. <literal>boolean, yes_no</literal> and <literal>true_false</literal> are all alternative encodings for a Java <literal>boolean</literal> or <literal>java.lang.Boolean</literal>.
es_es: Mapeos de tipos primitivos de Java o clases de envoltura a la tipos de columna SQL (especícifica del vendedor). <literal>boolean, yes_no</literal> y <literal>true_false</literal> son codificaciones alternativas a <literal>boolean</literal> de Java o <literal>java.lang.Boolean</literal>.

source: A type mapping from <literal>java.lang.String</literal> to <literal>VARCHAR</literal> (or Oracle <literal>VARCHAR2</literal>).
es_es: Un mapeo del tipo <literal>java.lang.String</literal> a <literal>VARCHAR</literal> (u Oracle <literal>VAARCHAR2</literal>).

source: Type mappings from <literal>java.util.Date</literal> and its subclasses to SQL types <literal>DATE</literal>, <literal>TIME</literal> and <literal>TIMESTAMP</literal> (or equivalent).
es_es: Mapeos de tipo desde <literal>java.util.Date</literal> y sus subclases a tipos SQL <literal>DATE</literal>, <literal>TIME</literal> y <literal>TIMESTAMP</literal> (o equivalente).

source: Type mappings from <literal>java.util.Calendar</literal> to SQL types <literal>TIMESTAMP</literal> and <literal>DATE</literal> (or equivalent).
es_es: Mapeos de tipo desde <literal>java.util.Date</literal> y sus subclases a tipos SQL <literal>TIMESTAMP</literal> y <literal>DATE</literal> (o equivalente).

source: Type mappings from <literal>java.math.BigDecimal</literal> and <literal>java.math.BigInteger</literal> to <literal>NUMERIC</literal> (or Oracle <literal>NUMBER</literal>).
es_es: Mapeos de tipo desde <literal>java.math.BigDecimal</literal> y <literal>java.math.BigInteger</literal> a <literal>NUMERIC</literal> (o <literal>NUMBER</literal> de Oracle).

source: Type mappings from <literal>java.util.Locale</literal>, <literal>java.util.TimeZone</literal> and <literal>java.util.Currency</literal> to <literal>VARCHAR</literal> (or Oracle <literal>VARCHAR2</literal>). Instances of <literal>Locale</literal> and <literal>Currency</literal> are mapped to their ISO codes. Instances of <literal>TimeZone</literal> are mapped to their <literal>ID</literal>.
es_es: Mapeos de tipo desde <literal>java.util.Locale</literal>, <literal>java.util.TimeZone</literal> y <literal>java.util.Currency</literal> a <literal>VARCHAR</literal> (o <literal>VARCHAR2</literal> de Oracle). Las instancias de <literal>Locale</literal> y <literal>Currency</literal> son mapeadas a sus códigos ISO. Las instancias de <literal>TimeZone</literal> son mapeadas a sus <literal>ID</literal>.

source: A type mapping from <literal>java.lang.Class</literal> to <literal>VARCHAR</literal> (or Oracle <literal>VARCHAR2</literal>). A <literal>Class</literal> is mapped to its fully qualified name.
es_es: Un mapeo de tipo <literal>java.lang.Class</literal> a <literal>VARCHAR</literal> (o <literal>VARCHAR2</literal> de Oracle). Una <literal>Class</literal> es mapeara a su nombre completamente cualificado.

source: Maps byte arrays to an appropriate SQL binary type.
es_es: Mapea arreglos de bytes a un tipo binario SQL apropiado.

source: Maps long Java strings to a SQL <literal>CLOB</literal> or <literal>TEXT</literal> type.
es_es: Mapea cadenas largas Java al tipo SQL <literal>CLOB</literal> o <literal>TEXT</literal>.

source: Maps serializable Java types to an appropriate SQL binary type. You may also indicate the Hibernate type <literal>serializable</literal> with the name of a serializable Java class or interface that does not default to a basic type.
es_es: Mapea tipos serializables Java a un tipo binario SQL apropiado. Puedes además indicar el tipo <literal>serializable</literal> de Hibernate con el nombre de una clase o interface serializable Java que no sea por defecto un tipo básico.

source: Type mappings for the JDBC classes <literal>java.sql.Clob</literal> and <literal>java.sql.Blob</literal>. These types may be inconvenient for some applications, since the blob or clob object may not be reused outside of a transaction. (Furthermore, driver support is patchy and inconsistent.)
es_es: Mapeos de tipo para las clases JDBC <literal>java.sql.Clob</literal> y <literal>java.sql.Blob</literal>. Estos tipos pueden ser inconvenientes para algunas aplicaciones, pues el objeto blob o clob no puede ser reusado fuera de una transacción (Además, el soporte del driver suele ser malo e inconsistente).

source: imm_date, imm_time, imm_timestamp, imm_calendar, imm_calendar_date, imm_serializable, imm_binary
es_es: UNTRANSLATED! imm_date, imm_time, imm_timestamp, imm_calendar, imm_calendar_date, imm_serializable, imm_binary

source: Unique identifiers of entities and collections may be of any basic type except <literal>binary</literal>, <literal>blob</literal> and <literal>clob</literal>. (Composite identifiers are also allowed, see below.)
es_es: Los identificadores únicos de entidades y collecciones pueden ser de cualquier tipo básico excepto <literal>binary</literal>, <literal>blob</literal> y <literal>clob</literal>. (Los identificadores compuestos están también permitidos, ver debajo.)

source: The basic value types have corresponding <literal>Type</literal> constants defined on <literal>org.hibernate.Hibernate</literal>. For example, <literal>Hibernate.STRING</literal> represents the <literal>string</literal> type.
es_es: Los tipos de valor básicos tienen sus constantes <literal>Type</literal> correspondientes definidas en <literal>org.hibernate.Hibernate</literal>. Por ejemplo, <literal>Hibernate.STRING</literal> representa el tipo <literal>string</literal>.

source: Custom value types
es_es: Tipos de valor personalizados

source: It is relatively easy for developers to create their own value types. For example, you might want to persist properties of type <literal>java.lang.BigInteger</literal> to <literal>VARCHAR</literal> columns. Hibernate does not provide a built-in type for this. But custom types are not limited to mapping a property (or collection element) to a single table column. So, for example, you might have a Java property <literal>getName()</literal>/<literal>setName()</literal> of type <literal>java.lang.String</literal> that is persisted to the columns <literal>FIRST_NAME</literal>, <literal>INITIAL</literal>, <literal>SURNAME</literal>.
es_es: Es relativamente fácil para los desarrolladores crear sus propios tipos de valor. Por ejemplo, podrías querer persistir propiedades del tipo <literal>java.lang.BigInteger</literal> a columnas <literal>VARCHAR</literal>. Hibernate no provee un tipo de fábrica para esto. Pero los tipos personalizados no están limitados a mapear una propiedad (o elemento de colección) a una sola columna de tabla. Así, por ejemplo, podrías tener una propiedad Java <literal>getName()</literal>/<literal>setName()</literal> de tipo <literal>java.lang.String</literal> que fuera persistida a las columnas <literal>FIRST_NAME</literal>, <literal>INITIAL</literal>, <literal>SURNAME</literal>.
