Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/collection_mapping.po
Languages: es_es

source: Collection Mapping
es_es: Mapeo de Colecciones

source: Persistent collections
es_es: Colecciones persistentes

source: Hibernate requires that persistent collection-valued fields be declared as an interface type, for example:
es_es: Hibernate requiere que los campos valuados en colección persistentes sean declarados como un tipo de interface, por ejemplo:

source: The actual interface might be <literal>java.util.Set</literal>, <literal>java.util.Collection</literal>, <literal>java.util.List</literal>, <literal>java.util.Map</literal>, <literal>java.util.SortedSet</literal>, <literal>java.util.SortedMap</literal> or ... anything you like! (Where "anything you like" means you will have to write an implementation of <literal>org.hibernate.usertype.UserCollectionType</literal>.)
es_es: La interface real podría ser <literal>java.util.Set</literal>, <literal>java.util.Collection</literal>, <literal>java.util.List</literal>, <literal>java.util.Map</literal>, <literal>java.util.SortedSet</literal>, <literal>java.util.SortedMap</literal> o ... lo que te guste! (Donde "lo que te guste" significa que tendrás que escribir una implementación de <literal>org.hibernate.usertype.UserCollectionType</literal>.)

source: Notice how we initialized the instance variable with an instance of <literal>HashSet</literal>. This is the best way to initialize collection valued properties of newly instantiated (non-persistent) instances. When you make the instance persistent - by calling <literal>persist()</literal>, for example - Hibernate will actually replace the <literal>HashSet</literal> with an instance of Hibernate's own implementation of <literal>Set</literal>. Watch out for errors like this:
es_es: Nota cómo hemos inicializado la variable de instancia de <literal>HashSet</literal>. Esta es la mejor forma de inicializar propiedades valuadas en colección de instancias recién instanciadas (no persistentes). Cuando haces persistente la instancia - llamando a <literal>persist()</literal>, por ejemplo - Hibernate realmente remplazará el <literal>HashSet</literal> con una instancia de una implementación de <literal>Set</literal> propia de Hibernate. Observa errores como este:

source: The persistent collections injected by Hibernate behave like <literal>HashMap</literal>, <literal>HashSet</literal>, <literal>TreeMap</literal>, <literal>TreeSet</literal> or <literal>ArrayList</literal>, depending upon the interface type.
es_es: Las colecciones persistentes inyectadas por Hibernate se comportan como <literal>HashMap</literal>, <literal>HashSet</literal>, <literal>TreeMap</literal>, <literal>TreeSet</literal> o <literal>ArrayList</literal>, dependiendo del tipo de interface.

source: Collections instances have the usual behavior of value types. They are automatically persisted when referenced by a persistent object and automatically deleted when unreferenced. If a collection is passed from one persistent object to another, its elements might be moved from one table to another. Two entities may not share a reference to the same collection instance. Due to the underlying relational model, collection-valued properties do not support null value semantics; Hibernate does not distinguish between a null collection reference and an empty collection.
es_es: Las instancias de colecciones tienen el comportamiento usual de tipos de valor. Son automáticamente persistidas al ser referenciadas por un objeto persistente y automáticamente borradas al desreferenciarse. Si una colección es pasada de un objeto persistente a otro, sus elementos serían movidos de una tabla a otra. Dos entidades pueden no compartir una referencia a la misma instancia de colección. Debido al modelo relacional subyacente, las propiedades valuadas en colección no soportan la semántica de valor nulo. Hibernate no distingue entre una referencia de colección nula y una colección vacía.

source: You shouldn't have to worry much about any of this. Use persistent collections the same way you use ordinary Java collections. Just make sure you understand the semantics of bidirectional associations (discussed later).
es_es: No debes tener que preocuparte demasiado por esto. Usa las colecciones persistentes de la misma forma en que usas colecciones de Java ordinarias. Sólo asegúrate que entiendes la semántica de las asociaciones bidireccionales (discutida luego).

source: Collection mappings
es_es: Mapeos de colección

source: The Hibernate mapping element used for mapping a collection depends upon the type of the interface. For example, a <literal>&lt;set&gt;</literal> element is used for mapping properties of type <literal>Set</literal>.
es_es: El elemento de mapeo de Hibernate usado para mapear una colección depende del tipo de la interface. Por ejemplom un elemento <literal>&lt;set&gt;</literal> se usa para mapear propiedades de tipo <literal>Set</literal>.

source: Apart from <literal>&lt;set&gt;</literal>, there is also <literal>&lt;list&gt;</literal>, <literal>&lt;map&gt;</literal>, <literal>&lt;bag&gt;</literal>, <literal>&lt;array&gt;</literal> and <literal>&lt;primitive-array&gt;</literal> mapping elements. The <literal>&lt;map&gt;</literal> element is representative:
es_es: Aparte de <literal>&lt;set&gt;</literal>, existen además los elementos de mapeo <literal>&lt;list&gt;</literal>, <literal>&lt;map&gt;</literal>, <literal>&lt;bag&gt;</literal>, <literal>&lt;array&gt;</literal> y <literal>&lt;primitive-array&gt;</literal>. El elemento <literal>&lt;map&gt;</literal> es representativo:

source: <literal>name</literal> the collection property name
es_es: <literal>name</literal> el nombre de la propiedad de colección

source: <literal>table</literal> (optional - defaults to property name) the name of the collection table (not used for one-to-many associations)
es_es: <literal>table</literal> (opcional - por defecto al nombre de la propiedad) el nombre de la tabla de coleciión (no usado para asociaciones uno-a-muchos)

source: <literal>schema</literal> (optional) the name of a table schema to override the schema declared on the root element
es_es: <literal>schema</literal> (opcional) el nombre de un esquema de tablas para sobrescribir el esquema declarado en el elemento raíz

source: <literal>lazy</literal> (optional - defaults to <literal>true</literal>) may be used to disable lazy fetching and specify that the association is always eagerly fetched, or to enable "extra-lazy" fetching where most operations do not initialize the collection (suitable for very large collections)
es_es: <literal>lazy</literal> (opcional - por defecto a <literal>true</literal>) puede ser usado para deshabilitar la recuperación perezosa y especificar que la asociación es siempre recuperada tempranamente (no disponible para arrays)

source: <literal>inverse</literal> (optional - defaults to <literal>false</literal>) mark this collection as the "inverse" end of a bidirectional association
es_es: <literal>inverse</literal> (opcional - por defecto a <literal>false</literal>) marca esta colección como el extremo "inverso" de una asociación bidireccional.

source: <literal>cascade</literal> (optional - defaults to <literal>none</literal>) enable operations to cascade to child entities
es_es: <literal>cascade</literal> (opcional - por defecto a <literal>none</literal>) habilita operaciones en cascada a entidades hijas

source: <literal>sort</literal> (optional) specify a sorted collection with <literal>natural</literal> sort order, or a given comparator class
es_es: <literal>sort</literal> (opcional) especifica una colección con ordenamiento <literal>natural</literal>, o una clase comparadora dada

source: <literal>order-by</literal> (optional, JDK1.4 only) specify a table column (or columns) that define the iteration order of the <literal>Map</literal>, <literal>Set</literal> or bag, together with an optional <literal>asc</literal> or <literal>desc</literal>
es_es: <literal>order-by</literal> (opcional, sólo JDK1.4) especifica una columna de tabla (o columnas) que definen el orden de iteración del <literal>Map</literal>, <literal>Set</literal> o bag, junto a un <literal>asc</literal> o <literal>desc</literal> opcional.

source: <literal>where</literal> (optional) specify an arbitrary SQL <literal>WHERE</literal> condition to be used when retrieving or removing the collection (useful if the collection should contain only a subset of the available data)
es_es: <literal>where</literal> (opcional) especifica una condición <literal>WHERE</literal> de SQL arbitrario para ser usada al recuperar o quitar la colección (útil si la colección debe contener sólo un subconjunto de los datos disponibles)

source: <literal>fetch</literal> (optional, defaults to <literal>select</literal>) Choose between outer-join fetching, fetching by sequential select, and fetching by sequential subselect.
es_es: <literal>fetch</literal> (opcional, por defecto a <literal>select</literal>) Elige entre recuperación por unión externa (outer-join), recuperar por selección secuencial, y recuperación por subselección secuencial.

source: <literal>batch-size</literal> (optional, defaults to <literal>1</literal>) specify a "batch size" for lazily fetching instances of this collection.
es_es: <literal>batch-size</literal> (opcional, por defecto a <literal>1</literal>) especifica un "tamaño de lote" para la recuperar perezosamente instancias de esta colección.

source: <literal>access</literal> (optional - defaults to <literal>property</literal>): The strategy Hibernate should use for accessing the collection property value.
es_es: <literal>access</literal> (opcional - por defecto a <literal>property</literal>): La estrategia que debe usar Hibernate para acceder al valor de la propiedad.

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Species that changes to the state of the collection results in increment of the owning entity's version. (For one to many associations, it is often reasonable to disable this setting.)
es_es: <literal>optimistic-lock</literal> (opcional - por defecto a <literal>true</literal>): Especifica que los cambios de estado de la colección resultan en incrementos de versión de la entidad dueña. (Para asociaciones uno a muchos, frecuentemente es razonable deshabilitar esta opción.)

source: Collection foreign keys
es_es: Claves foráneas de collección

source: Collection instances are distinguished in the database by the foreign key of the entity that owns the collection. This foreign key is referred to as the <emphasis>collection key column</emphasis> (or columns) of the collection table. The collection key column is mapped by the <literal>&lt;key&gt;</literal> element.
es_es: Las instancias de colección se distinguen en la base de datos por la clave foránea de la entidad que posee la colección. Se hace referencia a esta clave foránea como la <emphasis>columna clave de colección</emphasis> (o columnas) de la tabla de colección. La columna clave de la colección es mapeada por el elemento <literal>&lt;key&gt;</literal>.

source: There may be a nullability constraint on the foreign key column. For most collections, this is implied. For unidirectional one to many associations, the foreign key column is nullable by default, so you might need to specify <literal>not-null="true"</literal>.
es_es: Puede haber una restricción de nulabilidad sobre la columna de clave foránea. Para la mayoría de colecciones, esto está implicado. Para asociaciones unidireccionales uno a muchos, la columna de clave foránea es nulable por defecto, de modo que podrías necesitar especificar <literal>not-null="true"</literal>.

source: The foreign key constraint may use <literal>ON DELETE CASCADE</literal>.
es_es: La restricción de clave foránea puede usar <literal>ON DELETE CASCADE</literal>.

source: See the previous chapter for a full definition of the <literal>&lt;key&gt;</literal> element.
es_es: Mira el capítulo anterior por una definición completa del elemento <literal>&lt;key&gt;</literal>.

source: Collection elements
es_es: Elementos de collección

source: Collections may contain almost any other Hibernate type, including all basic types, custom types, components, and of course, references to other entities. This is an important distinction: an object in a collection might be handled with "value" semantics (its life cycle fully depends on the collection owner) or it might be a reference to another entity, with its own life cycle. In the latter case, only the "link" between the two objects is considered to be state held by the collection.
es_es: Las colecciones pueden contener casi cualquier tipo de Hibernate, incluyendo todos los tipos básicos, componentes, y por supuesto, referencias a otras entidades. Esta es una distinción importante: un objeto en una colección puede ser manejado con una semántica de "valor" (su ciclo de vida depende completamente del propietario de la colección) o podría ser una referencia a otra entidad, con su propio ciclo de vida. En el último caso, sólo el estado del "enlace" entre los dos objetos se considera mantenido por la colección.

source: The contained type is referred to as the <emphasis>collection element type</emphasis>. Collection elements are mapped by <literal>&lt;element&gt;</literal> or <literal>&lt;composite-element&gt;</literal>, or in the case of entity references, with <literal>&lt;one-to-many&gt;</literal> or <literal>&lt;many-to-many&gt;</literal>. The first two map elements with value semantics, the next two are used to map entity associations.
es_es: Se hace referencia al tipo contenido como el <emphasis>tipo de elemento de la colección</emphasis>. Los elementos de colección son mapeados por <literal>&lt;element&gt;</literal> o <literal>&lt;composite-element&gt;</literal>, o en el caso de referencias de entidades, con <literal>&lt;one-to-many&gt;</literal> o <literal>&lt;many-to-many&gt;</literal>. Las dos primeras mapean elementos con semántica de valor, los dos siguientes son usados para mapear asociaciones de entidades.

source: Indexed collections
es_es: Colecciones indexadas

source: All collection mappings, except those with set and bag semantics, need an <emphasis>index column</emphasis> in the collection table - a column that maps to an array index, or <literal>List</literal> index, or <literal>Map</literal> key. The index of a <literal>Map</literal> may be of any basic type, mapped with <literal>&lt;map-key&gt;</literal>, it may be an entity reference mapped with <literal>&lt;map-key-many-to-many&gt;</literal>, or it may be a composite type, mapped with <literal>&lt;composite-map-key&gt;</literal>. The index of an array or list is always of type <literal>integer</literal> and is mapped using the <literal>&lt;list-index&gt;</literal> element. The mapped column contains sequential integers (numbered from zero, by default).
es_es: Todos los mapeos de colección, excepto aquellos con semántica de set o bag, necesitan una <emphasis>columna índice</emphasis> en la tabla de colección, una columna que mapea a un índice de array, o índice de <literal>List</literal>, o clave de <literal>Map</literal>. El índice de un <literal>Map</literal> puede ser de cualquier tipo básico, mapeado con <literal>&lt;map-key&gt;</literal>, o puede ser una referencia de entidad, mapeada con <literal>&lt;map-key-many-to-many&gt;</literal>, o puede ser un tipo compuesto, mapeado con <literal>&lt;composite-map-key&gt;</literal>. El índice de un array o lista es siempre de tipo <literal>integer</literal> y se mapea usando el elemento <literal>&lt;list-index&gt;</literal>. La columna mapeada contiene enteros secuenciales (numerados desde cero, por defecto).

source: If your table doesn't have an index column, and you still wish to use <literal>List</literal> as the property type, you should map the property as a Hibernate <emphasis>&lt;bag&gt;</emphasis>. A bag does not retain its order when it is retrieved from the database, but it may be optionally sorted or ordered.
es_es: Si tu tabla no tiene una columna índice, y deseas aún usar <literal>List</literal> como tipo de propiedad, debes mapear la propiedad como un <emphasis>&lt;bag&gt;</emphasis> de Hibernate. Un bag (bolsa) no retiene su orden al ser recuperado de la base de datos, pero puede ser ordenado o clasificado opcionalmente.

source: There are quite a range of mappings that can be generated for collections, covering many common relational models. We suggest you experiment with the schema generation tool to get a feeling for how various mapping declarations translate to database tables.
es_es: Hay absolutamente un rango de mapeos que pueden ser generados para colecciones, cubriendo muchos modelos relacionales comunes. Te sugerimos que experimentes con la herramienta de generación de esquemas para obtener una idea de cómo varias declaraciones de mapeo se traducen a tablas de base de datos.

source: Collections of values and many-to-many associations
es_es: Colecciones de valores y asociaciones muchos-a-muchos

source: Any collection of values or many-to-many association requires a dedicated <emphasis>collection table</emphasis> with a foreign key column or columns, <emphasis>collection element column</emphasis> or columns and possibly an index column or columns.
es_es: Cualquier colección de valores o asociación muchos a muchos requiere una <emphasis>tabla de colección</emphasis> dedicada con una columna o columnas de clave foránea, <emphasis>columna de elemento de colección</emphasis> o columnas y posiblemente una columna o columnas índice.

source: For a collection of values, we use the <literal>&lt;element&gt;</literal> tag.
es_es: Para una colección de valores, usamos la etiqueta <literal>&lt;element&gt;</literal>.

source: Some examples, first, a set of strings:
es_es: Algunos ejemplos, primero, un conjunto de cadenas:

source: A bag containing integers (with an iteration order determined by the <literal>order-by</literal> attribute):
es_es: Un bag conteniendo enteros (con un orden de iteración determinado por el atributo <literal>order-by</literal>):

source: An array of entities - in this case, a many to many association:
es_es: Un array de entidades - en este caso, una asociación muchos a muchos:

source: A map from string indices to dates:
es_es: Un mapa de índices de cadenas a fechas:

source: A list of components (discussed in the next chapter):
es_es: Una lista de componentes (discutidos en el próximo capítulo):

source: One-to-many associations
es_es: Asociaciones uno-a-muchos

source: A <emphasis>one to many association</emphasis> links the tables of two classes via a foreign key, with no intervening collection table. This mapping loses certain semantics of normal Java collections:
es_es: Una <emphasis>asociación uno a muchos</emphasis> enlaza las tablas de dos clases por medio de una clave foránea, sin intervención de tabla de colección alguna. Este mapeo pierde cierta semántica de colecciones Java normales:

source: An instance of the contained entity class may not belong to more than one instance of the collection
es_es: Una instancia de la clase entidad contenida no puede pertenecer a más de una instancia de la colección.

source: An instance of the contained entity class may not appear at more than one value of the collection index
es_es: Una instancia de la clase entidad contenida no puede aparecer en más de un valor del índice de colección.

source: An association from <literal>Product</literal> to <literal>Part</literal> requires existence of a foreign key column and possibly an index column to the <literal>Part</literal> table. A <literal>&lt;one-to-many&gt;</literal> tag indicates that this is a one to many association.
es_es: Una asociación de <literal>Product</literal> a <literal>Part</literal> requiere la existencia de una columna clave foránea y posiblemente una columna índice a la tabla <literal>Part</literal>. Una etiqueta <literal>&lt;one-to-many&gt;</literal> indica que ésta es una asociación uno a muchos.

source: <literal>class</literal> (required): The name of the associated class.
es_es: <literal>class</literal> (requerido): El nombre de la clase asociada.

source: <literal>not-found</literal> (optional - defaults to <literal>exception</literal>): Specifies how cached identifiers that reference missing rows will be handled: <literal>ignore</literal> will treat a missing row as a null association.
es_es: <literal>not-found</literal> (opcional - por defecto a <literal>exception</literal>): Especifica cómo serán manejados los identificadores en caché que referencien filas perdidas: <literal>ignore</literal> tratará una fila perdida como una asociación nula.

source: <literal>entity-name</literal> (optional): The entity name of the associated class, as an alternative to <literal>class</literal>.
es_es: <literal>entity-name</literal> (opcional): El nombre de entidad de la clase asociada, como una alternativa a <literal>class</literal>.

source: Notice that the <literal>&lt;one-to-many&gt;</literal> element does not need to declare any columns. Nor is it necessary to specify the <literal>table</literal> name anywhere.
es_es: Observa que el elemento <literal>&lt;one-to-many&gt;</literal> no necesita declarar ninguna columna. Ni es necesario especificar el nombre de <literal>table</literal> en ningún sitio.

source: <emphasis>Very important note:</emphasis> If the foreign key column of a <literal>&lt;one-to-many&gt;</literal> association is declared <literal>NOT NULL</literal>, you must declare the <literal>&lt;key&gt;</literal> mapping <literal>not-null="true"</literal> or <emphasis>use a bidirectional association</emphasis> with the collection mapping marked <literal>inverse="true"</literal>. See the discussion of bidirectional associations later in this chapter.
es_es: <emphasis>Nota muy importante:</emphasis> Si la columna clave foránea de una asociación <literal>&lt;one-to-many&gt;</literal> es declarada <literal>NOT NULL</literal>, debes declarar el mapeo de <literal>&lt;key&gt;</literal><literal>not-null="true"</literal> o <emphasis>usar una asociación bidireccional</emphasis> con el mapeo de colección marcado <literal>inverse="true"</literal>. Ver la discusión sobre asociaciones bidireccionales más adelante en este capítulo.

source: This example shows a map of <literal>Part</literal> entities by name (where <literal>partName</literal> is a persistent property of <literal>Part</literal>). Notice the use of a formula-based index.
es_es: Este ejemplo muestra un mapa de entidades <literal>Part</literal> por nombre (donde <literal>partName</literal> es una propiedad persistente de <literal>Part</literal>). Observa el uso de un índice basado en fórmula.

source: Advanced collection mappings
es_es: Mapeos de colección avanzados

source: Sorted collections
es_es: Colecciones ordenadas

source: Hibernate supports collections implementing <literal>java.util.SortedMap</literal> and <literal>java.util.SortedSet</literal>. You must specify a comparator in the mapping file:
es_es: Hibernate soporta colecciones implementando <literal>java.util.SortedMap</literal> y <literal>java.util.SortedSet</literal>. Debes especificar un comparador en el fichero de mapeo:

source: Allowed values of the <literal>sort</literal> attribute are <literal>unsorted</literal>, <literal>natural</literal> and the name of a class implementing <literal>java.util.Comparator</literal>.
es_es: Los valores permitidos del atributo <literal>sort</literal> son <literal>unsorted</literal>, <literal>natural</literal> y el nombre de una clase que implemente <literal>java.util.Comparator</literal>.
