Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/collection_mapping.po
Languages: es_es

source: Sorted collections actually behave like <literal>java.util.TreeSet</literal> or <literal>java.util.TreeMap</literal>.
es_es: Las colecciones ordenadas realmente se comportan como <literal>java.util.TreeSet</literal> o <literal>java.util.TreeMap</literal>.

source: If you want the database itself to order the collection elements use the <literal>order-by</literal> attribute of <literal>set</literal>, <literal>bag</literal> or <literal>map</literal> mappings. This solution is only available under JDK 1.4 or higher (it is implemented using <literal>LinkedHashSet</literal> or <literal>LinkedHashMap</literal>). This performs the ordering in the SQL query, not in memory.
es_es: Si quieres que la misma base de datos ordene los elementos de colección usa el atributo <literal>order-by</literal> de los mapeos <literal>set</literal>, <literal>bag</literal> o <literal>map</literal>. Esta solución está disponible sólo bajo el JDK 1.4 o superior (está implementado usando <literal>LinkedHashSet</literal> o <literal>LinkedHashMap</literal>). Esto realiza la ordenación en la consulta SQL, no en memoria.

source: Note that the value of the <literal>order-by</literal> attribute is an SQL ordering, not a HQL ordering!
es_es: Observa que el valor del atributo <literal>order-by</literal> es una ordenación SQL, no una ordenación HQL!

source: Associations may even be sorted by some arbitrary criteria at runtime using a collection <literal>filter()</literal>.
es_es: Las asociaciones pueden incluso ser ordenadas por algún criterio arbitrario en tiempo de ejecución usando un <literal>filter()</literal> de colección.

source: Bidirectional associations
es_es: Asociaciones bidireccionales

source: one-to-many
es_es: uno-a-muchos

source: set or bag valued at one end, single-valued at the other
es_es: set o bag valorados en un extremo, monovaluados al otro

source: many-to-many
es_es: muchos-a-muchos

source: set or bag valued at both ends
es_es: set o bag valorados a ambos extremos

source: You may specify a bidirectional many-to-many association simply by mapping two many-to-many associations to the same database table and declaring one end as <emphasis>inverse</emphasis> (which one is your choice, but it can not be an indexed collection).
es_es: Puedes especificar una asociación bidireccional muchos-a-muchos simplemente mapeando dos asociaciones muchos-a-muchos a la misma tabla de base de datos y declarando un extremo como <emphasis>inverse</emphasis> (cuál de ellos es tu elección, pero no puede ser una colección indexada).

source: Here's an example of a bidirectional many-to-many association; each category can have many items and each item can be in many categories:
es_es: He aquí un ejemplo de una asociación bidireccional muchos-a-muchos; cada categoría puede tener muchos ítems y cada ítem puede estar en muchas categorías:

source: Changes made only to the inverse end of the association are <emphasis>not</emphasis> persisted. This means that Hibernate has two representations in memory for every bidirectional association, one link from A to B and another link from B to A. This is easier to understand if you think about the Java object model and how we create a many-to-many relationship in Java:
es_es: Los cambios hechos sólo al extremo inverso de la asociación <emphasis>no</emphasis> son persistidos. Esto significa que Hibernate tiene dos representaciones en memoria para cada asociación bidireccional, una enlaza de A a B y otra enlaza de B a A. Esto es más fácil de entender si piensas en el modelo de objetos de Java y cómo creamos una relación muchos-a-muchos en Java:

source: The non-inverse side is used to save the in-memory representation to the database.
es_es: El lado no-inverso se usa para salvar la representación en memoria a la base de datos.

source: You may define a bidirectional one-to-many association by mapping a one-to-many association to the same table column(s) as a many-to-one association and declaring the many-valued end <literal>inverse="true"</literal>.
es_es: Puedes definir una asociación bidireccional uno-a-muchos mapeando una asociación uno-a-muchos a la misma columna (o columnas) de tabla como una asociación muchos-a-uno y declarando el extremo multivaluado <literal>inverse="true"</literal>.

source: Mapping one end of an association with <literal>inverse="true"</literal> doesn't affect the operation of cascades, these are orthogonal concepts!
es_es: Mapear un extremo de una asociación con <literal>inverse="true"</literal> no afecta la operación de cascadas; éstos son conceptos ortogonales!

source: Bidirectional associations with indexed collections
es_es: Asociaciones bidireccionales con colecciones indexadas

source: A bidirectional association where one end is represented as a <literal>&lt;list&gt;</literal> or <literal>&lt;map&gt;</literal> requires special consideration. If there is a property of the child class which maps to the index column, no problem, we can continue using <literal>inverse="true"</literal> on the collection mapping:
es_es: Requiere especial consideración una asociación bidireccional donde un extremo esté representado como una <literal>&lt;list&gt;</literal> o <literal>&lt;map&gt;</literal>. Si hay una propiedad de la clase hija que mapee a la columna índice, no hay problema, podemos seguir usando <literal>inverse="true"</literal> en el mapeo de la colección:

source: But, if there is no such property on the child class, we can't think of the association as truly bidirectional (there is information available at one end of the association that is not available at the other end). In this case, we can't map the collection <literal>inverse="true"</literal>. Instead, we could use the following mapping:
es_es: Pero, si no existe tal proiedad en la clase hija, no podemos pensar en la asociación como verdaderamente bidireccional (hay información en un extremo de la asociación que no está disponible en el otro extremo). En este caso, no podemos mapear la colección con <literal>inverse="true"</literal>. En cambio, podríamos usar el siguiente mapeo:

source: Note that in this mapping, the collection-valued end of the association is responsible for updates to the foreign key. TODO: Does this really result in some unnecessary update statements?
es_es: Nota que, en este mapeo, el extremo de la asociación valuado en colección es responsable de las actualizaciones a la clave foránea.

source: Ternary associations
es_es: Asociaciones ternarias

source: There are three possible approaches to mapping a ternary association. One is to use a <literal>Map</literal> with an association as its index:
es_es: Hay tres enfoques posibles para mapear una asociación ternaria. Una es usar un <literal>Map</literal> con una asociación como su índice:

source: A second approach is to simply remodel the association as an entity class. This is the approach we use most commonly.
es_es: Un segundo enfoque es simplemente remodelar la asociación como una clase de entidad. Este es el enfoque que usamos más comunmente.

source: A final alternative is to use composite elements, which we will discuss later.
es_es: Una alternativa final es usar elementos compuestos, que discutiremos más adelante.

source: Using an &lt;idbag&gt;
es_es: Usando un &lt;idbag&gt;

source: If you've fully embraced our view that composite keys are a bad thing and that entities should have synthetic identifiers (surrogate keys), then you might find it a bit odd that the many to many associations and collections of values that we've shown so far all map to tables with composite keys! Now, this point is quite arguable; a pure association table doesn't seem to benefit much from a surrogate key (though a collection of composite values <emphasis>might</emphasis>). Nevertheless, Hibernate provides a feature that allows you to map many to many associations and collections of values to a table with a surrogate key.
es_es: Si has adoptado completamente nuestra visión de que las claves compuestas son una cosa mala y que las entidades deben tener identificadores sitéticos (claves delegadas), entonces podrías encontrar un poco raro que todas las asociaciones muchos a muchos y las colecciones de valores que hemos mostrado hasta ahora mapeen a tablas con claves compuestas! Ahora, este punto es discutible; una tabla de pura asociación no parece beneficiarse demasiado de una clave delegada (aunque sí <emphasis>podría</emphasis> una colección de valores compuestos). Sin embargo, Hibernate provee una funcionalidad que te permite mapear asociaciones muchos a muchos y colecciones de valores a una tabla con una clave delegada.

source: The <literal>&lt;idbag&gt;</literal> element lets you map a <literal>List</literal> (or <literal>Collection</literal>) with bag semantics.
es_es: El elemento <literal>&lt;idbag&gt;</literal> te permite mapear una <literal>List</literal> (o <literal>Collection</literal>) con semántica de bag.

source: As you can see, an <literal>&lt;idbag&gt;</literal> has a synthetic id generator, just like an entity class! A different surrogate key is assigned to each collection row. Hibernate does not provide any mechanism to discover the surrogate key value of a particular row, however.
es_es: Como puedes ver, un <literal>&lt;idbag&gt;</literal> tiene un generador de id sintético, igual que una clase de entidad! Una clave delegada diferente se asigna a cada fila de la colección. Hibernate no provee ningún mecanismo para descubrir el valor de clave delegada de una fila en particular, sin embargo.

source: Note that the update performance of an <literal>&lt;idbag&gt;</literal> is <emphasis>much</emphasis> better than a regular <literal>&lt;bag&gt;</literal>! Hibernate can locate individual rows efficiently and update or delete them individually, just like a list, map or set.
es_es: Observa que el rendimiento de actualización de un <literal>&lt;idbag&gt;</literal> es <emphasis>mucho</emphasis> mejor que el de un <literal>&lt;bag&gt;</literal> regular! Hibernate puede localizar filas individuales eficientemente y actualizarlas o borrarlas individualmente, igual que si fuese una lista, mapa o conjunto.

source: In the current implementation, the <literal>native</literal> identifier generation strategy is not supported for <literal>&lt;idbag&gt;</literal> collection identifiers.
es_es: En la implementación actual, la estrategia de generación de identificador <literal>native</literal> no está soportada para identificadores de colecciones <literal>&lt;idbag&gt;</literal>.

source: Collection examples
es_es: Ejemplos de colección

source: The previous sections are pretty confusing. So lets look at an example. This class:
es_es: Las secciones previas son bastantes confusas. Así que miremos un ejemplo. Esta clase:

source: has a collection of <literal>Child</literal> instances. If each child has at most one parent, the most natural mapping is a one-to-many association:
es_es: tiene una colección de instancias de <literal>Child</literal>. Si cada hijo tiene como mucho un padre, el mapeo más natural es una asociación uno-a-muchos:

source: This maps to the following table definitions:
es_es: Esto mapea a las siguientes definiciones de tablas:

source: If the parent is <emphasis>required</emphasis>, use a bidirectional one-to-many association:
es_es: Si el padre es <emphasis>requerido</emphasis>, usa una asociación bidireccional uno-a-muchos:

source: Notice the <literal>NOT NULL</literal> constraint:
es_es: Observa la restricción <literal>NOT NULL</literal>:

source: Alternatively, if you absolutely insist that this association should be unidirectional, you can declare the <literal>NOT NULL</literal> constraint on the <literal>&lt;key&gt;</literal> mapping:
es_es: Alternativamente, si absolutamente insistes que esta asociación debe ser unidireccional, puedes declarar la restricción <literal>NOT NULL</literal> en el mapeo de <literal>&lt;key&gt;</literal>:

source: On the other hand, if a child might have multiple parents, a many-to-many association is appropriate:
es_es: En la otra mano, si un hijo pudiera tener múltiples padres, sería apropiada una asociación muchos-a-muchos:

source: Table definitions:
es_es: Definiciones de tabla:

source: For more examples and a complete walk-through a parent/child relationship mapping, see <xref linkend="example-parentchild"/>.
es_es: Para más ejemplos y un paseo completo a través del mapeo de relaciones padre/hijo, ver <xref linkend="example-parentchild"/>.

source: Even more exotic association mappings are possible, we will catalog all possibilities in the next chapter.
es_es: Son posibles mapeos de asociación aún más complejos. Catalogaremos todas las posibilidades en el próximo capítulo.
