Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/src/main/docbook/*/content/tutorial.po
Languages: es_es

source: Copy this file into the source directory, so it will end up in the root of the classpath. Hibernate automatically looks for a file called <literal>hibernate.cfg.xml</literal> in the root of the classpath, on startup.
es_es: Copia este fichero dentro del directorio de código fuente, de modo que termine ubicado en la raiíz del classpath. Hibernate busca automáticamente un fichero llamado <literal>hibernate.cfg.xml</literal> en la raíz del classpath al arrancar.

source: Building with Ant
es_es: Construyendo con Ant

source: We'll now build the tutorial with Ant. You will need to have Ant installed - get it from the <ulink url="http://ant.apache.org/bindownload.cgi">Ant download page</ulink>. How to install Ant will not be covered here. Please refer to the <ulink url="http://ant.apache.org/manual/index.html">Ant manual</ulink>. After you have installed Ant, we can start to create the buildfile. It will be called <literal>build.xml</literal> and placed directly in the development directory.
es_es: Construiremos ahora el tutorial con Ant. Necesitarás tener Ant instalado. Obténlo de <ulink url="http://ant.apache.org/bindownload.cgi">Página de descarga de Ant</ulink>. No se cubrirá aquí cómo instalar Ant. Por favor refiérete al <ulink url="http://ant.apache.org/manual/index.html"> Manual de Ant</ulink>. Después que hayas instalado Ant, podemos comenzar a crear el buildfile. Será llamado <literal>build.xml</literal> y colocado directamente en el directorio de desarrollo.

source: A basic build file looks like this:
es_es: Reparar Ant

source: This will tell Ant to add all files in the lib directory ending with <literal>.jar</literal> to the classpath used for compilation. It will also copy all non-Java source files to the target directory, e.g. configuration and Hibernate mapping files. If you now run Ant, you should get this output:
es_es: Observa que la distribución de Ant está por defecto rota (como se describe en el FAQ de Ant) y tiene que ser reparado por ti, por ejemplo, si quisieras usar JUnit desde dentro de tu fichero de construcción. Para hacer que funcione la tarea de JUnit (no lo necesitaremos en este tutorial), copia junit.jar a <literal>ANT_HOME/lib</literal> o quita el trozo de plugin <literal>ANT_HOME/lib/ant-junit.jar</literal>.

source: Startup and helpers
es_es: Un fichero de construcción básico se ve como esto:

source: It's time to load and store some <literal>Event</literal> objects, but first we have to complete the setup with some infrastructure code. We have to startup Hibernate. This startup includes building a global <literal>SessionFactory</literal> object and to store it somewhere for easy access in application code. A <literal>SessionFactory</literal> can open up new <literal>Session</literal>'s. A <literal>Session</literal> represents a single-threaded unit of work, the <literal>SessionFactory</literal> is a thread-safe global object, instantiated once.
es_es: Esto dirá a Ant que agregue todos los ficheros en el directorio lib que terminen con <literal>.jar</literal> al classpath usado para la compilación. También copiará todos los ficheros que no sean código Java al directorio objetivo, por ejemplo, ficheros de configuración y mapeos de Hibernate. Si ahora corres Ant, debes obtener esta salida:

source: We'll create a <literal>HibernateUtil</literal> helper class which takes care of startup and makes accessing a <literal>SessionFactory</literal> convenient. Let's have a look at the implementation:
es_es: Arranque y ayudantes

source: This class does not only produce the global <literal>SessionFactory</literal> in its static initializer (called once by the JVM when the class is loaded), but also hides the fact that it uses a static singleton. It might as well lookup the <literal>SessionFactory</literal> from JNDI in an application server.
es_es: Es momento de cargar y almacenar algunos objetos <literal>Event</literal>, pero primero tenemos que completar la configuración de algún código de infraestructura. Tenemos que arrancar Hibernate. Este arranque incluye construir un objeto <literal>SessionFactory</literal> global y almacenarlo en algún sitio de fácil acceso en el código de aplicación. Una <literal>SessionFactory</literal> puede abrir nuevas <literal>Session</literal>'s. Una <literal>Session</literal> representa un unidad de trabajo mono-hebra. La <literal>SessionFactory</literal> es un objeto global seguro entre hebras, instanciado una sola vez.

source: If you give the <literal>SessionFactory</literal> a name in your configuration file, Hibernate will in fact try to bind it to JNDI after it has been built. To avoid this code completely you could also use JMX deployment and let the JMX-capable container instantiate and bind a <literal>HibernateService</literal> to JNDI. These advanced options are discussed in the Hibernate reference documentation.
es_es: Crearemos una clase de ayuda <literal>HibernateUtil</literal> que cuide del arranque y haga conveniente el manejo de <literal>Session</literal>. El así llamado patrón <emphasis>Sesión de Hebra Local (ThreadLocal Session)</emphasis> es útil aquí; mantenemos la unidad de trabajo actual asociada a la hebra actual. Echemos una mirada a la implementación:

source: Place <literal>HibernateUtil.java</literal> in the development source directory, in a package next to <literal>events</literal>:
es_es: Esta clase no ólo produce la <literal>SessionFactory</literal> global en su inicializador static (llamado sólo una vez por la JVM al cargar la clase), sino que también tiene una variable <literal>ThreadLocal</literal> para tener la <literal>Session</literal> para la hebra actual. No importa cuándo llames a <literal>HibernateUtil.currentSession()</literal>, siempre devolverá la misma unidad de trabajo de Hibernate en la misma hebra. Una llamada a <literal>HibernateUtil.closeSession()</literal> termina la unidad de trabajo actualmente asociada a la hebra.

source: This should again compile without problems. We finally need to configure a logging system - Hibernate uses commons logging and leaves you the choice between Log4j and JDK 1.4 logging. Most developers prefer Log4j: copy <literal>log4j.properties</literal> from the Hibernate distribution (it's in the <literal>etc/</literal> directory) to your <literal>src</literal> directory, next to <literal>hibernate.cfg.xml</literal>. Have a look at the example configuration and change the settings if you like to have more verbose output. By default, only Hibernate startup message are shown on stdout.
es_es: Asegúrate de entender el concepto Java de una variable local a una hebra antes de usar esta ayuda. Una clase <literal>HibernateUtil</literal> más potente puede encontrarse en <literal>CaveatEmptor</literal>, http://caveatemptor.hibernate.org/, así como en el libro "Java Persistence with Hibernate". Observa que esta clase no es necesaria si despliegas Hibernate en un servidor de aplicaciones J2EE: una <literal>Session</literal> será automáticamente ligada a la transacción JTA actual, y puedes buscar la <literal>SessionFactory</literal> a través de JNDI. Si usas JBoss AS, Hibernate puede ser desplegado como un servicio de sistema manejado y automáticamente ligará la <literal>SessionFactory</literal> a un nombre JNDI.

source: The tutorial infrastructure is complete - and we are ready to do some real work with Hibernate.
es_es: Coloca <literal>HibernateUtil.java</literal> en el directorio de fuentes de desarrollo, junto a <literal>Event.java</literal>:

source: Loading and storing objects
es_es: Esto también debe compilar sin problemas. Finalmente necesitamos configurar un sistema de logging (registro). Hibernate usa commons logging y te deja la elección entre Log4J y logging de JDK 1.4. La mayoría de los desarrolladores prefieren Log4J: copia <literal>log4j.properties</literal> de la distribución de Hibernate (está en el directorio <literal>etc/</literal>) a tu directorio <literal>src</literal>, junto a <literal>hibernate.cfg.xml</literal>. Echa una mirada a la configuración de ejemplo y cambia los ajustes si te gusta tener una salida más verborrágica. Por defecto, sólo se muestra el mensaje de arranque de Hibernate en la salida.

source: Finally, we can use Hibernate to load and store objects. We write an <literal>EventManager</literal> class with a <literal>main()</literal> method:
es_es: La infraestructura del tutorial está completa, y estamos listos para hacer algún trabajo real con Hibernate.

source: We create a new <literal>Event</literal> object, and hand it over to Hibernate. Hibernate now takes care of the SQL and executes <literal>INSERT</literal>s on the database. Let's have a look at the <literal>Session</literal> and <literal>Transaction</literal>-handling code before we run this.
es_es: Cargando y almacenando objetos

source: A <literal>Session</literal> is a single unit of work. For now we'll keep things simple and assume a one-to-one granularity between a Hibernate <literal>Session</literal> and a database transaction. To shield our code from the actual underlying transaction system (in this case plain JDBC, but it could also run with JTA) we use the <literal>Transaction</literal> API that is available on the Hibernate <literal>Session</literal>.
es_es: Finalmente, podemos usar Hibernate para cargar y almacenar objetos. Escribimos una clase <literal>EventManager</literal> con un método <literal>main()</literal>:

source: What does <literal>sessionFactory.getCurrentSession()</literal> do? First, you can call it as many times and anywhere you like, once you get hold of your <literal>SessionFactory</literal> (easy thanks to <literal>HibernateUtil</literal>). The <literal>getCurrentSession()</literal> method always returns the "current" unit of work. Remember that we switched the configuration option for this mechanism to "thread" in <literal>hibernate.cfg.xml</literal>? Hence, the current unit of work is bound to the current Java thread that executes our application. However, this is not the full picture, you also have to consider scope, when a unit of work begins and when it ends.
es_es: Leemos algunos argumentos de la línea de comandos, y si el primer argumento es "store", creamos y almacenamos un nuevo Event:

source: A <literal>Session</literal> begins when it is first needed, when the first call to <literal>getCurrentSession()</literal> is made. It is then bound by Hibernate to the current thread. When the transaction ends, either through commit or rollback, Hibernate automatically unbinds the <literal>Session</literal> from the thread and closes it for you. If you call <literal>getCurrentSession()</literal> again, you get a new <literal>Session</literal> and can start a new unit of work. This <emphasis>thread-bound</emphasis> programming model is the most popular way of using Hibernate, as it allows flexible layering of your code (transaction demarcation code can be separated from data access code, we'll do this later in this tutorial).
es_es: Creamos un nuevo objeto <literal>Event</literal>, y se lo damos a Hibernate. Hibernate cuida ahora del SQL y ejecuta <literal>INSERT</literal>s en la base de datos. Echemos una mirada al código de manejo de <literal>Session</literal> y <literal>Transaction</literal> antes de ejecutar esto.

source: Related to the unit of work scope, should the Hibernate <literal>Session</literal> be used to execute one or several database operations? The above example uses one <literal>Session</literal> for one operation. This is pure coincidence, the example is just not complex enough to show any other approach. The scope of a Hibernate <literal>Session</literal> is flexible but you should never design your application to use a new Hibernate <literal>Session</literal> for <emphasis>every</emphasis> database operation. So even if you see it a few more times in the following (very trivial) examples, consider <emphasis>session-per-operation</emphasis> an anti-pattern. A real (web) application is shown later in this tutorial.
es_es: Una <literal>Session</literal> es una sola unidad de trabajo. Podría sorprenderte que tengamos una API adicional, <literal>Transaction</literal>. Esto implica que una unidad de trabajo puede ser "más larga" que una sola transacción de base de datos; imagina una unidad de trabajo que se abarca varios ciclos petición/respuesta HTTP (por ejemplo, un diálogo asistente) en una aplicación web. Separar las transacciones de base de datos de "las unidades de trabajo de la aplicación desde el punto de vista del usuario" es uno de los conceptos básicos de diseño de Hibernate. Llamamos una unidad de trabajo larga <emphasis>Transacción de Aplicación</emphasis>, usualmente encapsulando varias transacciones de base de datos más cortas. Por ahora mantendremos las cosas simples y asumiremos una granularidad uno-a-uno entre una <literal>Session</literal> y una <literal>Transaction</literal>.

source: Have a look at <xref linkend="transactions"/> for more information about transaction handling and demarcation. We also skipped any error handling and rollback in the previous example.
es_es: ¿Qué es lo que hacen <literal>Transaction.begin()</literal> y <literal>commit()</literal>? ¿Dónde está el rollback en caso que algo vaya mal? La API de <literal>Transaction</literal> de Hibernate es opcional realmente, pero la usamos por conveniencia y portabilidad. Si manejases la transacción de base de datos por ti mismo (por ejemplo, llamando a <literal>session.connection.commit()</literal>), ligarías el código a un entorno de despliegue particular, en este JDBC directo no manejado. Estableciendo la fábrica de <literal>Transaction</literal> en tu configuración de Hibernate puedes desplegar tu capa de persistencia en cualquier sitio. Echa una mirada al <xref linkend="transactions"/> para más información sobre manejo y demarcación de transacciones. Hemos saltado también cualquier manejo de excepciones y rollback en este ejemplo.

source: To run this first routine we have to add a callable target to the Ant build file:
es_es: Para ejecutar la primera rutina tenemos que agregar un objetivo llamable al fichero de construcción de Ant:

source: The value of the <literal>action</literal> argument is set on the command line when calling the target:
es_es: El valor del argumento <literal>action</literal> es establecido por línea de comandos al llamar al objetivo:

source: You should see, after compilation, Hibernate starting up and, depending on your configuration, lots of log output. At the end you will find the following line:
es_es: Debes ver, después de la compilación, a Hibernate arrancando y, dependiendo de tu configuración mucha salida de registro (log). Al final encontrarás la siguiente línea:

source: This is the <literal>INSERT</literal> executed by Hibernate, the question marks represent JDBC bind parameters. To see the values bound as arguments, or to reduce the verbosity of the log, check your <literal>log4j.properties</literal>.
es_es: Esta es la <literal>INSERT</literal> ejecutada por Hibernate, los signos de preguntas representan parámetros de ligado JDBC. Para ver los valores ligados como argumentos, o para reducir la verborragia del registro, chequea tu <literal>log4j.properties</literal>.

source: Now we'd like to list stored events as well, so we add an option to the main method:
es_es: Ahora quisiéramos listar acontecimientos almacenados también, así que agregamos una opción al método principal:

source: We also add a new <literal>listEvents() method</literal>:
es_es: Agregamos también un nuevo método <literal>listEvents()</literal>:

source: What we do here is use an HQL (Hibernate Query Language) query to load all existing <literal>Event</literal> objects from the database. Hibernate will generate the appropriate SQL, send it to the database and populate <literal>Event</literal> objects with the data. You can create more complex queries with HQL, of course.
es_es: Lo que hacemos aquí es usar una consulta HQL (Lenguaje de Consulta de Hibernate o Hibernate Query Language) para cargar todos los objetos <literal>Event</literal> existentes de la base de datos. Hibernate generará el SQL apropiado, lo enviará a la base de datosy poblará los objetos <literal>Event</literal> con datos. Puedes, por supuesto, crear consultas más complejas con HQL.

source: Part 2 - Mapping associations
es_es: Part 2 - Mapeando asociaciones

source: We mapped a persistent entity class to a table. Let's build on this and add some class associations. First we'll add people to our application, and store a list of events they participate in.
es_es: Hemos mapeado un clase de entidad persistente a una tabla. Construyamos sobre esto y agreguemos algunas asociaciones de clase. Primero agregaremos personas a nuestra aplicación, y almacenaremos una lista de eventos en las que participan.

source: Mapping the Person class
es_es: Mapeando la clase Person

source: The first cut of the <literal>Person</literal> class is simple:
es_es: El primer corte de la clase <literal>Person</literal> es simple:

source: Create a new mapping file called <literal>Person.hbm.xml</literal> (don't forget the DTD reference at the top):
es_es: Crea un fichero de mapeo llamado <literal>Person.hbm.xml</literal>:

source: Finally, add the new mapping to Hibernate's configuration:
es_es: Finalmente, agrega el nuevo mapeo a la configuración de Hibernate:

source: We'll now create an association between these two entities. Obviously, persons can participate in events, and events have participants. The design questions we have to deal with are: directionality, multiplicity, and collection behavior.
es_es: Crearemos ahora una asociación entre estas dos entidades. Obviamente, las personas pueden participar en eventos, y los eventos tienen participantes. Las cuestiones de diseño con que tenemos que tratar son: direccionalidad, multiplicidad y comportamiento de colección.

source: A unidirectional Set-based association
es_es: Una asociación unidireccional basada en Set

source: We'll add a collection of events to the <literal>Person</literal> class. That way we can easily navigate to the events for a particular person, without executing an explicit query - by calling <literal>aPerson.getEvents()</literal>. We use a Java collection, a <literal>Set</literal>, because the collection will not contain duplicate elements and the ordering is not relevant for us.
es_es: Agregaremos una colección de eventos a la clase <literal>Person</literal>. De esta forma podemos navegar facilmente a los eventos de una persona en particular, sin ejecutar una consulta explícita, llamando a <literal>aPerson.getEvents()</literal>. Usamos una colección Java, un <literal>Set</literal>, porque la colección no contendrá elementos duplicados y el ordenamiento no nos es relevante.

source: We need a unidirectional, many-valued associations, implemented with a <literal>Set</literal>. Let's write the code for this in the Java classes and then map it:
es_es: Hasta ahora hemos diseñado asociaciones unidireccionales multivaluadas, implementadas con un <literal>Set</literal>. Escribamos el código para esto en las clases Java y luego lo mapeemos:

source: Before we map this association, think about the other side. Clearly, we could just keep this unidirectional. Or, we could create another collection on the <literal>Event</literal>, if we want to be able to navigate it bi-directional, i.e. <literal>anEvent.getParticipants()</literal>. This is not necessary, from a functional perspective. You could always execute an explicit query to retrieve the participants for a particular event. This is a design choice left to you, but what is clear from this discussion is the multiplicity of the association: "many" valued on both sides, we call this a <emphasis>many-to-many</emphasis> association. Hence, we use Hibernate's many-to-many mapping:
es_es: Antes que mapeemos esta asociación, piensa sobre el otro lado. Claramente, podemos mantener esto solamente unidireccional. O podemos crear otra colección en el <literal>Event</literal>, si queremos ser capaces de navegarlos bidireccionalmente; por ejemplo, <literal>anEvent.getParticipants()</literal>. Esta es una elección de diseño que recae en ti, pero lo que está claro de esta discusión es la multiplicidad de la asociación: "multi" valuada a ambos lados, llamamos a esto una asociación <emphasis>muchos-a-muchos</emphasis>. Por lo tanto, usamos un mapeo many-to-many de Hibernate:

source: Hibernate supports all kinds of collection mappings, a <literal>&lt;set&gt;</literal> being most common. For a many-to-many association (or <emphasis>n:m</emphasis> entity relationship), an association table is needed. Each row in this table represents a link between a person and an event. The table name is configured with the <literal>table</literal> attribute of the <literal>set</literal> element. The identifier column name in the association, for the person's side, is defined with the <literal>&lt;key&gt;</literal> element, the column name for the event's side with the <literal>column</literal> attribute of the <literal>&lt;many-to-many&gt;</literal>. You also have to tell Hibernate the class of the objects in your collection (correct: the class on the other side of the collection of references).
es_es: Hibernate soporta todo tipo de mapeos de colección, siendo el más común un <literal>&lt;set&gt;</literal>. Para una asociación muchos-a-muchos (o relación de entidad <emphasis>n:m</emphasis>), se necesita una tabla de asociación. Cada fila en esta tabla representa un enlace entre una persona y un evento. Esta tabla se configura con el atributo <literal>table</literal> del elemento <literal>set</literal>. El nombre de la columna identificadora en la asociación, para el lado de la persona, se define con el elemento <literal>&lt;key&gt;</literal>. El nombre de columna para el lado del evento se define con el atributo <literal>column</literal> del <literal>&lt;many-to-many&gt;</literal>. También tienes que decirle a Hibernate la clase de los objetos en tu colección (correcto: la clase del otro lado de la colección de referencias).

source: The database schema for this mapping is therefore:
es_es: El esquema de base de datos para este mapeo es, por lo tanto:

source: Working the association
es_es: Trabajando la asociación

source: Let's bring some people and events together in a new method in <literal>EventManager</literal>:
es_es: Traigamos alguna gente y eventos juntos en un nuevo método en <literal>EventManager</literal>:
