Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/association_mapping.po
Languages: fr_fr, ja_jp

source: Association Mappings
fr_fr: Mapper les associations
ja_jp: 関連マッピング

source: Association mappings are the often most difficult thing to get right. In this section we'll go through the canonical cases one by one, starting with unidirectional mappings, and then considering the bidirectional cases. We'll use <literal>Person</literal> and <literal>Address</literal> in all the examples.
fr_fr: Correctement mapper les associations est souvent la tâche la plus difficile. Dans cette section nous traiterons les cas classiques les uns après les autres. Nous commencerons d'abbord par les mappings unidirectionnels, puis nous aborderons la question des mappings bidirectionnels. Nous illustrerons tous nos exemples avec les classes <literal>Person</literal> et <literal>Address</literal>.
ja_jp: 関連マッピングはしばしば理解が最も難しいものになります。 この章では、基本的な一つ一つのケースについて述べます。 単方向のマッピングから始め、それから双方向のケースについて考えていきます。 例として、<literal>Person</literal> と <literal>Address</literal> を用います。

source: We'll classify associations by whether or not they map to an intervening join table, and by multiplicity.
fr_fr: Nous utiliserons deux critères pour classer les associations : le premier sera de savoir si l'association est bâti sur une table supplémentaire d'association et le deuxieme sera basé sur la multiplicité de cette association.
ja_jp: 関連は、結合テーブルを入れるかかどうかと、 多重度によって分類することにします。

source: Nullable foreign keys are not considered good practice in traditional data modelling, so all our examples use not null foreign keys. This is not a requirement of Hibernate, and the mappings will all work if you drop the nullability constraints.
fr_fr: Autoriser une clé étrangère nulle est considéré comme un mauvais choix dans la construction d'un modèle de données. Nous supposerons donc que dans tous les exemples qui vont suivre on aura interdit la valeur nulle pour les clés étrangères. Attention, ceci ne veut pas dire que Hibernate ne supporte pas les clés étrangères pouvant prendre des valeurs nulles, les exemples qui suivent continueront de fonctionner si vous décidiez ne plus imposer la contrainte de non-nullité sur les clés étrangères.
ja_jp: すべての例でnot nullの外部キーを使用します。 これはHibernateの要件ではありません。 not null制約を外したとしても、マッピングは問題なく動作します。

source: Unidirectional associations
fr_fr: Association unidirectionnelle
ja_jp: 単方向関連

source: many to one
fr_fr: plusieurs à un
ja_jp: <title>多対一</title>

source: A <emphasis>unidirectional many-to-one association</emphasis> is the most common kind of unidirectional association.
fr_fr: Une <emphasis>association plusieurs-à-un (many-to-one) unidirectionnelle </emphasis> est le type que l'on rencontre le plus souvent dans les associations unidirectionnelles.
ja_jp: <emphasis>単方向多対一関連</emphasis> は単方向関連の中で最も一般的なものです。

source: one to one
fr_fr: un à un
ja_jp: <title>一対一</title>

source: A <emphasis>unidirectional one-to-one association on a foreign key</emphasis> is almost identical. The only difference is the column unique constraint.
fr_fr: une <emphasis>association un-à-un (one-to-one) sur une clé étrangère</emphasis> est presque identique. La seule différence est sur la contrainte d'unicité que l'on impose à cette colonne.
ja_jp: <emphasis>外部キーの単方向一対一関連</emphasis> はほとんど同じものです。 唯一違うのは、カラムのユニークな制約です。

source: A <emphasis>unidirectional one-to-one association on a primary key</emphasis> usually uses a special id generator. (Notice that we've reversed the direction of the association in this example.)
fr_fr: Une <emphasis>association un-à-un (one-to-one) unidirectionnelle sur une clé primaire</emphasis> utilise un générateur d'identifiant particulier. (Remarquez que nous avons inversé le sens de cette association dans cet exemple.)
ja_jp: <emphasis>主キーの単方向一対一関連</emphasis> は通常、特別なIDジェネレータを使います。 （この例では関連の方向が逆になっていることに注意してください）

source: one to many
fr_fr: un à plusieurs
ja_jp: <title>一対多</title>

source: A <emphasis>unidirectional one-to-many association on a foreign key</emphasis> is a very unusual case, and is not really recommended.
fr_fr: Une <emphasis>association un-à-plusieurs (one-to-many) unidirectionnelle sur une clé étrangère</emphasis> est vraiment inhabituelle, et n'est pas vraiment recommandée.
ja_jp: <emphasis>外部キーの単方向一対多関連</emphasis> はとても特殊なケースで、 あまり推奨されていません。

source: We think it's better to use a join table for this kind of association.
fr_fr: Nous pensons qu'il est préférable d'utiliser une table de jointure pour ce type d'association.
ja_jp: このような関連のために結合テーブルを使うことをお薦めします。

source: Unidirectional associations with join tables
fr_fr: Associations unidirectionnelles avec tables de jointure
ja_jp: 結合テーブルを使った単方向関連

source: A <emphasis>unidirectional one-to-many association on a join table</emphasis> is much preferred. Notice that by specifying <literal>unique="true"</literal>, we have changed the multiplicity from many-to-many to one-to-many.
fr_fr: Une <emphasis>association unidirectionnelle un-à-plusieurs (one-to-many) avec une table de jointure</emphasis> est un bien meilleur choix. Remarquez qu'en spécifiant <literal>unique="true"</literal>, on a changé la multiplicité plusieurs-à-plusieurs (many-to-many) pour un-à-plusieurs (one-to-many).
ja_jp: <emphasis>結合テーブルを使った単方向一対多関連</emphasis> はより好ましいです。 <literal>unique="true"</literal> の指定により、多重度が多対多から一対多 に変わったことに注意して下さい。

source: A <emphasis>unidirectional many-to-one association on a join table</emphasis> is quite common when the association is optional.
fr_fr: Une <emphasis>assiociation plusieurs-à-un (many-to-one) unidirectionnelle sur une table de jointure</emphasis> est très fréquente quand l'association est optionnelle.
ja_jp: <emphasis>結合テーブルの単方向多対一関連</emphasis> は 関連が任意であるときに非常に一般的なものです。

source: A <emphasis>unidirectional one-to-one association on a join table</emphasis> is extremely unusual, but possible.
fr_fr: Une <emphasis>association unidirectionnelle un-à-un (one-to-one) sur une table de jointure</emphasis> est extrèmement rare mais envisageable.
ja_jp: <emphasis>結合テーブルの単方向一対一関連</emphasis> は、本当に特殊ですが 不可能ではありません。

source: many to many
fr_fr: plusieurs à plusieurs
ja_jp: <title>多対多</title>

source: Finally, we have a <emphasis>unidirectional many-to-many association</emphasis>.
fr_fr: Finallement, nous avons <emphasis>l'association unidirectionnelle plusieurs-à-plusieurs (many-to-many)</emphasis>.
ja_jp: 最後に、<emphasis>単方向多対多関連</emphasis> を示します。

source: Bidirectional associations
fr_fr: Associations bidirectionnelles
ja_jp: 双方向関連

source: one to many / many to one
fr_fr: un à plusieurs / plusieurs à un
ja_jp: 一対多/多対一

source: A <emphasis>bidirectional many-to-one association</emphasis> is the most common kind of association. (This is the standard parent/child relationship.)
fr_fr: Une <emphasis>association bidirectionnelle plusieurs à un (many-to-one)</emphasis> est le type d'association que l'on rencontre le plus souvent. (c'est la façon standard de créer des relations parents/enfants.)
ja_jp: <emphasis>双方向多対一関連</emphasis> は最も一般的な関連です。 （標準的な親子関係です）

source: If you use a <literal>List</literal> (or other indexed collection) you need to set the <literal>key</literal> column of the foreign key to <literal>not null</literal>, and let Hibernate manage the association from the collections side to maintain the index of each element (making the other side virtually inverse by setting <literal>update="false"</literal> and <literal>insert="false"</literal>):
fr_fr: Si vous utilisez une <literal>List</literal> (ou toute autre collection indexée) vous devez paramétrer la colonne <literal>key</literal> de la clé étrangère à <literal>not null</literal>, et laisser Hibernate gérer l'association depuis l'extrémité collection pour maintenir l'index de chaque élément (rendant l'autre extrémité virtuellement inverse en paramétrant <literal>update="false"</literal> et <literal>insert="false"</literal>):
ja_jp: <literal>List</literal> （または他のインデックス付きのコレクション）を使うなら、 外部キーの <literal>key</literal> カラムを <literal>not null</literal> に設定し、 コレクション側が各要素のインデックスをメンテナンスするように、 関連を扱う必要があります （<literal>update="false"</literal> かつ <literal>insert="false"</literal> と設定して、反対側を仮想的にinverseにします）：

source: It is important that you define <literal>not-null="true"</literal> on the <literal>&lt;key&gt;</literal> element of the collection mapping if the underlying foreign key column is <literal>NOT NULL</literal>. Don't only declare <literal>not-null="true"</literal> on a possible nested <literal>&lt;column&gt;</literal> element, but on the <literal>&lt;key&gt;</literal> element.
fr_fr: Un à un
ja_jp: もし外部キーカラムが <literal>NOT NULL</literal> であるならば、 コレクションマッピングの <literal>&lt;key&gt;</literal> 要素を <literal>not-null="true"</literal> にすることは重要です。 入れ子になった <literal>&lt;column&gt;</literal> 要素だけではなく、 <literal>&lt;key&gt;</literal> 要素も <literal>not-null="true"</literal> と定義しないようにしてください。

source: A <emphasis>bidirectional one-to-one association on a foreign key</emphasis> is quite common.
fr_fr: <![CDATA[<class name="Person"> <id name="id" column="personId"> <generator class="native"/> </id> <many-to-one name="address" column="addressId" unique="true" not-null="true"/> </class> <class name="Address"> <id name="id" column="addressId"> <generator class="native"/> </id> <one-to-one name="person" property-ref="address"/> </class>]]>
ja_jp: <emphasis>外部キーの双方向一対一関連</emphasis> は非常に一般的です。

source: <![CDATA[<class name="Person"> <id name="id" column="personId"> <generator class="native"/> </id> <many-to-one name="address" column="addressId" unique="true" not-null="true"/> </class> <class name="Address"> <id name="id" column="addressId"> <generator class="native"/> </id> <one-to-one name="person" property-ref="address"/> </class>]]>
fr_fr: <![CDATA[ create table Person ( personId bigint not null primary key, addressId bigint not null unique ) create table Address ( addressId bigint not null primary key ) ]]>

source: A <emphasis>bidirectional one-to-one association on a primary key</emphasis> uses the special id generator.
fr_fr: <![CDATA[<class name="Person"> <id name="id" column="personId"> <generator class="native"/> </id> <one-to-one name="address"/> </class> <class name="Address"> <id name="id" column="personId"> <generator class="foreign"> <param name="property">person</param> </generator> </id> <one-to-one name="person" constrained="true"/> </class>]]>
ja_jp: <emphasis>主キーの双方向一対一関連</emphasis> は特殊なIDジェネレータを使います。

source: <![CDATA[<class name="Person"> <id name="id" column="personId"> <generator class="native"/> </id> <one-to-one name="address"/> </class> <class name="Address"> <id name="id" column="personId"> <generator class="foreign"> <param name="property">person</param> </generator> </id> <one-to-one name="person" constrained="true"/> </class>]]>
fr_fr: <![CDATA[ create table Person ( personId bigint not null primary key ) create table Address ( personId bigint not null primary key ) ]]>

source: Bidirectional associations with join tables
fr_fr: un à plusieurs / plusieurs à un
ja_jp: 結合テーブルを使った双方向関連

source: A <emphasis>bidirectional one-to-many association on a join table</emphasis>. Note that the <literal>inverse="true"</literal> can go on either end of the association, on the collection, or on the join.
fr_fr: <![CDATA[<class name="Person"> <id name="id" column="personId"> <generator class="native"/> </id> <set name="addresses" table="PersonAddress"> <key column="personId"/> <many-to-many column="addressId" unique="true" class="Address"/> </set> </class> <class name="Address"> <id name="id" column="addressId"> <generator class="native"/> </id> <join table="PersonAddress" inverse="true" optional="true"> <key column="addressId"/> <many-to-one name="person" column="personId" not-null="true"/> </join> </class>]]>
ja_jp: <emphasis>結合テーブルの双方向一対多関連</emphasis> です。 <literal>inverse="true"</literal> が関連端、コレクション、結合のいずれかに 設定できることに注意してください。

source: <![CDATA[<class name="Person"> <id name="id" column="personId"> <generator class="native"/> </id> <set name="addresses" table="PersonAddress"> <key column="personId"/> <many-to-many column="addressId" unique="true" class="Address"/> </set> </class> <class name="Address"> <id name="id" column="addressId"> <generator class="native"/> </id> <join table="PersonAddress" inverse="true" optional="true"> <key column="addressId"/> <many-to-one name="person" column="personId" not-null="true"/> </join> </class>]]>
fr_fr: <![CDATA[ create table Person ( personId bigint not null primary key ) create table PersonAddress ( personId bigint not null, addressId bigint not null primary key ) create table Address ( addressId bigint not null primary key ) ]]>

source: <![CDATA[ create table Person ( personId bigint not null primary key ) create table PersonAddress ( personId bigint not null, addressId bigint not null primary key ) create table Address ( addressId bigint not null primary key ) ]]>
fr_fr: Un à un

source: A <emphasis>bidirectional one-to-one association on a join table</emphasis> is extremely unusual, but possible.
fr_fr: <![CDATA[<class name="Person"> <id name="id" column="personId"> <generator class="native"/> </id> <join table="PersonAddress" optional="true"> <key column="personId" unique="true"/> <many-to-one name="address" column="addressId" not-null="true" unique="true"/> </join> </class> <class name="Address"> <id name="id" column="addressId"> <generator class="native"/> </id> <join table="PersonAddress" optional="true" inverse="true"> <key column="addressId" unique="true"/> <many-to-one name="person" column="personId" not-null="true" unique="true"/> </join> </class>]]>
ja_jp: <emphasis>結合テーブルの双方向一対一関連</emphasis> は非常に特殊ですが、可能です。

source: <![CDATA[<class name="Person"> <id name="id" column="personId"> <generator class="native"/> </id> <join table="PersonAddress" optional="true"> <key column="personId" unique="true"/> <many-to-one name="address" column="addressId" not-null="true" unique="true"/> </join> </class> <class name="Address"> <id name="id" column="addressId"> <generator class="native"/> </id> <join table="PersonAddress" optional="true" inverse="true"> <key column="addressId" unique="true"/> <many-to-one name="person" column="personId" not-null="true" unique="true"/> </join> </class>]]>
fr_fr: <![CDATA[ create table Person ( personId bigint not null primary key ) create table PersonAddress ( personId bigint not null primary key, addressId bigint not null unique ) create table Address ( addressId bigint not null primary key ) ]]>
ja_jp: <![CDATA[<class name="Person"> <id name="id" column="personId"> <generator class="native"/> </id> <join table="PersonAddress" optional="true"> <key column="personId" unique="true"/> <many-to-one name="address" column="addressId" not-null="true" unique="true"/> </join> </class> <class name="Address"> <id name="id" column="addressId"> <generator class="native"/> </id> <join table="PersonAddress" optional="true" inverse="true"> <key column="addressId" unique="true"/> <many-to-one name="address" column="personId" not-null="true" unique="true"/> </join> </class>]]>

source: Finally, we have a <emphasis>bidirectional many-to-many association</emphasis>.
fr_fr: <![CDATA[<class name="Person"> <id name="id" column="personId"> <generator class="native"/> </id> <set name="addresses" table="PersonAddress"> <key column="personId"/> <many-to-many column="addressId" class="Address"/> </set> </class> <class name="Address"> <id name="id" column="addressId"> <generator class="native"/> </id> <set name="people" inverse="true" table="PersonAddress"> <key column="addressId"/> <many-to-many column="personId" class="Person"/> </set> </class>]]>
ja_jp: 最後に、<emphasis>双方向多対多関連</emphasis> を示します。

source: <![CDATA[<class name="Person"> <id name="id" column="personId"> <generator class="native"/> </id> <set name="addresses" table="PersonAddress"> <key column="personId"/> <many-to-many column="addressId" class="Address"/> </set> </class> <class name="Address"> <id name="id" column="addressId"> <generator class="native"/> </id> <set name="people" inverse="true" table="PersonAddress"> <key column="addressId"/> <many-to-many column="personId" class="Person"/> </set> </class>]]>
fr_fr: <![CDATA[ create table Person ( personId bigint not null primary key ) create table PersonAddress ( personId bigint not null, addressId bigint not null, primary key (personId, addressId) ) create table Address ( addressId bigint not null primary key ) ]]>

source: More complex association mappings
fr_fr: Des associations encore plus complexes sont <emphasis>extrêmement</emphasis> rares. Hibernate permet de gérer des situations plus complexes en utilisant des parties SQL dans les fichiers de mapping. Par exemple, si une table avec l'historiques des informations d'un compte définit les colonnes <literal>accountNumber</literal>, <literal>effectiveEndDate</literal> et <literal>effectiveStartDate</literal>, mappées de telle sorte:
ja_jp: より複雑な関連マッピング

source: More complex association joins are <emphasis>extremely</emphasis> rare. Hibernate makes it possible to handle more complex situations using SQL fragments embedded in the mapping document. For example, if a table with historical account information data defines <literal>accountNumber</literal>, <literal>effectiveEndDate</literal> and <literal>effectiveStartDate</literal>columns, mapped as follows:
fr_fr: <![CDATA[<properties name="currentAccountKey"> <property name="accountNumber" type="string" not-null="true"/> <property name="currentAccount" type="boolean"> <formula>case when effectiveEndDate is null then 1 else 0 end</formula> </property> </properties> <property name="effectiveEndDate" type="date"/> <property name="effectiveStateDate" type="date" not-null="true"/>]]>
ja_jp: より複雑な関連結合は <emphasis>極めて</emphasis> 稀です。 マッピングドキュメントにSQL文を埋め込むことで、 さらに複雑な状況を扱うことができます。 例えば、<literal>accountNumber</literal>, <literal>effectiveEndDate</literal>, <literal>effectiveStartDate</literal> カラムを持つaccount（口座）情報の履歴を扱うテーブルは、 以下のようにマッピングします。

source: <![CDATA[<properties name="currentAccountKey"> <property name="accountNumber" type="string" not-null="true"/> <property name="currentAccount" type="boolean"> <formula>case when effectiveEndDate is null then 1 else 0 end</formula> </property> </properties> <property name="effectiveEndDate" type="date"/> <property name="effectiveStateDate" type="date" not-null="true"/>]]>
fr_fr: alors nous pouvons mapper une association à l'instance <emphasis>courante</emphasis> (celle avec une <literal>effectiveEndDate</literal>) nulle en utilisant:

source: Then we can map an association to the <emphasis>current</emphasis> instance (the one with null <literal>effectiveEndDate</literal>) using:
fr_fr: <![CDATA[<many-to-one name="currentAccountInfo" property-ref="currentAccountKey" class="AccountInfo"> <column name="accountNumber"/> <formula>'1'</formula> </many-to-one>]]>
ja_jp: そして、関連を <emphasis>現時点の</emphasis> インスタンス （<literal>effectiveEndDate</literal> がnullであるもの）にマッピングします。 以下のようになります：

source: <![CDATA[<many-to-one name="currentAccountInfo" property-ref="currentAccountKey" class="AccountInfo"> <column name="accountNumber"/> <formula>'1'</formula> </many-to-one>]]>
fr_fr: Dans un exemple plus complexe, imaginez qu'une association entre <literal>Employee</literal> et <literal>Organization</literal> est gérée dans une table <literal>Employment</literal> pleines de données historiques. Dans ce cas, une association vers l'employeur <emphasis>le plus récent</emphasis> (celui avec la <literal>startDate</literal> la plus récente) pourrait être mappée comme cela:

source: In a more complex example, imagine that the association between <literal>Employee</literal> and <literal>Organization</literal> is maintained in an <literal>Employment</literal> table full of historical employment data. Then an association to the employee's <emphasis>most recent</emphasis> employer (the one with the most recent <literal>startDate</literal>) might be mapped this way:
fr_fr: <![CDATA[<join> <key column="employeeId"/> <subselect> select employeeId, orgId from Employments group by orgId having startDate = max(startDate) </subselect> <many-to-one name="mostRecentEmployer" class="Organization" column="orgId"/> </join>]]>
ja_jp: さらに複雑な例では、<literal>Employee（従業員）</literal> と <literal>Organization（組織）</literal> 間の関連が <literal>Employment（雇用）</literal> テーブルで保持される場合を想像してください。 このテーブルには雇用データの履歴がすべて含まれます。 すると従業員の <emphasis>最も最近の</emphasis> 雇用者を表す関連 （最も最近の <literal>startDate</literal> を持つもの）は、このようにマッピングできます：

source: <![CDATA[<join> <key column="employeeId"/> <subselect> select employeeId, orgId from Employments group by orgId having startDate = max(startDate) </subselect> <many-to-one name="mostRecentEmployer" class="Organization" column="orgId"/> </join>]]>
fr_fr: Vous pouvez être créatif grace à ces possibilités, mais il est généralement plus pratique d'utiliser des requêtes HQL ou criteria dans ce genre de situation.

source: ROLES_OF_TRANSLATORS
fr_fr: <!--TRANS:ROLES_OF_TRANSLATORS-->
ja_jp: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
fr_fr: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
ja_jp: <!--TRANS:CREDIT_FOR_TRANSLATORS-->

source: Introduction
ja_jp: イントロダクション

source: You can get quite creative with this functionality, but it is usually more practical to handle these kinds of cases using HQL or a criteria query.
ja_jp: この機能は非常に強力です。 しかしこのような場合、普通はHQLやcriteriaクエリを使う方がより実践的です。
