Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/basic_mapping.po
Languages: fr_fr, ja_jp

source: <literal>persister</literal> (optional): Specifies a custom <literal>ClassPersister</literal>.
fr_fr: <literal>rowid</literal> (optionnel) : Hibernate peut utiliser des ROWID sur les bases de données qui utilisent ce mécanisme. Par exemple avec Oracle, Hibernate peut utiliser la colonne additionnelle <literal>rowid</literal> pour des mises à jour rapides si cette option vaut <literal>rowid</literal>. Un ROWID représente la localisation physique d'un tuple enregistré.
ja_jp: <literal>persister</literal> （オプション）：カスタム <literal>ClassPersister</literal> を指定します。

source: <literal>batch-size</literal> (optional, defaults to <literal>1</literal>) specify a "batch size" for fetching instances of this class by identifier.
fr_fr: <literal>subselect</literal> (optionnel) : Permet de mapper une entité immuable en lecture-seule sur un sous-select de base de données. Utile pour avoir une vue au lieu d'une table en base, mais à éviter. Voir plus bas pour plus d'information.
ja_jp: <literal>batch-size</literal> （オプション, デフォルトは <literal>1</literal> ）： 識別子でこのクラスのインスタンスを復元するときの「バッチサイズ」を指定します。

source: <literal>optimistic-lock</literal> (optional, defaults to <literal>version</literal>): Determines the optimistic locking strategy.
fr_fr: <literal>abstract</literal> (optionnel) : Utilisé pour marquer des superclasses abstraites dans des hiérarchies de <literal>&lt;union-subclass&gt;</literal>.
ja_jp: <literal>optimistic-lock</literal> （オプション,デフォルトは <literal>version</literal> ）： 楽観ロック戦略を決定します。

source: <literal>lazy</literal> (optional): Lazy fetching may be completely disabled by setting <literal>lazy="false"</literal>.
fr_fr: Il est tout à fait possible d'utiliser une interface comme nom de classe persistante. Vous devez alors déclarer les classes implémentant cette interface en utilisant l'élément <literal>&lt;subclass&gt;</literal>. Vous pouvez faire persister toute classe interne <emphasis>static</emphasis>. Vous devez alors spécifier le nom de la classe par la notation habituelle des classes internes c'est à dire <literal>eg.Foo$Bar</literal>.
ja_jp: <literal>lazy</literal> （オプション）： <literal>lazy="false"</literal> と設定することで、 遅延フェッチができなくなります。

source: <literal>entity-name</literal> (optional, defaults to the class name): Hibernate3 allows a class to be mapped multiple times (to different tables, potentially), and allows entity mappings that are represented by Maps or XML at the Java level. In these cases, you should provide an explicit arbitrary name for the entity. See <xref linkend="persistent-classes-dynamicmodels"/> and <xref linkend="xml"/> for more information.
fr_fr: Les classes immuables, <literal>mutable="false"</literal>, ne peuvent pas être modifiées ou supprimées par l'application. Cela permet à Hibernate de faire quelques optimisations mineures sur les performances.
ja_jp: <literal>entity-name</literal> （オプション、デフォルトはクラス名）： Hibernate3ではクラスが複数回マッピングでき（場合によっては違うテーブルに対しても）、 JavaレベルでMapやXMLで表現されるエンティティマッピングが可能です。 これらの場合、エンティティに対して任意の名前を、明示的に付けなくてはなりません。 詳しくは <xref linkend="persistent-classes-dynamicmodels"/> と <xref linkend="xml"/> を参照してください。

source: <literal>check</literal> (optional): A SQL expression used to generate a multi-row <emphasis>check</emphasis> constraint for automatic schema generation.
fr_fr: L'attribut optionnnel <literal>proxy</literal> permet les intialisations différées des instances persistantes de la classe. Hibernate retournera initialement des proxies CGLIB qui implémentent l'interface nommée. Le véritable objet persistant ne sera chargé que lorsque une méthode du proxy sera appelée. Voir plus bas le paragraphe abordant les proxies et le chargement différé (lazy initialization).
ja_jp: <literal>check</literal> （オプション）：自動的にスキーマを生成するために、 複数行の <emphasis>check</emphasis> 制約を生成するSQL式。

source: <literal>rowid</literal> (optional): Hibernate can use so called ROWIDs on databases which support. E.g. on Oracle, Hibernate can use the <literal>rowid</literal> extra column for fast updates if you set this option to <literal>rowid</literal>. A ROWID is an implementation detail and represents the physical location of a stored tuple.
fr_fr: Le polymorphisme <emphasis>implicite</emphasis> signifie que les instances de la classe seront retournées par une requête qui utilise les noms de la classe ou de chacune de ses superclasses ou encore des interfaces implémentées par cette classe ou ses superclasses. Les instances des classes filles seront retournées par une requête qui utilise le nom de la classe elle même. Le polymorphisme <emphasis>explicite</emphasis> signifie que les instances de la classe ne seront retournées que par une requête qui utilise explicitement son nom et que seules les instances des classes filles déclarées dans les éléments <literal>&lt;subclass&gt;</literal> ou <literal>&lt;joined-subclass&gt;</literal> seront retournées. Dans la majorités des cas la valeur par défaut, <literal>polymorphism="implicit"</literal>, est appropriée. Le polymorphisme explicite est utile lorsque deux classes différentes sont mappées à la même table (ceci permet d'écrire une classe "légère" qui ne contient qu'une partie des colonnes de la table - voir la partie design pattern du site communautaire).
ja_jp: <literal>rowid</literal> （オプション）：Hibernateは、それをサポートしているデータベースでROWIDと 呼ばれるものを使うことができます。 例えばOracleを使っているとき、このオプションに <literal>rowid</literal> を設定すれば、 Hiberanteはupdateを高速化するために <literal>rowid</literal> という特別なカラムを使うことができます。 ROWIDは詳細な実装であり、保存されたタプルの物理的な位置を表しています。

source: <literal>subselect</literal> (optional): Maps an immutable and read-only entity to a database subselect. Useful if you want to have a view instead of a base table, but don't. See below for more information.
fr_fr: L'attribut <literal>persister</literal> vous permet de customiser la stratégie utilisée pour la classe. Vous pouvez, par exemple, spécifier votre propre sous-classe de <literal>org.hibernate.persister.EntityPersister</literal> ou vous pourriez aussi créer une nouvelle implémentation de l'interface <literal>org.hibernate.persister.ClassPersister</literal> qui proposerait une persistance via, par exemple, des appels de procédures stockées, de la sérialisation vers des fichiers plats ou un annuaire LDAP. Voir <literal>org.hibernate.test.CustomPersister</literal> pour un exemple simple (d'une "persistance" vers une <literal>Hashtable</literal>).
ja_jp: <literal>subselect</literal> （オプション）：不変かつ読み取り専用であるエンティティを データベースの副問合せ（subselect）にマッピングします。 もし元のテーブルの代わりにビューを持ちたければ有用ですが、 そうでないのなら有用ではありません。より詳しい情報は下記を参照してください。

source: <literal>abstract</literal> (optional): Used to mark abstract superclasses in <literal>&lt;union-subclass&gt;</literal> hierarchies.
fr_fr: Notez que les paramètres <literal>dynamic-update</literal> et <literal>dynamic-insert</literal> ne sont pas hérités par les sous-classes et peuvent donc être spécifiés pour les éléments <literal>&lt;subclass&gt;</literal> ou <literal>&lt;joined-subclass&gt;</literal> Ces paramètres peuvent améliorer les performances dans certains cas, mais peuvent aussi les amoindrir. A utiliser en connaissance de causes.
ja_jp: <literal>abstract</literal> （オプション）： <literal>&lt;union-subclass&gt;</literal> 階層内の抽象スーパークラスにマークするために使います。

source: It is perfectly acceptable for the named persistent class to be an interface. You would then declare implementing classes of that interface using the <literal>&lt;subclass&gt;</literal> element. You may persist any <emphasis>static</emphasis> inner class. You should specify the class name using the standard form ie. <literal>eg.Foo$Bar</literal>.
fr_fr: L'utilisation de <literal>select-before-update</literal> va généralement faire baisser les performances. Ce paramètre est pratique pour prévenir l'appel inutile d'un trigger sur modification quand on réattache un graphe d'instances à une <literal>Session</literal>.
ja_jp: 永続クラスの名前にインターフェイスを指定してもまったく問題ありません。 そのときは <literal>&lt;subclass&gt;</literal> 要素を使って、 そのインターフェイスを実装するクラスを定義してください。 <emphasis>static</emphasis> な内部クラスでも永続化できます。 そのときは標準形式、例えば <literal>eg.Foo$Bar</literal> を使ってクラス名を指定してください。

source: Immutable classes, <literal>mutable="false"</literal>, may not be updated or deleted by the application. This allows Hibernate to make some minor performance optimizations.
fr_fr: Si vous utilisez le <literal>dynamic-update</literal>, les différentes stratégies de verrouillage optimiste (optimistic locking) sont les suivantes:
ja_jp: <literal>mutable="false"</literal> 指定をした不変クラスは、 アプリケーションによる更新や削除が出来ないことがあります。 これにより、Hibernateがパフォーマンスを少し改善します。

source: The optional <literal>proxy</literal> attribute enables lazy initialization of persistent instances of the class. Hibernate will initially return CGLIB proxies which implement the named interface. The actual persistent object will be loaded when a method of the proxy is invoked. See "Initializing collections and proxies" below.
fr_fr: <literal>version</literal> vérifie les colonnes version/timestamp
ja_jp: オプションの <literal>proxy</literal> 属性により、クラスの永続インスタンスの遅延初期化が可能になります。 Hibernateは最初に、指定したインターフェイスを実装したCGLIBプロキシを返します。 実際の永続オブジェクトはプロキシのメソッドを呼び出すときにロードします。 以下の「遅延初期化のためのプロキシ」を参照してください。

source: <emphasis>Implicit</emphasis> polymorphism means that instances of the class will be returned by a query that names any superclass or implemented interface or the class and that instances of any subclass of the class will be returned by a query that names the class itself. <emphasis>Explicit</emphasis> polymorphism means that class instances will be returned only by queries that explicitly name that class and that queries that name the class will return only instances of subclasses mapped inside this <literal>&lt;class&gt;</literal> declaration as a <literal>&lt;subclass&gt;</literal> or <literal>&lt;joined-subclass&gt;</literal>. For most purposes the default, <literal>polymorphism="implicit"</literal>, is appropriate. Explicit polymorphism is useful when two different classes are mapped to the same table (this allows a "lightweight" class that contains a subset of the table columns).
fr_fr: <literal>all</literal> vérifie toutes les colonnes
ja_jp: <emphasis>暗黙的</emphasis> ポリモーフィズムとは、次の二つを意味しています。 一つはクラスのインスタンスが、スーパークラスや実装したインターフェイス、またそのクラスを指定するクエリによって返されることで、 もう一つはそのクラスのサブクラスのインスタンスが、そのクラス自身を指定したクエリによって返されることです。 また、<emphasis>明示的</emphasis> ポリモーフィズムとは、次の二つを意味しています。 一つはクラスのインスタンスが、そのクラスを明示的に指定したクエリによってのみ返されることで、 もう一つはクラスを指定したクエリが、<literal>&lt;class&gt;</literal> 要素の中で <literal>&lt;subclass&gt;</literal> や <literal>&lt;joined-subclass&gt;</literal> とマッピングされているサブクラスのインスタンスだけを返すことです。 ほとんどの用途ではデフォルトの <literal>polymorphism="implicit"</literal> が適切です。 明示的なポリモーフィズムは、2つの違ったクラスが同じテーブルにマッピングされているときに有用です （これによってテーブルカラムのサブセットを含む、「軽量な」クラスが可能になります）。

source: The <literal>persister</literal> attribute lets you customize the persistence strategy used for the class. You may, for example, specify your own subclass of <literal>org.hibernate.persister.EntityPersister</literal> or you might even provide a completely new implementation of the interface <literal>org.hibernate.persister.ClassPersister</literal> that implements persistence via, for example, stored procedure calls, serialization to flat files or LDAP. See <literal>org.hibernate.test.CustomPersister</literal> for a simple example (of "persistence" to a <literal>Hashtable</literal>).
fr_fr: <literal>dirty</literal> vérifie les colonnes modifiées, permettant des updates concurrents
ja_jp: <literal>persister</literal> 属性を指定することで、クラスの永続化戦略をカスタマイズできます。 例えば <literal>org.hibernate.persister.EntityPersister</literal> 自身のサブクラスを指定したり、 また例えばストアドプロシージャコール、フラットファイルへシリアライズ、 LDAPなどを通した永続性を実装する <literal>org.hibernate.persister.ClassPersister</literal> インターフェイスの完全に新しい実装を提供できます。簡単な例として <literal>org.hibernate.test.CustomPersister</literal> を見てください（これは <literal>Hashtable</literal> の「永続化」です）。

source: Note that the <literal>dynamic-update</literal> and <literal>dynamic-insert</literal> settings are not inherited by subclasses and so may also be specified on the <literal>&lt;subclass&gt;</literal> or <literal>&lt;joined-subclass&gt;</literal> elements. These settings may increase performance in some cases, but might actually decrease performance in others. Use judiciously.
fr_fr: <literal>none</literal> pas de verrouillage optimiste
ja_jp: <literal>dynamic-update</literal> と <literal>dynamic-insert</literal> の設定はサブクラスに継承されません。 そのため <literal>&lt;subclass&gt;</literal> や <literal>&lt;joined-subclass&gt;</literal> 要素を指定することも出来ます。 これらの設定はパフォーマンスを向上させる事もありますが、落とすこともありますので、慎重に使用してください。

source: Use of <literal>select-before-update</literal> will usually decrease performance. It is very useful to prevent a database update trigger being called unnecessarily if you reattach a graph of detached instances to a <literal>Session</literal>.
fr_fr: Nous encourageons <emphasis>très</emphasis> fortement l'utilisation de colonnes de version/timestamp pour le verrouillage optimiste avec Hibernate. C'est la meilleure stratégie en regard des performances et la seule qui gère correctement les modifications sur les objets détachés (c'est à dire lorsqu'on utilise <literal>Session.merge()</literal>).
ja_jp: <literal>select-before-update</literal> の使用は通常パフォーマンスを落とします。 もし <literal>Session</literal> へ分離インスタンスのグラフを再追加するなら、 データベース更新のトリガを不必要に呼び出すのを避けるという点で、非常に有用です。

source: If you enable <literal>dynamic-update</literal>, you will have a choice of optimistic locking strategies:
fr_fr: Il n'y a pas de différence entre table et vue pour le mapping Hibernate, tant que c'est transparent au niveau base de données (remarquez que certaines BDD ne supportent pas les vues correctement, notamment pour les updates). Vous rencontrerez peut-être des cas où vous souhaitez utiliser une vue mais ne pouvez pas en créer sur votre BDD (par exemple à cause de schémas anciens et figés). Dans ces cas, vous pouvez mapper une entité immuable en lecture seule sur un sous-select SQL donné:
ja_jp: <literal>dynamic-update</literal> を有効にすれば、楽観ロック戦略を選ぶことになります。

source: <literal>version</literal> check the version/timestamp columns
fr_fr: <![CDATA[<class name="Summary"> <subselect> select item.name, max(bid.amount), count(*) from item join bid on bid.item_id = item.id group by item.name </subselect> <synchronize table="item"/> <synchronize table="bid"/> <id name="name"/> ... </class>]]>
ja_jp: <literal>version</literal> バージョン/タイムスタンプカラムをチェックします

source: <literal>all</literal> check all columns
fr_fr: Déclarez les tables à synchroniser avec cette entité pour assurer que le flush automatique se produise correctement, et pour que les requêtes sur l'entité dérivée ne renvoient pas des données périmées. Le litéral <literal>&lt;subselect&gt;</literal> est disponible comme attribut ou comme élément de mapping.
ja_jp: <literal>all</literal> すべてのカラムをチェックします。

source: <literal>dirty</literal> check the changed columns, allowing some concurrent updates
fr_fr: <title>id</title>
ja_jp: <literal>dirty</literal> 変更したカラムをチェックし、同時更新できるようにします。

source: <literal>none</literal> do not use optimistic locking
fr_fr: Les classes mappées <emphasis>doivent</emphasis> déclarer la clef primaire de la table en base de données. La plupart des classes auront aussi une propriété de type javabean présentant l'identifiant unique d'une instance. L'élément <literal>&lt;id&gt;</literal> sert à définir le mapping entre cette propriété et la clef primaire en base.
ja_jp: <literal>none</literal> 楽観ロックを使用しません

source: We <emphasis>very</emphasis> strongly recommend that you use version/timestamp columns for optimistic locking with Hibernate. This is the optimal strategy with respect to performance and is the only strategy that correctly handles modifications made to detached instances (ie. when <literal>Session.merge()</literal> is used).
fr_fr: <![CDATA[<id name="propertyName" type="typename" column="column_name" unsaved-value="null|any|none|undefined|id_value" access="field|property|ClassName"> <generator class="generatorClass"/> </id>]]>
ja_jp: Hibernateで楽観的ロック戦略を使うなら、バージョン/タイムスタンプカラムを使うことを <emphasis> 非常に</emphasis> 強くお勧めします。 楽観的ロックはパフォーマンスの観点からも最適であり、さらに分離インスタンスへの修正 （つまり <literal>Session.marge()</literal> が使われるとき） を正確に扱うことのできる唯一の戦略でもあります。

source: There is no difference between a view and a base table for a Hibernate mapping, as expected this is transparent at the database level (note that some DBMS don't support views properly, especially with updates). Sometimes you want to use a view, but can't create one in the database (ie. with a legacy schema). In this case, you can map an immutable and read-only entity to a given SQL subselect expression:
fr_fr: <literal>name</literal> (optionnel) : Nom de la propriété qui sert d'identifiant.
ja_jp: Hibernateのマッピングにとってビューと普通のテーブルの間に違いはなく、 データベースレベルでは透過的です （ただしビューを完全にはサポートしていないDBMSもあります。 特に、更新のあるビューに対してはそうです）。 ビューを使いたくても、データベースで作成できないことがあります （例えば、レガシースキーマの場合）。 この場合には、不変かつ読み取り専用のエンティティに与えられたSQLの副問合せ文をマップできます。

source: <![CDATA[<class name="Summary"> <subselect> select item.name, max(bid.amount), count(*) from item join bid on bid.item_id = item.id group by item.name </subselect> <synchronize table="item"/> <synchronize table="bid"/> <id name="name"/> ... </class>]]>
fr_fr: <literal>type</literal> (optionnel) : Nom indiquant le type Hibernate.

source: Declare the tables to synchronize this entity with, ensuring that auto-flush happens correctly, and that queries against the derived entity do not return stale data. The <literal>&lt;subselect&gt;</literal> is available as both as an attribute and a nested mapping element.
fr_fr: <literal>column</literal> (optionnel - le nom de la propriété est pris par défaut) : Nom de la clef primaire.
ja_jp: テーブルをこのエンティティと同期するように定義してください。 オートフラッシュが確実に起こるように、また導出エンティティに対するクエリが古いデータを 返さないようにするためです。 <literal>&lt;subselect&gt;</literal> は属性とネストしたマッピング属性のどちらでも利用できます。

source: <title>id</title>
fr_fr: <literal>unsaved-value</literal> (optionnel - par défaut une valeur "bien choisie") : Une valeur de la propriété d'identifiant qui indique que l'instance est nouvellement instanciée (non sauvegardée), et qui la distingue des instances <literal>transient</literal>s qui ont été sauvegardées ou chargées dans une session précédente.

source: Mapped classes <emphasis>must</emphasis> declare the primary key column of the database table. Most classes will also have a JavaBeans-style property holding the unique identifier of an instance. The <literal>&lt;id&gt;</literal> element defines the mapping from that property to the primary key column.
fr_fr: <literal>access</literal> (optionnel - par défaut <literal>property</literal>) : La stratégie que doit utiliser Hibernate pour accéder aux valeurs des propriétés.
ja_jp: マップされたクラスはデータベーステーブルの主キーカラムを定義 <emphasis>しなければなりません</emphasis> 。 ほとんどのクラスにはインスタンスのユニークな識別子を保持するJavaBeansスタイルのプロパティもあります。 <literal>&lt;id&gt;</literal> 要素は、そのプロパティから主キーカラムへのマッピングを定義します。

source: <![CDATA[<id name="propertyName" type="typename" column="column_name" unsaved-value="null|any|none|undefined|id_value" access="field|property|ClassName"> node="element-name|@attribute-name|element/@attribute|." <generator class="generatorClass"/> </id>]]>
fr_fr: Si l'attribut <literal>name</literal> est absent, Hibernate considère que la classe ne possède pas de propriété identifiant.

source: <literal>name</literal> (optional): The name of the identifier property.
fr_fr: L'attribut <literal>unsaved-value</literal> est important ! Si l'identifiant de votre classe n'a pas une valeur par défaut compatible avec le comportement standard de Java (zéro ou null), vous devez alors préciser la valeur par défaut.
ja_jp: <literal>name</literal>（オプション）：識別子プロパティの名前。

source: <literal>type</literal> (optional): A name that indicates the Hibernate type.
fr_fr: La déclaration alternative <literal>&lt;composite-id&gt;</literal> permet l'acccès aux données d'anciens systèmes qui utilisent des clefs composées. Son utilisation est fortement déconseillée pour d'autres cas.
ja_jp: <literal>type</literal>（オプション）：Hibernateの型を示す名前。

source: <literal>column</literal> (optional - defaults to the property name): The name of the primary key column.
fr_fr: Generator
ja_jp: <literal>column</literal>（オプション - デフォルトはプロパティ名）： 主キーカラムの名前。

source: <literal>unsaved-value</literal> (optional - defaults to a "sensible" value): An identifier property value that indicates that an instance is newly instantiated (unsaved), distinguishing it from detached instances that were saved or loaded in a previous session.
fr_fr: L'élément fils <literal>&lt;generator&gt;</literal> nomme une classe Java utilisée pour générer les identifiants uniques pour les instances des classes persistantes. Si des paramètres sont requis pour configurer ou initialiser l'instance du générateur, ils sont passés en utilisant l'élément <literal>&lt;param&gt;</literal>.
ja_jp: <literal>unsaved-value</literal>（オプション - デフォルトの値はsensible）： インスタンスが新しくインスタンス化された （セーブされていない）ことを示す、識別子プロパティの値。 以前のSessionでセーブまたはロードされた一時的インスタンスと区別するために 使います。

source: <literal>access</literal> (optional - defaults to <literal>property</literal>): The strategy Hibernate should use for accessing the property value.
fr_fr: <![CDATA[<id name="id" type="long" column="cat_id"> <generator class="org.hibernate.id.TableHiLoGenerator"> <param name="table">uid_table</param> <param name="column">next_hi_value_column</param> </generator> </id>]]>
ja_jp: <literal>access</literal>（オプション - デフォルトは <literal>property</literal> ）： プロパティの値へアクセスするためにHibernateが使う戦略です。

source: If the <literal>name</literal> attribute is missing, it is assumed that the class has no identifier property.
fr_fr: Tous les générateurs doivent implémenter l'interface <literal>org.hibernate.id.IdentifierGenerator</literal>. C'est une interface très simple ; certaines applications peuvent proposer leur propre implémentations spécialisées. Cependant, Hibernate propose une série d'implémentations intégrées. Il existe des noms raccourcis pour les générateurs intégrés :
ja_jp: <literal>name</literal> 属性がなければ、クラスには識別子プロパティがないものとみなされます。

source: The <literal>unsaved-value</literal> attribute is almost never needed in Hibernate3.
fr_fr: increment
ja_jp: <literal>unsaved-value</literal> 属性はHibernate3ではほとんどの場合、必要ではありません。

source: There is an alternative <literal>&lt;composite-id&gt;</literal> declaration to allow access to legacy data with composite keys. We strongly discourage its use for anything else.
fr_fr: Génère des identifiants de type <literal>long</literal>, <literal>short</literal> ou <literal>int</literal> qui ne sont uniques que si aucun autre processus n'insère de données dans la même table. <emphasis>Ne pas utiliser en environnement clusterisé.</emphasis>
ja_jp: 複合キーを持つレガシーデータにアクセスできるように、 <literal>&lt;composite-id&gt;</literal> という代替のマッピング定義があります。 しかし他の用途への使用は全くおすすめできません。

source: Generator
fr_fr: identity
ja_jp: ジェネレータ

source: The optional <literal>&lt;generator&gt;</literal> child element names a Java class used to generate unique identifiers for instances of the persistent class. If any parameters are required to configure or initialize the generator instance, they are passed using the <literal>&lt;param&gt;</literal> element.
fr_fr: Utilisation de la colonne identity de DB2, MySQL, MS SQL Server, Sybase et HypersonicSQL. L'identifiant renvoyé est de type <literal>long</literal>, <literal>short</literal> ou <literal>int</literal>.
ja_jp: オプションの <literal>&lt;generator&gt;</literal> 子要素は、 永続クラスのインスタンスのユニークな識別子を生成するために使う、Javaクラスを指定します。 ジェネレータインスタンスの設定、もしくは初期化にパラメータが必要であれば、<literal>&lt;param&gt;</literal> 要素を使って渡すことができます。

source: <![CDATA[<id name="id" type="long" column="cat_id"> <generator class="org.hibernate.id.TableHiLoGenerator"> <param name="table">uid_table</param> <param name="column">next_hi_value_column</param> </generator> </id>]]>
fr_fr: sequence
