Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/basic_mapping.po
Languages: fr_fr, ja_jp

source: <emphasis>typename</emphasis> could be:
fr_fr: L'attribut <literal>property-ref</literal> devrait être utilisé pour mapper seulement des données provenant d'un ancien système où les clefs étrangères font référence à une clef unique de la table associée et qui n'est pas la clef primaire. C'est un cas de mauvaise conception relationnelle. Par exemple, supposez que la classe <literal>Product</literal> a un numéro de série unique qui n'est pas la clef primaire. (L'attribut <literal>unique</literal> contrôle la génération DDL par Hibernate avec l'outil SchemaExport.)
ja_jp: <literal>not-found</literal> (オプション - デフォルトは <literal>exception</literal> ): 欠落した行を参照する外部キーをどのように扱うかを指定します。 <literal>ignore</literal> は欠落した行をnull関連として扱います。

source: The name of a Hibernate basic type (eg. <literal>integer, string, character, date, timestamp, float, binary, serializable, object, blob</literal>).
fr_fr: <![CDATA[<property name="serialNumber" unique="true" type="string" column="SERIAL_NUMBER"/>]]>
ja_jp: <literal>entity-name</literal> (オプション):関連したクラスのエンティティ名。

source: The name of a Java class with a default basic type (eg. <literal>int, float, char, java.lang.String, java.util.Date, java.lang.Integer, java.sql.Clob</literal>).
fr_fr: Ainsi le mapping pour <literal>OrderItem</literal> peut utiliser :
ja_jp: <literal>formula</literal> (オプション): <emphasis> 計算された</emphasis> 外部キーに対して値を定義するSQL式

source: The name of a serializable Java class.
fr_fr: <![CDATA[<many-to-one name="product" property-ref="serialNumber" column="PRODUCT_SERIAL_NUMBER"/>]]>
ja_jp: <literal>cascade</literal> 属性に <literal>none</literal> 以外の意味のある値をを設定すると、 関連オブジェクトへある操作が伝播することになります。 意味のある値とはHibernateの基本操作の名前のことで、 <literal>delete-orphan</literal> と <literal>all</literal> 、操作名をカンマで区切った組み合わせ （例えば <literal>cascade="persist,merge,evict"</literal> や <literal>cascade="all,delete-orphan"</literal>）、 またそれだけでなく <literal>persist, merge, delete, save-update, evict, replicate, lock, refresh</literal> のことを指します。 詳しい説明は <xref linkend="objectstate-transitive"/> を見てください。 値が一つの関連(many-to-oneとone-to-one関連)は、 単独での削除（orphan delete)をサポートしていないことに注意してください。

source: The class name of a custom type (eg. <literal>com.illflow.type.MyCustomType</literal>).
fr_fr: bien que ce ne soit certainement pas encouragé.
ja_jp: 典型的な <literal>many-to-one</literal> 宣言は次のようにシンプルです。：

source: If you do not specify a type, Hibernate will use reflection upon the named property to take a guess at the correct Hibernate type. Hibernate will try to interpret the name of the return class of the property getter using rules 2, 3, 4 in that order. However, this is not always enough. In certain cases you will still need the <literal>type</literal> attribute. (For example, to distinguish between <literal>Hibernate.DATE</literal> and <literal>Hibernate.TIMESTAMP</literal>, or to specify a custom type.)
fr_fr: Si la clef unique référencée comprend des propriétés multiples de l'entité associée, vous devez mapper ces propriétés à l'intérieur d'un élément <literal>&lt;properties&gt;</literal>.
ja_jp: <![CDATA[<many-to-one name="product" class="Product" column="PRODUCT_ID"/>]]>

source: The <literal>access</literal> attribute lets you control how Hibernate will access the property at runtime. By default, Hibernate will call the property get/set pair. If you specify <literal>access="field"</literal>, Hibernate will bypass the get/set pair and access the field directly, using reflection. You may specify your own strategy for property access by naming a class that implements the interface <literal>org.hibernate.property.PropertyAccessor</literal>.
fr_fr: one-to-one
ja_jp: <literal>property-ref</literal> 属性は、外部キーが関連付けられたテーブルの、主キーでない ユニークキーを参照しているレガシーデータをマップするためにだけ使うべきです。 これは醜いリレーショナルモデルです。 例えば <literal>Product</literal> クラスが、 主キーでないユニークなシリアルナンバーを持っていると仮定してみてください。 （ <literal>unique</literal> 属性はSchemaExportツールを使ったHibernateのDDL生成を制御します。）

source: An especially powerful feature are derived properties. These properties are by definition read-only, the property value is computed at load time. You declare the computation as a SQL expression, this translates to a <literal>SELECT</literal> clause subquery in the SQL query that loads an instance:
fr_fr: Une association one-to-one vers une autre classe persistante est déclarée avec l'élément <literal>one-to-one</literal>.
ja_jp: <![CDATA[<property name="serialNumber" unique="true" type="string" column="SERIAL_NUMBER"/>]]>

source: <![CDATA[ <property name="totalPrice" formula="( SELECT SUM (li.quantity*p.price) FROM LineItem li, Product p WHERE li.productId = p.productId AND li.customerId = customerId AND li.orderNumber = orderNumber )"/>]]>
fr_fr: <![CDATA[<one-to-one name="propertyName" class="ClassName" cascade="cascade_style" constrained="true|false" fetch="join|select" property-ref="propertyNameFromAssociatedClass" access="field|property|ClassName" formula="any SQL expression" entity-name="EntityName" />]]>
ja_jp: 以下のように <literal>OrderItem</literal> に対してマッピングを使えます：

source: Note that you can reference the entities own table by not declaring an alias on a particular column (<literal>customerId</literal> in the given example). Also note that you can use the nested <literal>&lt;formula&gt;</literal> mapping element if you don't like to use the attribute.
fr_fr: <literal>name</literal> : Le nom de la propriété.
ja_jp: <![CDATA[<many-to-one name="product" property-ref="serialNumber" column="PRODUCT_SERIAL_NUMBER"/>]]>

source: many-to-one
fr_fr: <literal>class</literal> (optionnel - par défaut du type de la propriété déterminé par réflexion) : Le nom de la classe associée.
ja_jp: しかし、これは決して推奨できません。

source: An ordinary association to another persistent class is declared using a <literal>many-to-one</literal> element. The relational model is a many-to-one association: a foreign key in one table is referencing the primary key column(s) of the target table.
fr_fr: <literal>cascade</literal> (optionnel) : Indique quelles opérations doivent être cascadées de l'objet père vers l'objet associé.
ja_jp: 参照したユニークキーが、関連するエンティティの多数のプロパティから構成される場合、 指定した <literal>&lt;properties&gt;</literal> 要素内で、参照するプロパティをマッピングするべきです。

source: <![CDATA[<many-to-one name="propertyName" column="column_name" class="ClassName" cascade="cascade_style" fetch="join|select" update="true|false" insert="true|false" property-ref="propertyNameFromAssociatedClass" access="field|property|ClassName" unique="true|false" not-null="true|false" optimistic-lock="true|false" lazy="proxy|no-proxy|false" not-found="ignore|exception" entity-name="EntityName" formula="arbitrary SQL expression" node="element-name|@attribute-name|element/@attribute|." embed-xml="true|false" index="index_name" unique_key="unique_key_id" foreign-key="foreign_key_name" />]]>
fr_fr: <literal>constrained</literal> (optionnel) : Indique qu'une contrainte de clef étrangère sur la clef primaire de la table mappée référence la table de la classe associée. Cette option affecte l'ordre dans lequel chaque <literal>save()</literal> et chaque <literal>delete()</literal> sont cascadés et détermine si l'association peut utiliser un proxy (aussi utilisé par l'outil d'export de schéma).
ja_jp: もし参照したユニークキーがコンポーネントのプロパティである場合は、プロパティのパスを指定できます。

source: <literal>name</literal>: The name of the property.
fr_fr: <literal>fetch</literal> (optionnel - par défaut à <literal>select</literal>) : Choisit entre récupération par jointure externe ou select séquentiel.
ja_jp: <![CDATA[<many-to-one name="owner" property-ref="identity.ssn" column="OWNER_SSN"/>]]>

source: <literal>column</literal> (optional): The name of the foreign key column. This may also be specified by nested <literal>&lt;column&gt;</literal> element(s).
fr_fr: <literal>property-ref</literal> (optionnel) : Le nom de la propriété de la classe associée qui est jointe à la clef primaire de cette classe. Si ce n'est pas spécifié, la clef primaire de la classe associée est utilisée.
ja_jp: one-to-one

source: <literal>class</literal> (optional - defaults to the property type determined by reflection): The name of the associated class.
fr_fr: <literal>access</literal> (optionnel - par défaut à <literal>property</literal>) : La stratégie à utiliser par Hibernate pour accéder à la valeur de la propriété.
ja_jp: 他の永続クラスへの一対一関連は、<literal>one-to-one</literal> 要素で定義します。

source: <literal>cascade</literal> (optional): Specifies which operations should be cascaded from the parent object to the associated object.
fr_fr: <literal>formula</literal> (optionnel) : Presque toutes les associations one-to-one pointent sur la clef primaire de l'entité propriétaire. Dans les rares cas différents, vous devez donner une ou plusieurs autres colonnes ou expression à joindre par une formule SQL (voir <literal>org.hibernate.test.onetooneformula</literal> pour un exemple).
ja_jp: <![CDATA[<one-to-one name="propertyName" class="ClassName" cascade="cascade_style" constrained="true|false" fetch="join|select" property-ref="propertyNameFromAssociatedClass" access="field|property|ClassName" formula="any SQL expression" lazy="proxy|no-proxy|false" entity-name="EntityName" node="element-name|@attribute-name|element/@attribute|." embed-xml="true|false" foreign-key="foreign_key_name" />]]>

source: <literal>fetch</literal> (optional - defaults to <literal>select</literal>): Chooses between outer-join fetching or sequential select fetching.
fr_fr: <literal>lazy</literal> (optionnel - par défaut <literal>proxy</literal>) : Par défaut, les associations simples sont soumise à proxy. <literal>lazy="no-proxy"</literal> spécifie que la propriété doit être chargée à la demande au premier accès à l'instance. (nécessite l'intrumentation du bytecode à la construction). <literal>lazy="false"</literal> indique que l'association sera toujours chargée agressivement. <emphasis>Notez que si <literal>constrained="false"</literal>, l'utilisation de proxy est impossible et Hibernate chargera automatiquement l'association !</emphasis>
ja_jp: <literal>name</literal>：プロパティ名。

source: <literal>update, insert</literal> (optional - defaults to <literal>true</literal>) specifies that the mapped columns should be included in SQL <literal>UPDATE</literal> and/or <literal>INSERT</literal> statements. Setting both to <literal>false</literal> allows a pure "derived" association whose value is initialized from some other property that maps to the same colum(s) or by a trigger or other application.
fr_fr: <literal>entity-name</literal> (optional) : The entity name of the associated class.
ja_jp: <literal>class</literal>（オプション - デフォルトはリフレクションにより決定されるプロパティの型）： 関連クラスの名前。

source: <literal>property-ref</literal>: (optional) The name of a property of the associated class that is joined to this foreign key. If not specified, the primary key of the associated class is used.
fr_fr: Il existe deux types d'associations one-to-one :
ja_jp: <literal>cascade</literal>（オプション）： 親オブジェクトから関連オブジェクトへ、どの操作をカスケードするかを指定します。

source: <literal>unique</literal> (optional): Enable the DDL generation of a unique constraint for the foreign-key column. Also, allow this to be the target of a <literal>property-ref</literal>. This makes the association multiplicity effectively one to one.
fr_fr: association par clef étrangère unique
ja_jp: <literal>fetch</literal>（オプション - デフォルトは <literal>select</literal> ）： 外部結合フェッチと順次選択フェッチ（sequential select fetch）のどちらかを選択します。

source: <literal>not-null</literal> (optional): Enable the DDL generation of a nullability constraint for the foreign key columns.
fr_fr: Les associations par clef primaire ne nécessitent pas une colonne supplémentaire en table ; si deux lignes sont liés par l'association alors les deux lignes de la table partagent la même valeur de clef primaire. Donc si vous voulez que deux objets soient liés par une association par clef primaire, vous devez faire en sorte qu'on leur assigne la même valeur d'identifiant !
ja_jp: <literal>property-ref</literal>（オプション）： このクラスの主キーに結合された関連クラスのプロパティ名。 指定されなければ、関連クラスの主キーが使われます。

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Specifies that updates to this property do or do not require acquisition of the optimistic lock. In other words, dertermines if a version increment should occur when this property is dirty.
fr_fr: Pour une association par clef primaire, ajoutez les mappings suivants à <literal>Employee</literal> et <literal>Person</literal>, respectivement.
ja_jp: <literal>access</literal>（オプション - デフォルトは <literal>property</literal> ）： プロパティの値へのアクセスにHibernateが使う戦略。

source: <literal>lazy</literal> (optional - defaults to <literal>proxy</literal>): By default, single point associations are proxied. <literal>lazy="no-proxy"</literal> specifies that the property should be fetched lazily when the instance variable is first accessed (requires build-time bytecode instrumentation). <literal>lazy="false"</literal> specifies that the association will always be eagerly fetched.
fr_fr: <![CDATA[<one-to-one name="person" class="Person"/>]]>
ja_jp: <literal>formula</literal> (オプション): ほとんどすべての一対一関連はオーナーのエンティティの主キーへとマッピングされます。 これ以外の稀な場合は、 他のカラムや、複数のカラム、SQL構文を使った結合するための式を指定できます。 （例は <literal>org.hibernate.test.onetooneformula</literal> を参照してください。）

source: <literal>not-found</literal> (optional - defaults to <literal>exception</literal>): Specifies how foreign keys that reference missing rows will be handled: <literal>ignore</literal> will treat a missing row as a null association.
fr_fr: <![CDATA[<one-to-one name="employee" class="Employee" constrained="true"/>]]>
ja_jp: <literal>lazy</literal> (オプション - デフォルトは <literal>proxy</literal> ): デフォルトでは、多重度１の関連がプロキシとなります。 <literal>lazy="no-proxy"</literal> は、インスタンス変数に最初にアクセスしたときに、 プロパティを遅延フェッチするよう指定します (ビルド時にバイトコード実装が必要になります)。 <literal>lazy="false"</literal> は関連を常に即時にフェッチするよう指定します。 <emphasis>もし <literal>constrained="false"</literal> ならば、 プロキシは使用不可能となり、関連を即時にフェッチすることに注意してください！</emphasis>

source: <literal>entity-name</literal> (optional): The entity name of the associated class.
fr_fr: Maintenant, vous devez faire en sorte que les clefs primaires des lignes liées dans les tables PERSON et EMPLOYEE sont égales. On utilise une stratégie Hibernate spéciale de génération d'identifiants appelée <literal>foreign</literal> :
ja_jp: <literal>entity-name</literal> (オプション):関連クラスのエンティティ名

source: <literal>formula</literal> (optional): an SQL expression that defines the value for a <emphasis>computed</emphasis> foreign key.
fr_fr: <![CDATA[<class name="person" table="PERSON"> <id name="id" column="PERSON_ID"> <generator class="foreign"> <param name="property">employee</param> </generator> </id> ... <one-to-one name="employee" class="Employee" constrained="true"/> </class>]]>
ja_jp: 一対一関連には2種類あります：

source: Setting a value of the <literal>cascade</literal> attribute to any meaningful value other than <literal>none</literal> will propagate certain operations to the associated object. The meaningful values are the names of Hibernate's basic operations, <literal>persist, merge, delete, save-update, evict, replicate, lock, refresh</literal>, as well as the special values <literal>delete-orphan</literal> and <literal>all</literal> and comma-separated combinations of operation names, for example, <literal>cascade="persist,merge,evict"</literal> or <literal>cascade="all,delete-orphan"</literal>. See <xref linkend="objectstate-transitive"/> for a full explanation. Note that single valued associations (many-to-one and one-to-one associations) do not support orphan delete.
fr_fr: Une instance fraîchement enregistrée de <literal>Person</literal> se voit alors assignée la même valeur de clef primaire que l'instance de <literal>Employee</literal> référencée par la propriété <literal>employee</literal> de cette <literal>Person</literal>.
ja_jp: 主キー関連

source: A typical <literal>many-to-one</literal> declaration looks as simple as this:
fr_fr: Alternativement, une clef étrangère avec contrainte d'unicité de <literal>Employee</literal> vers <literal>Person</literal> peut être indiquée ainsi :
ja_jp: ユニーク外部キー関連

source: <![CDATA[<many-to-one name="product" class="Product" column="PRODUCT_ID"/>]]>
fr_fr: <![CDATA[<many-to-one name="person" class="Person" column="PERSON_ID" unique="true"/>]]>
ja_jp: 主キー関連には、特別なテーブルカラムは必要ありません。 もし2つの行が関連により関係していれば、2つのテーブルは同じ主キーの値を共有します。 そのため2つのオブジェクトを主キー関連によって関連付けたいのであれば、 確実に同じ識別子の値を代入しなければなりません。

source: The <literal>property-ref</literal> attribute should only be used for mapping legacy data where a foreign key refers to a unique key of the associated table other than the primary key. This is an ugly relational model. For example, suppose the <literal>Product</literal> class had a unique serial number, that is not the primary key. (The <literal>unique</literal> attribute controls Hibernate's DDL generation with the SchemaExport tool.)
fr_fr: Et cette association peut être rendue bidirectionnelle en ajoutant ceci au mapping de <literal>Person</literal> :
ja_jp: 主キー関連を行うためには、以下のマッピングを <literal>Employee</literal> と <literal>Person</literal> のそれぞれに追加してください。

source: <![CDATA[<property name="serialNumber" unique="true" type="string" column="SERIAL_NUMBER"/>]]>
fr_fr: <![CDATA[<one-to-one name="employee" class="Employee" property-ref="person"/>]]>
ja_jp: <![CDATA[<one-to-one name="person" class="Person"/>]]>

source: Then the mapping for <literal>OrderItem</literal> might use:
fr_fr: natural-id
ja_jp: <![CDATA[<one-to-one name="employee" class="Employee" constrained="true"/>]]>

source: <![CDATA[<many-to-one name="product" property-ref="serialNumber" column="PRODUCT_SERIAL_NUMBER"/>]]>
fr_fr: <![CDATA[<natural-id mutable="true|false"/> <property ... /> <many-to-one ... /> ...... </natural-id>]]>
ja_jp: ここで、PERSONとEMPLOYEEテーブルの関係する行の主キーが同じであることを確実にしなければいけません。 ここでは、<literal>foreign</literal> という特殊なHibernate識別子生成戦略を使います：

source: This is certainly not encouraged, however.
fr_fr: Bien que nous recommandions l'utilisation de clé primaire générée, vous devriez toujours essayer d'identifier des clé métier (naturelles) pour toutes vos entités. Une clé naturelle est une propriété ou une combinaison de propriétés uniques et non nulles. Si elle est aussi immuable, c'est encore mieux. Mappez les propriétés de la clé naturelle dans l'élément <literal>&lt;natural-id&gt;</literal>. Hibernate générera la clé unique nécessaire et les contraintes de non-nullité, et votre mapping s'auto-documentera.
ja_jp: <![CDATA[<class name="person" table="PERSON"> <id name="id" column="PERSON_ID"> <generator class="foreign"> <param name="property">employee</param> </generator> </id> ... <one-to-one name="employee" class="Employee" constrained="true"/> </class>]]>

source: If the referenced unique key comprises multiple properties of the associated entity, you should map the referenced properties inside a named <literal>&lt;properties&gt;</literal> element.
fr_fr: Nous vous recommandons fortement d'implémenter <literal>equals()</literal> et <literal>hashCode()</literal> pour comparer les clés naturelles de l'entité.
ja_jp: <literal>Employee</literal> インスタンスが、<literal>Person</literal> の <literal>employee</literal> プロパティで参照されるように、 新しくセーブされた <literal>Person</literal> のインスタンスには同じ主キーの値が代入されます。 新しくセーブする <literal>Person</literal> インスタンスは、 その <literal>Person</literal> の <literal>employee</literal> プロパティが参照する <literal>Employee</literal> インスタンスとして同じ主キーが割り当てられます。

source: If the referenced unique key is the property of a component, you may specify a property path:
fr_fr: Ce mapping n'est pas destiné à être utilisé avec des entités qui ont des clés naturelles.
ja_jp: もう1つの方法として、<literal>Employee</literal> から <literal>Person</literal> への ユニーク制約を使った外部キー関連は以下のように表現されます：

source: <![CDATA[<many-to-one name="owner" property-ref="identity.ssn" column="OWNER_SSN"/>]]>
fr_fr: <literal>mutable</literal> (optionel, par défaut à <literal>false</literal>) : Par défaut, les identifiants naturels sont supposés être immuable (constants).
ja_jp: <![CDATA[<many-to-one name="person" class="Person" column="PERSON_ID" unique="true"/>]]>

source: one-to-one
fr_fr: component, dynamic-component
ja_jp: そしてこの関連は、 以下の記述を <literal>Person</literal> のマッピングに追加することで双方向にすることができます：

source: A one-to-one association to another persistent class is declared using a <literal>one-to-one</literal> element.
fr_fr: L'élément <literal>&lt;component&gt;</literal> mappe les propriétés d'un objet fils aux colonnes d'une classe parente. Les composants peuvent en retour déclarer leurs propres propriétés, composants ou collections. Voir "Components" plus bas.
ja_jp: <![CDATA[<one-to-one name="employee" class="Employee" property-ref="person"/>]]>

source: <![CDATA[<one-to-one name="propertyName" class="ClassName" cascade="cascade_style" constrained="true|false" fetch="join|select" property-ref="propertyNameFromAssociatedClass" access="field|property|ClassName" formula="any SQL expression" lazy="proxy|no-proxy|false" entity-name="EntityName" node="element-name|@attribute-name|element/@attribute|." embed-xml="true|false" foreign-key="foreign_key_name" />]]>
fr_fr: <![CDATA[<component name="propertyName" class="className" insert="true|false" update="true|false" access="field|property|ClassName" lazy="true|false" optimistic-lock="true|false" unique="true|false" > <property ...../> <many-to-one .... /> ........ </component>]]>
ja_jp: natural-id

source: <literal>cascade</literal> (optional) specifies which operations should be cascaded from the parent object to the associated object.
fr_fr: <literal>insert</literal> : Est ce que les colonnes mappées apparaissent dans les <literal>INSERT</literal>s ?
ja_jp: エンティティの自然キープロパティの比較には、 <literal>equals()</literal> と <literal>hashCode()</literal> の実装を強くお勧めします。

source: <literal>constrained</literal> (optional) specifies that a foreign key constraint on the primary key of the mapped table references the table of the associated class. This option affects the order in which <literal>save()</literal> and <literal>delete()</literal> are cascaded, and determines whether the association may be proxied (it is also used by the schema export tool).
fr_fr: <literal>update</literal>: Est ce que les colonnes mappées apparaissent dans les <literal>UPDATE</literal>s ?
ja_jp: このマッピングは自然主キーを使ったエンティティでの使用を意図していません。

source: <literal>property-ref</literal>: (optional) The name of a property of the associated class that is joined to the primary key of this class. If not specified, the primary key of the associated class is used.
fr_fr: <literal>lazy</literal> (optionnel - par défaut à <literal>false</literal>) : Indique que ce composant doit être chargé au premier accès à la variable d'instance (nécessite une instrumentation du bytecode au moment du build).
ja_jp: component, dynamic-component

source: <literal>formula</literal> (optional): Almost all one to one associations map to the primary key of the owning entity. In the rare case that this is not the case, you may specify a some other column, columns or expression to join on using an SQL formula. (See <literal>org.hibernate.test.onetooneformula</literal> for an example.)
fr_fr: <literal>unique</literal> (optionnel - par défaut à <literal>false</literal>) : Indique qu'une contrainte d'unicité existe sur toutes les colonnes mappées de ce composant.
ja_jp: <![CDATA[<component name="propertyName" class="className" insert="true|false" update="true|false" access="field|property|ClassName" lazy="true|false" optimistic-lock="true|false" unique="true|false" node="element-name|." > <property ...../> <many-to-one .... /> ........ </component>]]>
