Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/basic_mapping.po
Languages: fr_fr, ja_jp

source: All generators implement the interface <literal>org.hibernate.id.IdentifierGenerator</literal>. This is a very simple interface; some applications may choose to provide their own specialized implementations. However, Hibernate provides a range of built-in implementations. There are shortcut names for the built-in generators:
fr_fr: Utilisation des séquences dans DB2, PostgreSQL, Oracle, SAP DB, McKoi ou d'un générateur dans Interbase. L'identifiant renvoyé est de type <literal>long</literal>, <literal>short</literal> ou <literal>int</literal>
ja_jp: すべてのジェネレータは、インターフェイス <literal>org.hibernate.id.IdentifierGenerator</literal> を実装します。 これはとても単純なインターフェイスなので、特別な実装を独自に用意するアプリケーションもあるかもしれません。 しかしHibernateは組み込みの実装をいくつも用意しています。 組み込みのジェネレータには以下のショートカット名があります：

source: increment
fr_fr: hilo

source: generates identifiers of type <literal>long</literal>, <literal>short</literal> or <literal>int</literal> that are unique only when no other process is inserting data into the same table. <emphasis>Do not use in a cluster.</emphasis>
fr_fr: Utilise un algorithme hi/lo pour générer de façon efficace des identifiants de type <literal>long</literal>, <literal>short</literal> ou <literal>int</literal>, en prenant comme source de valeur "hi" une table et une colonne (par défaut <literal>hibernate_unique_key</literal> et <literal>next_hi</literal> respectivement). L'algorithme hi/lo génère des identifiants uniques pour une base de données particulière seulement.
ja_jp: <literal>long</literal> , <literal>short</literal> , <literal>int</literal> 型の識別子を生成します。 これらは他のプロセスが同じテーブルにデータを挿入しないときだけユニークです。 <emphasis>クラスタ内では使わないでください</emphasis> 。

source: identity
fr_fr: seqhilo

source: supports identity columns in DB2, MySQL, MS SQL Server, Sybase and HypersonicSQL. The returned identifier is of type <literal>long</literal>, <literal>short</literal> or <literal>int</literal>.
fr_fr: Utilise un algorithme hi/lo pour générer efficacement des identifiants de type <literal>long</literal>, <literal>short</literal> ou <literal>int</literal>, étant donné un nom de séquence en base.
ja_jp: DB2, MySQL, MS SQL Server, Sybase, HypersonicSQLの識別子カラムを サポートします。 返される識別子の型は <literal>long</literal> , <literal>short</literal> , <literal>int</literal> のいずれかです。

source: sequence
fr_fr: uuid

source: uses a sequence in DB2, PostgreSQL, Oracle, SAP DB, McKoi or a generator in Interbase. The returned identifier is of type <literal>long</literal>, <literal>short</literal> or <literal>int</literal>
fr_fr: Utilise un algorithme de type UUID 128 bits pour générer des identifiants de type string, unique au sein d'un réseau (l'adresse IP est utilisée). Le UUID en codé en une chaîne de nombre héxadécimaux de longueur 32.
ja_jp: DB2, PostgreSQL, Oracle, SAP DB, McKoiのシーケンスや、Interbaseのジェネレータを使用します。 返される識別子の型は <literal>long</literal> , <literal>short</literal> , <literal>int</literal> のいずれかです。

source: hilo
fr_fr: guid

source: uses a hi/lo algorithm to efficiently generate identifiers of type <literal>long</literal>, <literal>short</literal> or <literal>int</literal>, given a table and column (by default <literal>hibernate_unique_key</literal> and <literal>next_hi</literal> respectively) as a source of hi values. The hi/lo algorithm generates identifiers that are unique only for a particular database.
fr_fr: Utilise une chaîne GUID générée par la base pour MS SQL Server et MySQL.
ja_jp: <literal>long</literal> , <literal>short</literal> , <literal>int</literal> 型の識別子を効率的に生成するhi/loアルゴリズムを使います。 hi値のソースとして、テーブルとカラムを与えます(デフォルトではそれぞれ <literal>hibernate_unique_key</literal> と <literal>next_hi</literal> )。 hi/loアルゴリズムは特定のデータベースに対してのみユニークな識別子を生成します。

source: seqhilo
fr_fr: native

source: uses a hi/lo algorithm to efficiently generate identifiers of type <literal>long</literal>, <literal>short</literal> or <literal>int</literal>, given a named database sequence.
fr_fr: Choisit <literal>identity</literal>, <literal>sequence</literal> ou <literal>hilo</literal> selon les possibilités offertes par la base de données sous-jacente.
ja_jp: <literal>long</literal> , <literal>short</literal> , <literal>int</literal> 型の識別子を効率的に生成するhi/loアルゴリズムを使います。 指定されたデータベースシーケンスを与えます。

source: uuid
fr_fr: assigned

source: uses a 128-bit UUID algorithm to generate identifiers of type string, unique within a network (the IP address is used). The UUID is encoded as a string of hexadecimal digits of length 32.
fr_fr: Laisse l'application affecter un identifiant à l'objet avant que la métode <literal>save()</literal> soit appelée. Il s'agit de la stratégie par défaut si aucun <literal>&lt;generator&gt;</literal> n'est spécifié.
ja_jp: (IPアドレスが使用される)ネットワーク内でユニークな文字列型の識別子を生成するために、 128ビットのUUIDアルゴリズムを使用します。UUIDは長さ32の16進数字の文字列としてエンコードされます。

source: guid
fr_fr: select

source: uses a database-generated GUID string on MS SQL Server and MySQL.
fr_fr: Récupère une clef primaire assignée par un trigger en sélectionnant la ligne par une clef unique quelconque.
ja_jp: MS SQLサーバとMySQLでデータベースが生成するGUID文字列を使用します。

source: native
fr_fr: foreign

source: picks <literal>identity</literal>, <literal>sequence</literal> or <literal>hilo</literal> depending upon the capabilities of the underlying database.
fr_fr: Utilise l'identifiant d'un objet associé. Habituellement utilisé en conjonction avec une association <literal>&lt;one-to-one&gt;</literal> sur la clef primaire.
ja_jp: 使用するデータベースの性能により <literal>identity</literal> , <literal>sequence</literal> , <literal>hilo</literal> のいずれかが選ばれます。

source: assigned
fr_fr: algorithme Hi/lo

source: lets the application to assign an identifier to the object before <literal>save()</literal> is called. This is the default strategy if no <literal>&lt;generator&gt;</literal> element is specified.
fr_fr: Les générateurs <literal>hilo</literal> et <literal>seqhilo</literal> proposent deux implémentations alternatives de l'algorithme hi/lo, une approche largement utilisée pour générer des identifiants. La première implémentation nécessite une table "spéciale" en base pour héberger la prochaine valeur "hi" disponible. La seconde utilise une séquence de type Oracle (quand la base sous-jacente le propose).
ja_jp: <literal>save()</literal> が呼ばれる前に、 アプリケーションがオブジェクトに識別子を代入できるようにします。 <literal>&lt;generator&gt;</literal> が指定されていなければ、これがデフォルトの戦略になります。

source: select
fr_fr: <![CDATA[<id name="id" type="long" column="cat_id"> <generator class="hilo"> <param name="table">hi_value</param> <param name="column">next_value</param> <param name="max_lo">100</param> </generator> </id>]]>

source: retrieves a primary key assigned by a database trigger by selecting the row by some unique key and retrieving the primary key value.
fr_fr: <![CDATA[<id name="id" type="long" column="cat_id"> <generator class="seqhilo"> <param name="sequence">hi_value</param> <param name="max_lo">100</param> </generator> </id>]]>
ja_jp: あるユニークキーによる行の選択と主キーの値の復元により、 データベーストリガが割り当てた主キーを取得します。

source: foreign
fr_fr: Malheureusement, vous ne pouvez pas utilisez <literal>hilo</literal> quand vous apportez votre propre <literal>Connection</literal> à Hibernate. Quand Hibernate utilise une datasource du serveur d'application pour obtenir des connexions inscrites avec JTA, vous devez correctement configurer <literal>hibernate.transaction.manager_lookup_class</literal>.

source: uses the identifier of another associated object. Usually used in conjunction with a <literal>&lt;one-to-one&gt;</literal> primary key association.
fr_fr: UUID algorithm
ja_jp: 他の関連オブジェクトの識別子を使います。 普通は、<literal>&lt;one-to-one&gt;</literal> 主キー関連と組み合わせて使います。

source: sequence-identity
fr_fr: Le contenu du UUID est : adresse IP, date de démarrage de la JVM (précis au quart de seconde), l'heure système et un compteur (unique au sein de la JVM). Il n'est pas possible d'obtenir l'adresse MAC ou une adresse mémoire à partir de Java, c'est donc le mieux que l'on puisse faire sans utiliser JNI.
ja_jp: Hi/lo アルゴリズム

source: a specialized sequence generation strategy which utilizes a database sequence for the actual value generation, but combines this with JDBC3 getGeneratedKeys to actually return the generated identifier value as part of the insert statement execution. This strategy is only known to be supported on Oracle 10g drivers targetted for JDK 1.4. Note comments on these insert statements are disabled due to a bug in the Oracle drivers.
fr_fr: Colonnes identifiantes et séquences
ja_jp: <literal>hilo</literal> と <literal>seqhilo</literal> ジェネレータは、 識別子生成の代表的なアプローチであるhi/loアルゴリズムの2つの代替実装を提供します。 1番目の実装は、次回に利用される"hi"値を保持する「特別な」データベーステーブルを 必要とします。 2番目の実装は、Oracleスタイルのシーケンスを使います（サポートされている場合）。

source: Hi/lo algorithm
fr_fr: Pour les bases qui implémentent les colonnes "identité" (DB2, MySQL, Sybase, MS SQL), vous pouvez utiliser la génération de clef par <literal>identity</literal>. Pour les bases qui implémentent les séquences (DB2, Oracle, PostgreSQL, Interbase, McKoi, SAP DB) vous pouvez utiliser la génération de clef par <literal>sequence</literal>. Ces deux méthodes nécessitent deux requêtes SQL pour insérer un objet.
ja_jp: <![CDATA[<id name="id" type="long" column="cat_id"> <generator class="hilo"> <param name="table">hi_value</param> <param name="column">next_value</param> <param name="max_lo">100</param> </generator> </id>]]>

source: The <literal>hilo</literal> and <literal>seqhilo</literal> generators provide two alternate implementations of the hi/lo algorithm, a favorite approach to identifier generation. The first implementation requires a "special" database table to hold the next available "hi" value. The second uses an Oracle-style sequence (where supported).
fr_fr: <![CDATA[<id name="id" type="long" column="person_id"> <generator class="sequence"> <param name="sequence">person_id_sequence</param> </generator> </id>]]>
ja_jp: <![CDATA[<id name="id" type="long" column="cat_id"> <generator class="seqhilo"> <param name="sequence">hi_value</param> <param name="max_lo">100</param> </generator> </id>]]>

source: <![CDATA[<id name="id" type="long" column="cat_id"> <generator class="hilo"> <param name="table">hi_value</param> <param name="column">next_value</param> <param name="max_lo">100</param> </generator> </id>]]>
fr_fr: <![CDATA[<id name="id" type="long" column="person_id" unsaved-value="0"> <generator class="identity"/> </id>]]>
ja_jp: 残念ながらHibernateへの独自の <literal>Connection</literal> を提供するときには、<literal>hilo</literal> を使えません。 HibernateがJTAでリストされている接続を取得するためにアプリケーションサーバーのデータソースを使用しているときには、 <literal>hibernate.transaction.manager_lookup_class</literal> を適切に設定しなければなりません。

source: <![CDATA[<id name="id" type="long" column="cat_id"> <generator class="seqhilo"> <param name="sequence">hi_value</param> <param name="max_lo">100</param> </generator> </id>]]>
fr_fr: Pour le développement multi-plateformes, la stratégie <literal>native</literal> choisira entre les méthodes <literal>identity</literal>, <literal>sequence</literal> et <literal>hilo</literal>, selon les possibilités offertes par la base sous-jacente.
ja_jp: UUID アルゴリズム

source: Unfortunately, you can't use <literal>hilo</literal> when supplying your own <literal>Connection</literal> to Hibernate. When Hibernate is using an application server datasource to obtain connections enlisted with JTA, you must properly configure the <literal>hibernate.transaction.manager_lookup_class</literal>.
fr_fr: Identifiants assignés
ja_jp: UUIDには以下のものが含まれます： IPアドレス、JVMのスタートアップタイム（4分の1秒の正確さ）、 システム時間、（JVMに対してユニークな）カウンタ値。 JavaコードからMACアドレスやメモリアドレスを取得することはできないので、 JNIが使えないときの最良の方法です。

source: UUID algorithm
fr_fr: Si vous souhaitez que l'application assigne des identifiants (par opposition à la génération par Hibernate), vous pouvez utiliser le générateur <literal>assigned</literal>. Ce générateur spécial utilisera une valeur d'identifiant déjà utilisé par la propriété identifiant l'objet. Ce générateur est utilisé quand la clef primaire est une clef naturelle plutôt qu'une clef secondaire. C'est le comportement par défaut si vous ne précisez pas d'élément <literal>&lt;generator&gt;</literal>.
ja_jp: 識別子カラムとシーケンス

source: The UUID contains: IP address, startup time of the JVM (accurate to a quarter second), system time and a counter value (unique within the JVM). It's not possible to obtain a MAC address or memory address from Java code, so this is the best we can do without using JNI.
fr_fr: Choisir le générateur <literal>assigned</literal> fait utiliser <literal>unsaved-value="undefined"</literal> par Hibernate, le forçant à interroger la base pour déterminer si l'instance est transiente ou détachée, à moins d'utiliser une propriété version ou timestamp, ou alors de définir <literal>Interceptor.isUnsaved()</literal>.
ja_jp: 識別子カラムをサポートしているデータベース（DB2, MySQL, Sybase, MS SQL）では、 <literal>identity</literal> キー生成を使えます。 シーケンスをサポートするデータベース（DB2, Oracle, PostgreSQL, Interbase, McKoi, SAP DB）では、 <literal>sequence</literal> スタイルのキー生成を使えます。 どちらの戦略も、新しいオブジェクトを挿入するために、SQLクエリを2つ必要とします。

source: Identity columns and sequences
fr_fr: Clefs primaires assignées par trigger
ja_jp: <![CDATA[<id name="id" type="long" column="person_id"> <generator class="sequence"> <param name="sequence">person_id_sequence</param> </generator> </id>]]>

source: For databases which support identity columns (DB2, MySQL, Sybase, MS SQL), you may use <literal>identity</literal> key generation. For databases that support sequences (DB2, Oracle, PostgreSQL, Interbase, McKoi, SAP DB) you may use <literal>sequence</literal> style key generation. Both these strategies require two SQL queries to insert a new object.
fr_fr: Pour les schémas de base hérités d'anciens systèmes uniquement (Hibernate ne génère pas de DDL avec des triggers)
ja_jp: <![CDATA[<id name="id" type="long" column="person_id" unsaved-value="0"> <generator class="identity"/> </id>]]>

source: <![CDATA[<id name="id" type="long" column="person_id"> <generator class="sequence"> <param name="sequence">person_id_sequence</param> </generator> </id>]]>
fr_fr: <![CDATA[<id name="id" type="long" column="person_id"> <generator class="select"> <param name="key">socialSecurityNumber</param> </generator> </id>]]>
ja_jp: クロスプラットフォームの開発では、<literal>native</literal> 戦略は <literal>identity</literal> , <literal>sequence</literal> , <literal>hilo</literal> 戦略の中から1つを選択しますが、 これは使用しているデータベースの能力に依存します。

source: <![CDATA[<id name="id" type="long" column="person_id" unsaved-value="0"> <generator class="identity"/> </id>]]>
fr_fr: Dans l'exemple ci-dessus, <literal>socialSecurityNumber</literal> a une valeur unique définie par la classe en tant que clef naturelle et <literal>person_id</literal> est une clef secondaire dont la valeur est générée par trigger.
ja_jp: 識別子の割り当て

source: For cross-platform development, the <literal>native</literal> strategy will choose from the <literal>identity</literal>, <literal>sequence</literal> and <literal>hilo</literal> strategies, dependant upon the capabilities of the underlying database.
fr_fr: composite-id
ja_jp: アプリケーションに識別子を割り当てさせたいのであれば(Hibernateが生成するものではなく）、 <literal>assigned</literal> ジェネレータを使うことができます。 この特別なジェネレータは、すでにオブジェクトの識別子プロパティに代入された値を 識別子に使います。このジェネレータは主キーが代理キーの代わりに自然キーである場合に使用します。 <literal>&lt;generator&gt;</literal> 要素を指定しない場合のデフォルトの動作になります。

source: Assigned identifiers
fr_fr: <![CDATA[<composite-id name="propertyName" class="ClassName" mapped="true|false" access="field|property|ClassName"> node="element-name|." <key-property name="propertyName" type="typename" column="column_name"/> <key-many-to-one name="propertyName class="ClassName" column="column_name"/> ...... </composite-id>]]>
ja_jp: <literal>assigned</literal> ジェネレータを選択すると、 Hibernateは <literal>unsaved-value="undefined"</literal> を使用します。 そして、バージョンやタイムスタンプのプロパティがない場合や <literal>Interceptor.isUnsaved()</literal> を定義しなかった場合には、インスタンスが一時的(transient)なものであるのか、 またはセッションから分離(detached)したものかどうかを決めるために、データベースを調べます。

source: If you want the application to assign identifiers (as opposed to having Hibernate generate them), you may use the <literal>assigned</literal> generator. This special generator will use the identifier value already assigned to the object's identifier property. This generator is used when the primary key is a natural key instead of a surrogate key. This is the default behavior if you do no specify a <literal>&lt;generator&gt;</literal> element.
fr_fr: Pour une table avec clef composée, vous pouvez mapper plusieurs attributs de la classe comme propriétés identifiantes. L'élement <literal>&lt;composite-id&gt;</literal> accepte les mappings de propriétés <literal>&lt;key-property&gt;</literal> et les mappings <literal>&lt;key-many-to-one&gt;</literal> comme fils.
ja_jp: トリガにより割り当てられた主キー

source: Choosing the <literal>assigned</literal> generator makes Hibernate use <literal>unsaved-value="undefined"</literal>, forcing Hibernate to go to the database to determine if an instance is transient or detached, unless there is a version or timestamp property, or you define <literal>Interceptor.isUnsaved()</literal>.
fr_fr: <![CDATA[<composite-id> <key-property name="medicareNumber"/> <key-property name="dependent"/> </composite-id>]]>
ja_jp: レガシースキーマのためにのみ指定します(Hibernateはトリガを使ってDDLを生成しません)。

source: Primary keys assigned by triggers
fr_fr: Vos classes persistantes <emphasis>doivent</emphasis> surcharger les méthodes <literal>equals()</literal> et <literal>hashCode()</literal> pour implémenter l'égalité d'identifiant composé. Elles doivent aussi implenter l'interface <literal>Serializable</literal>.
ja_jp: <![CDATA[<id name="id" type="long" column="person_id"> <generator class="select"> <param name="key">socialSecurityNumber</param> </generator> </id>]]>

source: For legacy schemas only (Hibernate does not generate DDL with triggers).
fr_fr: Malheureusement cette approche sur les identifiants composés signifie qu'un objet persistant est son propre identifiant. Il n'y a pas d'autre moyen pratique de manipuler l'objet que par l'objet lui-même. Vous devez instancier une instance de la classe persistante elle-même et peupler ses attributs identifiants avant de pouvoir appeler la méthode <literal>load()</literal> pour charger son état persistant associé à une clef composée. Nous appelons cette approche "identifiant composé <emphasis>embarqué</emphasis>" et ne la recommandons pas pour des applications complexes.
ja_jp: 上の例の中で、クラスで自然キーとして定義された <literal>socialSecurityNumber</literal> という名前のユニークな値のプロパティと、 値がトリガにより生成される <literal>person_id</literal> という名前の代理キーがあります。

source: <![CDATA[<id name="id" type="long" column="person_id"> <generator class="select"> <param name="key">socialSecurityNumber</param> </generator> </id>]]>
fr_fr: Une seconde approche, appelée identifiant composé <emphasis>mappé</emphasis>, consiste à encapsuler les propriétés identifiantes (celles contenues dans <literal>&lt;composite-id&gt;</literal>) dans une classe particulière.
ja_jp: composite-id

source: In the above example, there is a unique valued property named <literal>socialSecurityNumber</literal> defined by the class, as a natural key, and a surrogate key named <literal>person_id</literal> whose value is generated by a trigger.
fr_fr: <![CDATA[<composite-id class="MedicareId" mapped="true"> <key-property name="medicareNumber"/> <key-property name="dependent"/> </composite-id>]]>
ja_jp: <![CDATA[<composite-id name="propertyName" class="ClassName" mapped="true|false" access="field|property|ClassName"> node="element-name|." <key-property name="propertyName" type="typename" column="column_name"/> <key-many-to-one name="propertyName class="ClassName" column="column_name"/> ...... </composite-id>]]>

source: Enhanced identifier generators
fr_fr: Dans cet exemple, la classe d'identifiant composée,<literal>MedicareId</literal> et la classe mappée elle-même, possèdent les propriétés <literal>medicareNumber</literal> et <literal>dependent</literal>. La classe identifiante doit redéfinir <literal>equals()</literal> et <literal>hashCode()</literal> et implémenter <literal>Serializable</literal>. Le désavantage de cette approche est la duplication du code.
ja_jp: 複合キーのあるテーブルに対し、 識別子プロパティとしてクラスの複数のプロパティをマッピングすることができます。 <literal>&lt;composite-id&gt;</literal> 要素は、子要素として <literal>&lt;key-property&gt;</literal> プロパティマッピングと <literal>&lt;key-many-to-one&gt;</literal> マッピングを受け入れます。

source: Starting with release 3.2.3, there are 2 new generators which represent a re-thinking of 2 different aspects of identifier generation. The first aspect is database portability; the second is optimization (not having to query the database for every request for a new identifier value). These two new generators are intended to take the place of some of the named generators described above (starting in 3.3.x); however, they are included in the current releases and can be referenced by FQN.
fr_fr: Les attributs suivants servent à configurer un identifiant composé mappé :
ja_jp: <![CDATA[<composite-id> <key-property name="medicareNumber"/> <key-property name="dependent"/> </composite-id>]]>

source: The first of these new generators is <literal>org.hibernate.id.enhanced.SequenceStyleGenerator</literal> which is intended firstly as a replacement for the <literal>sequence</literal> generator and secondly as a better portability generator than <literal>native</literal> (because <literal>native</literal> (generally) chooses between <literal>identity</literal> and <literal>sequence</literal> which have largely different semantics which can cause subtle isssues in applications eyeing portability). <literal>org.hibernate.id.enhanced.SequenceStyleGenerator</literal> however achieves portability in a different manner. It chooses between using a table or a sequence in the database to store its incrementing values depending on the capabilities of the dialect being used. The difference between this and <literal>native</literal> is that table-based and sequence-based storage have the same exact semantic (in fact sequences are exactly what Hibernate tries to emmulate with its table-based generators). This generator has a number of configuration parameters:
fr_fr: <literal>mapped</literal> (optionnel, défaut à <literal>false</literal>) : indique qu'un identifiant composé mappé est utilisé, et que les propriétés contenues font référence aux deux classes (celle mappée et la classe identifiante).
ja_jp: 複合識別子の等価性を実装するためには、永続クラスが <literal>equals()</literal> と <literal>hashCode()</literal> をオーバーライド <emphasis>しなければなりません</emphasis> 。 また <literal>Serializable</literal> も実装しなければいけません。

source: <literal>sequence_name</literal> (optional, defaults to <literal>hibernate_sequence</literal>): The name of the sequence (or table) to be used.
fr_fr: <literal>class</literal> (optionnel, mais requis pour un identifiant composé mappé) : La classe composant utilisée comme identifiant composé.
ja_jp: 残念ながら複合識別子のためのこの方法は、 永続オブジェクトが自身の識別子であることを意味しています。 オブジェクト自身を識別子とする以上の便利な「扱い方」はありません。 複合キーに関連した永続状態を <literal>load()</literal> 出来るようになる前に、 永続クラス自身をインスタンス化し、識別子プロパティを設定しなければなりません。 <emphasis> 組み込みの</emphasis> 複合識別子と呼ばれるこのアプローチは、 本格的なアプリケーションには向いていません。

source: <literal>initial_value</literal> (optional, defaults to <literal>1</literal>): The initial value to be retrieved from the sequence/table. In sequence creation terms, this is analogous to the clause typical named "STARTS WITH".
fr_fr: Nous décrirons une troisième approche beaucoup plus efficace ou l'identifiant composé est implémenté comme une classe composant dans <xref linkend="components-compositeid"/>. Les attributs décrits ci dessous, ne s'appliquent que pour cette dernière approche :
ja_jp: 2つ目の方法は <emphasis> マップされた</emphasis> 複合識別子と呼ばれるもので、 <literal>&lt;composite-id&gt;</literal>エレメント内で指定した識別プロパティが 永続クラスと分離した識別子クラスの両方に重複して存在します。
