Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/basic_mapping.po
Languages: fr_fr, ja_jp

source: <![CDATA[<many-to-one name="homeAddress" class="Address" insert="false" update="false"> <column name="person_id" not-null="true" length="10"/> <formula>'MAILING'</formula> </many-to-one>]]>
fr_fr: string
ja_jp: Java型のシステム(もしくは開発者が定義したエンティティと値型)を SQL/データベース型のシステムにマッピングすることは難しいです。 Hibernateは２つのシステムの架け橋を提供します。 エンティティに対しては <literal>&lt;class&gt;</literal> や <literal>&lt;subclass&gt;</literal> などを使用します。 値型に対しては <literal>&lt;property&gt;</literal> や <literal>&lt;component&gt;</literal> などを、通常 <literal>type</literal> とともに使います。 この属性の値はHibernateの <emphasis>マッピング型</emphasis> の名前です。 Hibernateは(標準JDKの値型に対して)多くの自由なマッピングを提供します。 後で見るように、自身のマッピング型を記述し、同様にカスタムの変換戦略を実装することができます。

source: import
fr_fr: Mapping de type de <literal>java.lang.String</literal> vers <literal>VARCHAR</literal> (ou le <literal>VARCHAR2</literal> Oracle).
ja_jp: コレクションを除く組み込みのHibernateの型はすべて、nullセマンティクスをサポートします。

source: Suppose your application has two persistent classes with the same name, and you don't want to specify the fully qualified (package) name in Hibernate queries. Classes may be "imported" explicitly, rather than relying upon <literal>auto-import="true"</literal>. You may even import classes and interfaces that are not explicitly mapped.
fr_fr: date, time, timestamp
ja_jp: 基本的な型

source: <![CDATA[<import class="java.lang.Object" rename="Universe"/>]]>
fr_fr: Mappings de type pour <literal>java.util.Date</literal> et ses sous-classes vers les types SQL <literal>DATE</literal>, <literal>TIME</literal> et <literal>TIMESTAMP</literal> (ou équivalent).
ja_jp: 組み込みの <emphasis>基本的なマッピング型</emphasis> は大まかに以下のように分けられます。

source: <![CDATA[<import class="ClassName" rename="ShortName" />]]>
fr_fr: calendar, calendar_date
ja_jp: integer, long, short, float, double, character, byte, boolean, yes_no, true_false

source: <literal>class</literal>: The fully qualified class name of of any Java class.
fr_fr: Mappings de type pour <literal>java.util.Calendar</literal> vers les types SQL <literal>TIMESTAMP</literal> et <literal>DATE</literal> (ou équivalent).
ja_jp: Javaのプリミティブやラッパークラスから適切な（ベンダー固有の） SQLカラム型への型マッピング。 <literal>boolean, yes_no</literal> と <literal>true_false</literal> は、 すべてJavaの <literal>boolean</literal> または <literal>java.lang.Boolean</literal> の代替エンコードです。

source: <literal>rename</literal> (optional - defaults to the unqualified class name): A name that may be used in the query language.
fr_fr: big_decimal, big_integer
ja_jp: string

source: <title>any</title>
fr_fr: Mappings de type pour <literal>java.math.BigDecimal</literal> et <literal>java.math.BigInteger</literal> vers <literal>NUMERIC</literal> (ou le <literal>NUMBER</literal> Oracle).
ja_jp: <literal>java.lang.String</literal> から <literal>VARCHAR</literal> （またはOracleの <literal>VARCHAR2</literal> ）への型マッピング。

source: There is one further type of property mapping. The <literal>&lt;any&gt;</literal> mapping element defines a polymorphic association to classes from multiple tables. This type of mapping always requires more than one column. The first column holds the type of the associated entity. The remaining columns hold the identifier. It is impossible to specify a foreign key constraint for this kind of association, so this is most certainly not meant as the usual way of mapping (polymorphic) associations. You should use this only in very special cases (eg. audit logs, user session data, etc).
fr_fr: locale, timezone, currency
ja_jp: date, time, timestamp

source: The <literal>meta-type</literal> attribute lets the application specify a custom type that maps database column values to persistent classes which have identifier properties of the type specified by <literal>id-type</literal>. You must specify the mapping from values of the meta-type to class names.
fr_fr: Mappings de type pour <literal>java.util.Locale</literal>, <literal>java.util.TimeZone</literal> et <literal>java.util.Currency</literal> vers <literal>VARCHAR</literal> (ou le <literal>VARCHAR2</literal> Oracle). Les instances de <literal>Locale</literal> et <literal>Currency</literal> sont mappées sur leurs codes ISO. Les instances de <literal>TimeZone</literal> sont mappées sur leur <literal>ID</literal>.
ja_jp: <literal>java.util.Date</literal> とそのサブクラスからSQL型の <literal>DATE</literal>, <literal>TIME</literal> , <literal>TIMESTAMP</literal> （またはそれらと等価なもの） への型マッピング。

source: <![CDATA[<any name="being" id-type="long" meta-type="string"> <meta-value value="TBL_ANIMAL" class="Animal"/> <meta-value value="TBL_HUMAN" class="Human"/> <meta-value value="TBL_ALIEN" class="Alien"/> <column name="table_name"/> <column name="id"/> </any>]]>
fr_fr: <literal>class</literal>
ja_jp: calendar, calendar_date

source: <![CDATA[<any name="propertyName" id-type="idtypename" meta-type="metatypename" cascade="cascade_style" access="field|property|ClassName" optimistic-lock="true|false" > <meta-value ... /> <meta-value ... /> ..... <column .... /> <column .... /> ..... </any>]]>
fr_fr: Un type de mapping pour <literal>java.lang.Class</literal> vers <literal>VARCHAR</literal> (ou le <literal>VARCHAR2</literal> Oracle). Un objet <literal>Class</literal> est mappé sur son nom Java complet.
ja_jp: <literal>java.util.Calendar</literal> からSQL型 の「 <literal>TIMESTAMP</literal> , <literal>DATE</literal> (またはそれらと等価なもの）への型マッピング。

source: <literal>name</literal>: the property name.
fr_fr: binary
ja_jp: big_decimal, big_integer

source: <literal>id-type</literal>: the identifier type.
fr_fr: Mappe les tableaux de bytes vers le type binaire SQL approprié.
ja_jp: <literal>java.math.BigDecimal</literal> と <literal>java.math.BigInteger</literal> から <literal>NUMERIC</literal>（またはOracleの <literal>NUMBER</literal> ）への型マッピング。

source: <literal>meta-type</literal> (optional - defaults to <literal>string</literal>): Any type that is allowed for a discriminator mapping.
fr_fr: text
ja_jp: locale, timezone, currency

source: <literal>cascade</literal> (optional- defaults to <literal>none</literal>): the cascade style.
fr_fr: Mappe les longues chaînes de caractères Java vers les types SQL <literal>CLOB</literal> ou <literal>TEXT</literal>.
ja_jp: <literal>java.util.Locale</literal> , <literal>java.util.TimeZone</literal> , <literal>java.util.Currency</literal> から <literal>VARCHAR</literal> （またはOracleの <literal>VARCHAR2</literal> ）への型マッピング。 <literal>Locale</literal> と <literal>Currency</literal> のインスタンスは、 それらのISOコードにマッピングされます。 <literal>TimeZone</literal> のインスタンスは、 それらの <literal>ID</literal> にマッピングされます。

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Specifies that updates to this property do or do not require acquisition of the optimistic lock. In other words, define if a version increment should occur if this property is dirty.
fr_fr: Mappe les types Java sérialisables vers le type SQL binaire approprié. Vous pouvez aussi indiquer le type Hibernate <literal>serializable</literal> avec le nom d'une classe Java sérialisable ou une interface qui ne soit pas par défaut un type de base.
ja_jp: <literal>java.lang.Class</literal> から <literal>VARCHAR</literal> （またはOracleの <literal>VARCHAR2</literal> ）への型マッピング。 <literal>Class</literal> はその完全修飾された名前にマッピングされます。

source: Hibernate Types
fr_fr: clob, blob
ja_jp: binary

source: Entities and values
fr_fr: Mappings de type pour les classes JDBC <literal>java.sql.Clob</literal> and <literal>java.sql.Blob</literal>. Ces types peuvent ne pas convenir pour certaines applications car un objet blob ou clob peut ne pas être réutilisable en dehors d'une transaction (de plus l'implémentation par les pilotes est moyennement bonne).
ja_jp: バイト配列は、適切なSQLのバイナリ型にマッピングされます。

source: To understand the behaviour of various Java language-level objects with respect to the persistence service, we need to classify them into two groups:
fr_fr: imm_date, imm_time, imm_timestamp, imm_calendar, imm_calendar_date, imm_serializable, imm_binary
ja_jp: text

source: An <emphasis>entity</emphasis> exists independently of any other objects holding references to the entity. Contrast this with the usual Java model where an unreferenced object is garbage collected. Entities must be explicitly saved and deleted (except that saves and deletions may be <emphasis>cascaded</emphasis> from a parent entity to its children). This is different from the ODMG model of object persistence by reachablity - and corresponds more closely to how application objects are usually used in large systems. Entities support circular and shared references. They may also be versioned.
fr_fr: Mappings de type pour ceux qui sont habituellement modifiable, pour lesquels Hibernate effectue certains optimisations convenant seulement aux types Java immuables, et l'application les traite comme immuable. Par exemple, vous ne devriez pas appeler <literal>Date.setTime()</literal> sur une instance mappée sur un <literal>imm_timestamp</literal>. Pour changer la valeur de la propriété, et faire que cette modification soit persistée, l'application doit assigner un nouvel (non identique) objet à la propriété.
ja_jp: 長いJava文字列は、SQLの <literal>CLOB</literal> または <literal>TEXT</literal> 型にマッピングされます。

source: An entity's persistent state consists of references to other entities and instances of <emphasis>value</emphasis> types. Values are primitives, collections (not what's inside a collection), components and certain immutable objects. Unlike entities, values (in particular collections and components) <emphasis>are</emphasis> persisted and deleted by reachability. Since value objects (and primitives) are persisted and deleted along with their containing entity they may not be independently versioned. Values have no independent identity, so they cannot be shared by two entities or collections.
fr_fr: Les identifiants uniques des entités et collections peuvent être de n'importe quel type de base excepté <literal>binary</literal>, <literal>blob</literal> et <literal>clob</literal> (les identifiants composites sont aussi permis, voir plus bas).
ja_jp: serializable

source: Up until now, we've been using the term "persistent class" to refer to entities. We will continue to do that. Strictly speaking, however, not all user-defined classes with persistent state are entities. A <emphasis>component</emphasis> is a user defined class with value semantics. A Java property of type <literal>java.lang.String</literal> also has value semantics. Given this definition, we can say that all types (classes) provided by the JDK have value type semantics in Java, while user-defined types may be mapped with entity or value type semantics. This decision is up to the application developer. A good hint for an entity class in a domain model are shared references to a single instance of that class, while composition or aggregation usually translates to a value type.
fr_fr: Les types de base des valeurs ont des <literal>Type</literal> constants correspondants définis dans <literal>org.hibernate.Hibernate</literal>. Par exemple, <literal>Hibernate.STRING</literal> représenté le type <literal>string</literal>.
ja_jp: シリアライズ可能なJava型は、適切なSQLのバイナリ型にマッピングされます。 デフォルトで基本型ではないシリアライズ可能なJavaクラスや インターフェイスの名前を指定することで、 Hibernateの型を <literal>serializable</literal> とすることもできます。

source: We'll revisit both concepts throughout the documentation.
fr_fr: Types de valeur définis par l'utilisateur
ja_jp: clob, blob

source: The challenge is to map the Java type system (and the developers' definition of entities and value types) to the SQL/database type system. The bridge between both systems is provided by Hibernate: for entities we use <literal>&lt;class&gt;</literal>, <literal>&lt;subclass&gt;</literal> and so on. For value types we use <literal>&lt;property&gt;</literal>, <literal>&lt;component&gt;</literal>, etc, usually with a <literal>type</literal> attribute. The value of this attribute is the name of a Hibernate <emphasis>mapping type</emphasis>. Hibernate provides many mappings (for standard JDK value types) out of the box. You can write your own mapping types and implement your custom conversion strategies as well, as you'll see later.
fr_fr: Il est assez facile pour les développeurs de créer leurs propres types de valeurs. Par exemple, vous pourriez vouloir persister des propriétés du type <literal>java.lang.BigInteger</literal> dans des colonnnes <literal>VARCHAR</literal>. Hibernate ne procure pas par défaut un type pour cela. Mais les types que vous pouvez créer ne se limitent pas à mapper des propriétés (ou élément collection) à une simple colonne d'une table. Donc, par exemple, vous pourriez avoir une propriété Java <literal>getName()</literal>/<literal>setName()</literal> de type <literal>java.lang.String</literal> persistée dans les colonnes <literal>FIRST_NAME</literal>, <literal>INITIAL</literal>, <literal>SURNAME</literal>.
ja_jp: JDBCクラス <literal>java.sql.Clob</literal> と <literal>java.sql.Blob</literal> に対する型マッピング。 blobやclobオブジェクトはトランザクションの外では再利用できないため、 アプリケーションによっては不便かもしれません。 （さらにはドライバサポートが一貫していません。）

source: All built-in Hibernate types except collections support null semantics.
fr_fr: Pour implémenter votre propre type, vous pouvez soit implémenter <literal>org.hibernate.UserType</literal> soit <literal>org.hibernate.CompositeUserType</literal> et déclarer des propriétés utilisant des noms de classes complets du type. Regardez <literal>org.hibernate.test.DoubleStringType</literal> pour voir ce qu'il est possible de faire.
ja_jp: imm_date, imm_time, imm_timestamp, imm_calendar, imm_calendar_date, imm_serializable, imm_binary

source: Basic value types
fr_fr: <![CDATA[<property name="twoStrings" type="org.hibernate.test.DoubleStringType"> <column name="first_string"/> <column name="second_string"/> </property>]]>
ja_jp: ほとんどの場合に可変であるJavaの型に対する型マッピング。 Hibernateは不変なJavaの型に対しては最適化を行い、 アプリケーションはそれを不変オブジェクトとして扱います。 例えば <literal>imm_timestamp</literal> としてマップしたインスタンスに対して、 <literal>Date.setTime()</literal> を呼び出してはなりません。 プロパティの値を変更しその変更を永続化するためには、 アプリケーションはプロパティに対して新しい(同一でない)オブジェクトを割り当てなければなりません。

source: The built-in <emphasis>basic mapping types</emphasis> may be roughly categorized into
fr_fr: Remarquez l'utilisation des tags <literal>&lt;column&gt;</literal> pour mapper une propriété sur des colonnes multiples.
ja_jp: エンティティとコレクションのユニークな識別子は、<literal>binary</literal> , <literal>blob</literal> , <literal>clob</literal> を除く、どんな基本型でも構いません。 （複合識別子でも構いません。以下を見てください。）

source: integer, long, short, float, double, character, byte, boolean, yes_no, true_false
fr_fr: Les interfaces <literal>CompositeUserType</literal>, <literal>EnhancedUserType</literal>, <literal>UserCollectionType</literal>, et <literal>UserVersionType</literal> permettent des utilisations plus spécialisées.
ja_jp: 基本的な値型には、<literal>org.hibernate.Hibernate</literal> で定義された <literal>Type</literal> 定数がそれぞれあります。 例えば、<literal>Hibernate.STRING</literal> は <literal>string</literal> 型を表現しています。

source: Type mappings from Java primitives or wrapper classes to appropriate (vendor-specific) SQL column types. <literal>boolean, yes_no</literal> and <literal>true_false</literal> are all alternative encodings for a Java <literal>boolean</literal> or <literal>java.lang.Boolean</literal>.
fr_fr: Vous pouvez même donner des paramètres en indiquant <literal>UserType</literal> dans le fichier de mapping ; Pour cela, votre <literal>UserType</literal> doit implémenter l'interface <literal>org.hibernate.usertype.ParameterizedType</literal>. Pour spécifier des paramètres dans votre type propre, vous pouvez utiliser l'élément <literal>&lt;type&gt;</literal> dans vos fichiers de mapping.
ja_jp: カスタム型

source: string
fr_fr: <![CDATA[<property name="priority"> <type name="com.mycompany.usertypes.DefaultValueIntegerType"> <param name="default">0</param> </type> </property>]]>
ja_jp: 開発者が独自の値型を作成することは、比較的簡単です。 例えば、<literal>java.lang.BigInteger</literal> 型のプロパティを <literal>VARCHAR</literal> カラムに永続化したいかもしれません。 Hibernateはこのための組み込み型を用意していません。 しかしカスタム型は、プロパティ（またはコレクションの要素）を1つのテーブルカラムに マッピングするのに制限はありません。 そのため例えば、<literal>java.lang.String</literal> 型の <literal>getName()</literal> / <literal>setName()</literal> Javaプロパティを <literal>FIRST_NAME</literal> , <literal>INITIAL</literal>, <literal>SURNAME</literal> カラムに永続化できます。

source: A type mapping from <literal>java.lang.String</literal> to <literal>VARCHAR</literal> (or Oracle <literal>VARCHAR2</literal>).
fr_fr: Le <literal>UserType</literal> permet maintenant de récupérer la valeur pour le paramètre nommé <literal>default</literal> à partir de l'objet <literal>Properties</literal> qui lui est passé.
ja_jp: カスタム型を実装するには、<literal>org.hibernate.UserType</literal> または <literal>org.hibernate.CompositeUserType</literal> を実装し、 型の完全修飾された名前を使ってプロパティを定義します。 どのような種類のものが可能かを調べるには、 <literal>org.hibernate.test.DoubleStringType</literal> を確認してください。

source: date, time, timestamp
fr_fr: Si vous utilisez fréquemment un <literal>UserType</literal>, cela peut être utile de lui définir un nom plus court. Vous pouvez faire cela en utilisant l'élément <literal>&lt;typedef&gt;</literal>. Les typedefs permettent d'assigner un nom à votre type propre et peuvent aussi contenir une liste de valeurs de paramètres par défaut si ce type est paramétré.
ja_jp: <![CDATA[<property name="twoStrings" type="org.hibernate.test.DoubleStringType"> <column name="first_string"/> <column name="second_string"/> </property>]]>

source: Type mappings from <literal>java.util.Date</literal> and its subclasses to SQL types <literal>DATE</literal>, <literal>TIME</literal> and <literal>TIMESTAMP</literal> (or equivalent).
fr_fr: <![CDATA[<typedef class="com.mycompany.usertypes.DefaultValueIntegerType" name="default_zero"> <param name="default">0</param> </typedef>]]>
ja_jp: <literal>&lt;column&gt;</literal> タグで、 プロパティを複数のカラムへマッピングできることに注目してください。

source: calendar, calendar_date
fr_fr: <![CDATA[<property name="priority" type="default_zero"/>]]>
ja_jp: <literal>CompositeUserType</literal> , <literal>EnhancedUserType</literal> , <literal>UserCollectionType</literal> , <literal>UserVersionType</literal> インターフェイスは、より特殊な使用法に対してのサポートを提供します。

source: Type mappings from <literal>java.util.Calendar</literal> to SQL types <literal>TIMESTAMP</literal> and <literal>DATE</literal> (or equivalent).
fr_fr: Il est aussi possible de redéfinir les paramètres par défaut du typedef au cas par cas en utilisant des paramètres type sur le mapping de la propriété.
ja_jp: マッピングファイル内で <literal>UserType</literal> へパラメータを提供できます。 このためには、<literal>UserType</literal> は <literal>org.hibernate.usertype.ParameterizedType</literal> を実装しなくてはなりません。 カスタム型パラメータを提供するために、 マッピングファイル内で <literal>&lt;type&gt;</literal> 要素を使用できます。

source: big_decimal, big_integer
fr_fr: Bien que le fait que Hibernate propose de base une riche variété de types, et qu'il supporte les composants signifie que vous aurez très rarement <emphasis>besoin</emphasis> d'utiliser un nouveau type propre, il est néanmoins de bonne pratique d'utiliser des types propres pour les classes (non entités) qui apparaissent fréquemment dans votre application. Par exemple une classe <literal>MonetaryAmount</literal> est un bon candidat pour un <literal>CompositeUserType</literal> même s'il pourrait facilement être mappé comme un composant. Une motivation pour cela est l'abstraction. Avec un type propre vos documents de mapping sont à l'abri des changements futurs dans votre façon de représenter des valeurs monétaires.
ja_jp: <![CDATA[<property name="priority"> <type name="com.mycompany.usertypes.DefaultValueIntegerType"> <param name="default">0</param> </type> </property>]]>

source: Type mappings from <literal>java.math.BigDecimal</literal> and <literal>java.math.BigInteger</literal> to <literal>NUMERIC</literal> (or Oracle <literal>NUMBER</literal>).
fr_fr: Mapper une classe plus d'une fois
ja_jp: <literal>UserType</literal> は、 引数として渡された <literal>Properties</literal> オブジェクトから、 <literal>default</literal> で指定したパラメータに対する値を検索することができます。

source: locale, timezone, currency
fr_fr: Il est possible de proposer plus d'un mapping par classe persistante. Dans ce cas, vous devez spécifier un <emphasis>nom d'entité</emphasis> pour lever l'ambiguité entre les instances des entités mappées (par défaut, le nom de l'entité est celui de la classe). Hibernate vous permet de spécifier le nom de l'entité lorsque vous utilisez des objets persistants, lorsque vous écrivez des requêtes ou quand vous mappez des associations vers les entités nommées.
ja_jp: 特定の <literal>UserType</literal> を頻繁に使用するならば、短い名前を定義すると便利になるでしょう。 <literal>&lt;typedef&gt;</literal> 要素を使ってこのようなことが行えます。 Typedefsはカスタム型に名前を割り当てます。 その型がパラメータを持つならば、 パラメータのデフォルト値のリストを含むこともできます。

source: Type mappings from <literal>java.util.Locale</literal>, <literal>java.util.TimeZone</literal> and <literal>java.util.Currency</literal> to <literal>VARCHAR</literal> (or Oracle <literal>VARCHAR2</literal>). Instances of <literal>Locale</literal> and <literal>Currency</literal> are mapped to their ISO codes. Instances of <literal>TimeZone</literal> are mapped to their <literal>ID</literal>.
fr_fr: <![CDATA[<class name="Contract" table="Contracts" entity-name="CurrentContract"> ... <set name="history" inverse="true" order-by="effectiveEndDate desc"> <key column="currentContractId"/> <one-to-many entity-name="HistoricalContract"/> </set> </class> <class name="Contract" table="ContractHistory" entity-name="HistoricalContract"> ... <many-to-one name="currentContract" column="currentContractId" entity-name="CurrentContract"/> </class>]]>
ja_jp: <![CDATA[<typedef class="com.mycompany.usertypes.DefaultValueIntegerType" name="default_zero"> <param name="default">0</param> </typedef>]]>

source: <literal>class</literal>
fr_fr: Remarquez comment les associations sont désormais spécifiées en utilisant <literal>entity-name</literal> au lieu de <literal>class</literal>.
ja_jp: <![CDATA[<property name="priority" type="default_zero"/>]]>

source: A type mapping from <literal>java.lang.Class</literal> to <literal>VARCHAR</literal> (or Oracle <literal>VARCHAR2</literal>). A <literal>Class</literal> is mapped to its fully qualified name.
fr_fr: SQL quoted identifiers
ja_jp: プロパティのマッピングで型パラメータを使うことで、 typedefで提供されたパラメータをその都度オーバーライドすることが可能です。

source: binary
fr_fr: Vous pouvez forcer Hibernate à mettre un identifiant entre quotes dans le SQL généré en mettant le nom de la table ou de la colonne entre backticks dans le document de mapping. Hibernate utilisera les bons styles de quotes pour le <literal>Dialect</literal> SQL (habituellement des doubles quotes, mais des parenthèses pour SQL server et des backticks pour MySQL).
ja_jp: Hibernateの幅広い組み込み型とコンポーネントに対するサポートは、 カスタム型をめったに <emphasis>使わない</emphasis> ということを意味します。 それでもなお、アプリケーションで頻出する(エンティティではない)クラスに対するカスタム型の使用は、 よいやり方であるとみなされます。 例えば <literal>MonetaryAmount</literal> クラスはコンポーネントとして簡単にマッピングできますが、 <literal>CompositeUserType</literal> の良い候補です。 カスタム型を使用する動機の1つは抽象化です。 カスタム型を使うことで、通貨をどのように表現しようとも マッピングドキュメントは起こりうる変化に対応できます。

source: Maps byte arrays to an appropriate SQL binary type.
fr_fr: <![CDATA[<class name="LineItem" table="`Line Item`"> <id name="id" column="`Item Id`"/><generator class="assigned"/></id> <property name="itemNumber" column="`Item #`"/> ... </class>]]>
ja_jp: １つのクラスに１つ以上のマッピング

source: text
fr_fr: alternatives Metadata
ja_jp: ある永続クラスに、一つ以上のマッピングを提供することが出来ます。 この場合、マッピングする２つのエンティティのインスタンスを明確にするために、 <emphasis>エンティティ名</emphasis> を指定しなければなりません (デフォルトではエンティティ名はクラス名と同じです。)。 永続オブジェクトを扱うとき、クエリを書き込むとき、 指定されたエンティティへの関連をマッピングするときには、 Hibernateではエンティティ名を指定しなければなりません。
