Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/basic_mapping.po
Languages: fr_fr, ja_jp

source: <literal>lazy</literal> (optional - defaults to <literal>proxy</literal>): By default, single point associations are proxied. <literal>lazy="no-proxy"</literal> specifies that the property should be fetched lazily when the instance variable is first accessed (requires build-time bytecode instrumentation). <literal>lazy="false"</literal> specifies that the association will always be eagerly fetched. <emphasis>Note that if <literal>constrained="false"</literal>, proxying is impossible and Hibernate will eager fetch the association!</emphasis>
fr_fr: Les tags fils <literal>&lt;property&gt;</literal> mappent les propriétés de la classe fille sur les colonnes de la table.
ja_jp: <literal>name</literal>：プロパティ名。

source: There are two varieties of one-to-one association:
fr_fr: L'élément <literal>&lt;dynamic-component&gt;</literal> permet à une <literal>Map</literal> d'être mappée comme un composant, quand les noms de la propriété font référence aux clefs de cette Map, voir <xref linkend="components-dynamic"/>.
ja_jp: <literal>insert</literal> ：マッピングされたカラムがSQLの <literal>INSERT</literal> に現れるようにするどうかを指定します。

source: primary key associations
fr_fr: properties
ja_jp: <literal>update</literal> : マッピングされたカラムがSQL の <literal>UPDATE</literal> に現れるようにするかどうかを指定します。

source: unique foreign key associations
fr_fr: L'élément <literal>&lt;properties&gt;</literal> permet la définition d'un groupement logique nommé des propriétés d'une classe. L'utilisation la plus importante de cette construction est la possibilité pour une combinaison de propriétés d'être la cible d'un <literal>property-ref</literal>. C'est aussi un moyen pratique de définir une contrainte d'unicité multi-colonnes.
ja_jp: <literal>access</literal> （オプション - デフォルトは <literal>property</literal> ）： プロパティの値へのアクセスにHibernateが使う戦略。

source: Primary key associations don't need an extra table column; if two rows are related by the association then the two table rows share the same primary key value. So if you want two objects to be related by a primary key association, you must make sure that they are assigned the same identifier value!
fr_fr: <![CDATA[<properties name="logicalName" insert="true|false" update="true|false" optimistic-lock="true|false" unique="true|false" > <property ...../> <many-to-one .... /> ........ </properties>]]>
ja_jp: <literal>lazy</literal> (optional - デフォルトは <literal>false</literal> ): インスタンス変数に最初にアクセスしたときに、 コンポーネントを遅延してフェッチするよう指定します。 (バイトコード実装を作成する時間が必要になります)

source: For a primary key association, add the following mappings to <literal>Employee</literal> and <literal>Person</literal>, respectively.
fr_fr: <literal>name</literal> : Le nom logique d'un regroupement et <emphasis>non</emphasis> le véritable nom d'une propriété.
ja_jp: <literal>optimistic-lock</literal> (オプション - デフォルトは <literal>true</literal> ): このプロパティの更新に、楽観ロックの取得を要求するかどうかを指定します。 言い換えれば、このプロパティがダーティであるときにバージョンを増やすべきかを決定します。

source: <![CDATA[<one-to-one name="person" class="Person"/>]]>
fr_fr: <literal>insert</literal> : Est-ce que les colonnes mappées apparaissent dans les <literal>INSERT</literal>s ?
ja_jp: <literal>unique</literal> (オプション - デフォルトは <literal>false</literal> ): コンポーネントのすべてのマッピングするカラムに、ユニーク制約が存在するかを指定します。

source: <![CDATA[<one-to-one name="employee" class="Employee" constrained="true"/>]]>
fr_fr: <literal>update</literal> : Est-ce que les colonnes mappées apparaissent dans les <literal>UPDATE</literal>s ?
ja_jp: 子の <literal>&lt;property&gt;</literal> タグで、 子のクラスのプロパティをテーブルカラムにマッピングします。

source: Now we must ensure that the primary keys of related rows in the PERSON and EMPLOYEE tables are equal. We use a special Hibernate identifier generation strategy called <literal>foreign</literal>:
fr_fr: <literal>optimistic-lock</literal> (optionnel - par défaut à <literal>true</literal>) : Indique que les mises à jour sur ce composant nécessitent ou non l'acquisition d'un verrou optimiste. En d'autres termes, cela détermine si une incrémentation de version doit avoir lieu quand la propriété est marquée obsolète (dirty).
ja_jp: <literal>&lt;component&gt;</literal> 要素は、親エンティティへ戻る参照として、 コンポーネントのクラスのプロパティをマッピングする <literal>&lt;parent&gt;</literal> サブ要素を許可します。

source: <![CDATA[<class name="person" table="PERSON"> <id name="id" column="PERSON_ID"> <generator class="foreign"> <param name="property">employee</param> </generator> </id> ... <one-to-one name="employee" class="Employee" constrained="true"/> </class>]]>
fr_fr: <literal>unique</literal> (optionnel - par défaut à <literal>false</literal>) : Indique qu'une contrainte d'unicité existe sur toutes les colonnes mappées de ce composant.
ja_jp: <literal>&lt;dynamic-component&gt;</literal> 要素は、 <literal>Map</literal> がコンポーネントとしてマッピングされることを可能にします。 プロパティ名はmapのキーを参照します。<xref linkend="components-dynamic"/> を参照してください。

source: A newly saved instance of <literal>Person</literal> is then assigned the same primary key value as the <literal>Employee</literal> instance refered with the <literal>employee</literal> property of that <literal>Person</literal>.
fr_fr: Par exemple, si nous avons le mapping de <literal>&lt;properties&gt;</literal> suivant :
ja_jp: properties

source: Alternatively, a foreign key with a unique constraint, from <literal>Employee</literal> to <literal>Person</literal>, may be expressed as:
fr_fr: <![CDATA[<class name="Person"> <id name="personNumber"/> ... <properties name="name" unique="true" update="false"> <property name="firstName"/> <property name="initial"/> <property name="lastName"/> </properties> </class>]]>
ja_jp: <literal>&lt;properties&gt;</literal> 要素はクラスのプロパティの指定された、 論理的なグルーピングを可能にします。 この構造の最も重要な使用方法は、 <literal>property-ref</literal> のターゲットになるプロパティの結合を許可することです。 それはまた、複数カラムのユニーク制約を定義する簡単な方法でもあります。

source: <![CDATA[<many-to-one name="person" class="Person" column="PERSON_ID" unique="true"/>]]>
fr_fr: Alors nous pourrions avoir une association sur des données d'un ancien système (legacy) qui font référence à cette clef unique de la table <literal>Person</literal> au lieu de la clef primaire :
ja_jp: <![CDATA[<properties name="logicalName" insert="true|false" update="true|false" optimistic-lock="true|false" unique="true|false" > <property ...../> <many-to-one .... /> ........ </properties>]]>

source: And this association may be made bidirectional by adding the following to the <literal>Person</literal> mapping:
fr_fr: <![CDATA[<many-to-one name="person" class="Person" property-ref="name"> <column name="firstName"/> <column name="initial"/> <column name="lastName"/> </many-to-one>]]>
ja_jp: <literal>name</literal> : グルーピングの論理名。 実際のプロパティ名では <emphasis>ありません</emphasis> 。

source: <![CDATA[<one-to-one name="employee" class="Employee" property-ref="person"/>]]>
fr_fr: Nous ne recommandons pas l'utilisation de ce genre de chose en dehors du contexte de mapping de données héritées d'anciens systèmes.
ja_jp: <literal>insert</literal>：マッピングされたカラムがSQLの <literal>INSERT</literal> に現れるようにするかどうかを指定します。

source: natural-id
fr_fr: subclass
ja_jp: <literal>update</literal>：マッピングされたカラムがSQLの <literal>UPDATE</literal> に現れるようにするかどうかを指定します。

source: <![CDATA[<natural-id mutable="true|false"/> <property ... /> <many-to-one ... /> ...... </natural-id>]]>
fr_fr: Pour finir, la persistance polymorphique nécessite la déclaration de chaque sous-classe de la classe persistante de base. pour la stratégie de mapping de type table-per-class-hierarchy, on utilise la déclaration <literal>&lt;subclass&gt;</literal>.
ja_jp: <literal>optimistic-lock</literal> (オプション - デフォルトは <literal>true</literal> ): これらのプロパティの更新に楽観的ロックの取得を要求するかどうかを指定します。 言い換えれば、このプロパティがダーティであるときにバージョンを増やすべきかを決定します。

source: Even though we recommend the use of surrogate keys as primary keys, you should still try to identify natural keys for all entities. A natural key is a property or combination of properties that is unique and non-null. If it is also immutable, even better. Map the properties of the natural key inside the <literal>&lt;natural-id&gt;</literal> element. Hibernate will generate the necessary unique key and nullability constraints, and your mapping will be more self-documenting.
fr_fr: <![CDATA[<subclass name="ClassName" discriminator-value="discriminator_value" proxy="ProxyInterface" lazy="true|false" dynamic-update="true|false" dynamic-insert="true|false" entity-name="EntityName" node="element-name" extends="SuperclassName"> <property .... /> ..... </subclass>]]>
ja_jp: <literal>unique</literal> (オプション - デフォルトは <literal>false</literal> ): コンポーネントのすべてのマッピングするカラムに、ユニーク制約が存在するかを指定します。

source: We strongly recommend that you implement <literal>equals()</literal> and <literal>hashCode()</literal> to compare the natural key properties of the entity.
fr_fr: <literal>name</literal> : Le nom complet de la sous-classe.
ja_jp: 例えば、もし以下のような <literal>&lt;properties&gt;</literal> マッピングがあった場合：

source: This mapping is not intended for use with entities with natural primary keys.
fr_fr: <literal>discriminator-value</literal> (optionnel - par défaut le nom de la classe) : une valeur qui distingue les différentes sous-classes.
ja_jp: <![CDATA[<class name="Person"> <id name="personNumber"/> ... <properties name="name" unique="true" update="false"> <property name="firstName"/> <property name="initial"/> <property name="lastName"/> </properties> </class>]]>

source: <literal>mutable</literal> (optional, defaults to <literal>false</literal>): By default, natural identifier properties as assumed to be immutable (constant).
fr_fr: <literal>proxy</literal> (optionnel) : Indique une classe ou interface à utiliser pour les chargements à la demande des proxies (lazy).
ja_jp: 主キーの代わりに <literal>Person</literal> テーブルのユニークキーへの参照を持つ、 レガシーデータの関連を持つかもしれません。：

source: component, dynamic-component
fr_fr: <literal>lazy</literal> (optionnel, par défaut à <literal>true</literal>) : Spécifier <literal>lazy="false"</literal> désactive l'utilisation du chargement à la demande (lazy).
ja_jp: <![CDATA[<many-to-one name="person" class="Person" property-ref="name"> <column name="firstName"/> <column name="initial"/> <column name="lastName"/> </many-to-one>]]>

source: The <literal>&lt;component&gt;</literal> element maps properties of a child object to columns of the table of a parent class. Components may, in turn, declare their own properties, components or collections. See "Components" below.
fr_fr: Chaque sous-classe devrait déclarer ses propres propriétés persistantes et sous-classes. Les propriétés <literal>&lt;version&gt;</literal> et <literal>&lt;id&gt;</literal> sont implicitement hérités de la classe de base. Chaque sous-classe dans une hiérarchie doit définir une unique <literal>discriminator-value</literal>. Si aucune n'est spécifiée, le nom complet de la classe Java est utilisé.
ja_jp: しかし、このようなレガシーデータマッピングのコンテキスト外への使用は推奨しません。

source: <![CDATA[<component name="propertyName" class="className" insert="true|false" update="true|false" access="field|property|ClassName" lazy="true|false" optimistic-lock="true|false" unique="true|false" node="element-name|." > <property ...../> <many-to-one .... /> ........ </component>]]>
fr_fr: Pour plus d'infos sur le mapping d'héritage, voir <xref linkend="inheritance"/>.
ja_jp: subclass

source: <literal>class</literal> (optional - defaults to the property type determined by reflection): The name of the component (child) class.
fr_fr: Pour des informations sur les mappings d'héritage, voir <xref linkend="inheritance"/>.
ja_jp: <![CDATA[<subclass name="ClassName" discriminator-value="discriminator_value" proxy="ProxyInterface" lazy="true|false" dynamic-update="true|false" dynamic-insert="true|false" entity-name="EntityName" node="element-name" extends="SuperclassName"> <property .... /> ..... </subclass>]]>

source: <literal>insert</literal>: Do the mapped columns appear in SQL <literal>INSERT</literal>s?
fr_fr: joined-subclass
ja_jp: <literal>name</literal>：サブクラスの完全修飾されたクラス名。

source: <literal>update</literal>: Do the mapped columns appear in SQL <literal>UPDATE</literal>s?
fr_fr: Une autre façon possible de faire est la suivante, chaque sous-classe peut être mappée vers sa propre table (stratégie de mapping de type table-per-subclass). L'état hérité est récupéré en joignant la table de la super-classe. L'élément <literal>&lt;joined-subclass&gt;</literal> est utilisé.
ja_jp: <literal>discriminator-value</literal>（オプション - デフォルトはクラス名）： 個々のサブクラスを区別するための値。

source: <literal>lazy</literal> (optional - defaults to <literal>false</literal>): Specifies that this component should be fetched lazily when the instance variable is first accessed (requires build-time bytecode instrumentation).
fr_fr: <literal>name</literal> : Le nom Java complet de la sous-classe.
ja_jp: <literal>lazy</literal>（オプション, デフォルトは <literal>true</literal> ）： <literal>lazy="false"</literal> と設定すると、遅延フェッチが使用できません。

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Specifies that updates to this component do or do not require acquisition of the optimistic lock. In other words, determines if a version increment should occur when this property is dirty.
fr_fr: <literal>table</literal> : Le nom de la table de la sous-classe.
ja_jp: 各サブクラスでは、永続プロパティとサブクラスを定義します。 <literal>&lt;version&gt;</literal> と <literal>&lt;id&gt;</literal> プロパティは、 ルートクラスから継承されると仮定されます。 階層構造におけるサブクラスは、 ユニークな <literal>discriminator-value</literal> を定義しなければなりません。 noneが指定されると、完全修飾されたJavaクラス名が使われます。

source: <literal>unique</literal> (optional - defaults to <literal>false</literal>): Specifies that a unique constraint exists upon all mapped columns of the component.
fr_fr: <literal>proxy</literal> (optionnel) : Indique une classe ou interface pour le chargement différé des proxies.
ja_jp: 継承のマッピングに関する情報は <xref linkend="inheritance"/> を見てください。

source: The child <literal>&lt;property&gt;</literal> tags map properties of the child class to table columns.
fr_fr: <literal>lazy</literal> (optionnel, par défaut à <literal>true</literal>) : Indiquer <literal>lazy="false"</literal> désactive l'utilisation du chargement à la demande.
ja_jp: joined-subclass

source: The <literal>&lt;component&gt;</literal> element allows a <literal>&lt;parent&gt;</literal> subelement that maps a property of the component class as a reference back to the containing entity.
fr_fr: Aucune colonne discriminante n'est nécessaire pour cette stratégie de mapping. Cependant, chaque sous-classe doit déclarer une colonne de table contenant l'objet identifiant qui utilise l'élément <literal>&lt;key&gt;</literal>. Le mapping au début de ce chapitre serait ré-écrit ainsi :
ja_jp: もう1つの方法として、各サブクラスを自身のテーブルへマッピングすることができます (table-per-subclass mapping strategy)。 継承した状態はスーパークラスのテーブルを使った結合で検索します。 <literal>&lt;joined-subclass&gt;</literal> 要素を使用します。

source: The <literal>&lt;dynamic-component&gt;</literal> element allows a <literal>Map</literal> to be mapped as a component, where the property names refer to keys of the map, see <xref linkend="components-dynamic"/>.
fr_fr: <![CDATA[<?xml version="1.0"?> <!DOCTYPE hibernate-mapping PUBLIC "-//Hibernate/Hibernate Mapping DTD//EN" "http://hibernate.sourceforge.net/hibernate-mapping-3.0.dtd"> <hibernate-mapping package="eg"> <class name="Cat" table="CATS"> <id name="id" column="uid" type="long"> <generator class="hilo"/> </id> <property name="birthdate" type="date"/> <property name="color" not-null="true"/> <property name="sex" not-null="true"/> <property name="weight"/> <many-to-one name="mate"/> <set name="kittens"> <key column="MOTHER"/> <one-to-many class="Cat"/> </set> <joined-subclass name="DomesticCat" table="DOMESTIC_CATS"> <key column="CAT"/> <property name="name" type="string"/> </joined-subclass> </class> <class name="eg.Dog"> <!-- mapping for Dog could go here --> </class> </hibernate-mapping>]]>
ja_jp: <![CDATA[<joined-subclass name="ClassName" table="tablename" proxy="ProxyInterface" lazy="true|false" dynamic-update="true|false" dynamic-insert="true|false" schema="schema" catalog="catalog" extends="SuperclassName" persister="ClassName" subselect="SQL expression" entity-name="EntityName" node="element-name"> <key .... > <property .... /> ..... </joined-subclass>]]>

source: properties
fr_fr: Pour des informations sur les mappings d'héritage, voir <xref linkend="inheritance"/>.
ja_jp: <literal>name</literal>：サブクラスの完全修飾されたクラス名。

source: The <literal>&lt;properties&gt;</literal> element allows the definition of a named, logical grouping of properties of a class. The most important use of the construct is that it allows a combination of properties to be the target of a <literal>property-ref</literal>. It is also a convenient way to define a multi-column unique constraint.
fr_fr: union-subclass
ja_jp: <literal>table</literal> :サブクラステーブルの名前。

source: <![CDATA[<properties name="logicalName" insert="true|false" update="true|false" optimistic-lock="true|false" unique="true|false" > <property ...../> <many-to-one .... /> ........ </properties>]]>
fr_fr: Une troisième option est de seulement mapper vers des tables les classes concrètes d'une hiérarchie d'héritage, (stratégie de type table-per-concrete-class) où chaque table définit tous les états persistants de la classe, y compris les états hérités. Dans Hibernate il n'est absolument pas nécessaire de mapper explicitement de telles hiérarchies d'héritage. Vous pouvez simplement mapper chaque classe avec une déclaration <literal>&lt;class&gt;</literal> différente. Cependant, si vous souhaitez utiliser des associations polymorphiques (càd une association vers la superclasse de la hiérarchie), vous devez utiliser le mapping <literal>&lt;union-subclass&gt;</literal>.
ja_jp: <literal>proxy</literal> (オプション): 遅延初期化プロキシに使用するクラスやインターフェイスを指定します。

source: <literal>name</literal>: The logical name of the grouping - <emphasis>not</emphasis> an actual property name.
fr_fr: <![CDATA[<union-subclass name="ClassName" table="tablename" proxy="ProxyInterface" lazy="true|false" dynamic-update="true|false" dynamic-insert="true|false" schema="schema" catalog="catalog" extends="SuperclassName" abstract="true|false" persister="ClassName" subselect="SQL expression" entity-name="EntityName"> <property .... /> ..... </union-subclass>]]>
ja_jp: <literal>lazy</literal> (オプション, デフォルトは <literal>true</literal> ): <literal>lazy="false"</literal> とすると、遅延フェッチが使用できません。

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Specifies that updates to these properties do or do not require acquisition of the optimistic lock. In other words, determines if a version increment should occur when these properties are dirty.
fr_fr: <literal>proxy</literal> (optionnel) : Indique une classe ou interface pour le chargement différé des proxies.
ja_jp: 継承のマッピングに関する情報は <xref linkend="inheritance"/> を見てください。

source: For example, if we have the following <literal>&lt;properties&gt;</literal> mapping:
fr_fr: Aucune colonne discriminante ou colonne clef n'est requise pour cette stratégie de mapping.
ja_jp: 3つ目の選択肢は、継承階層の具象クラスのみをテーブルにマッピングすることです (the table-per-concrete-class戦略)。 それぞれのテーブルは継承の状態を含めすべてのクラスの永続状態を定義します。 Hibernateではその様な継承階層が必ずしも必要ではありません。 単純にそれぞれのクラスを、 別々の <literal>&lt;class&gt;</literal> 宣言を使ってマッピングすることができます。 しかしポリモーフィックな関連(例えば 階層のスーパークラスへの関連)を使いたいなら、 <literal>&lt;union-subclass&gt;</literal> マッピングを使う必要があります。

source: <![CDATA[<class name="Person"> <id name="personNumber"/> ... <properties name="name" unique="true" update="false"> <property name="firstName"/> <property name="initial"/> <property name="lastName"/> </properties> </class>]]>
fr_fr: Pour des informations sur les mappings d'héritage, voir <xref linkend="inheritance"/>.
ja_jp: <![CDATA[<union-subclass name="ClassName" table="tablename" proxy="ProxyInterface" lazy="true|false" dynamic-update="true|false" dynamic-insert="true|false" schema="schema" catalog="catalog" extends="SuperclassName" abstract="true|false" persister="ClassName" subselect="SQL expression" entity-name="EntityName" node="element-name"> <property .... /> ..... </union-subclass>]]>

source: Then we might have some legacy data association which refers to this unique key of the <literal>Person</literal> table, instead of to the primary key:
fr_fr: join
ja_jp: <literal>name</literal>：サブクラスの完全修飾されたクラス名。

source: <![CDATA[<many-to-one name="person" class="Person" property-ref="name"> <column name="firstName"/> <column name="initial"/> <column name="lastName"/> </many-to-one>]]>
fr_fr: En utilisant l'élément <literal>&lt;join&gt;</literal>, il est possible de mapper des propriétés d'une classe sur plusieurs tables.
ja_jp: <literal>table</literal> :サブクラステーブルの名前。

source: We don't recommend the use of this kind of thing outside the context of mapping legacy data.
fr_fr: <![CDATA[<join table="tablename" schema="owner" catalog="catalog" fetch="join|select" inverse="true|false" optionnel="true|false"> <key ... /> <property ... /> ... </join>]]>
ja_jp: <literal>proxy</literal> (オプション): 遅延初期化プロキシに使用するクラスやインターフェイスを指定します。

source: subclass
fr_fr: <literal>table</literal> : Le nom de la table jointe.
ja_jp: <literal>lazy</literal> (オプション, デフォルトは <literal>true</literal> ): <literal>lazy="false"</literal> とすると、遅延フェッチが使用できません。

source: Finally, polymorphic persistence requires the declaration of each subclass of the root persistent class. For the table-per-class-hierarchy mapping strategy, the <literal>&lt;subclass&gt;</literal> declaration is used.
fr_fr: <literal>schema</literal> (optionnel) : court-circuite le nom de schéma spécifié par l'élément de base <literal>&lt;hibernate-mapping&gt;</literal>.
ja_jp: このマッピング戦略では識別カラムやキーカラムは必要ありません。

source: <![CDATA[<subclass name="ClassName" discriminator-value="discriminator_value" proxy="ProxyInterface" lazy="true|false" dynamic-update="true|false" dynamic-insert="true|false" entity-name="EntityName" node="element-name" extends="SuperclassName"> <property .... /> ..... </subclass>]]>
fr_fr: <literal>catalog</literal> (optionnel) : court-circuite le nom de catalogue spécifié par l'élément de base <literal>&lt;hibernate-mapping&gt;</literal>.
ja_jp: 継承のマッピングに関する情報は <xref linkend="inheritance"/> を見てください。

source: <literal>name</literal>: The fully qualified class name of the subclass.
fr_fr: <literal>fetch</literal> (optionnel - par défaut à <literal>join</literal>) : Si positionné à <literal>join</literal>, Hibernate utilisera une jointure interne pour charger une <literal>jointure</literal> définie par une classe ou ses super-classes et une jointure externe pour une <literal>&lt;jointure&gt;</literal> définie par une sous-classe. Si positionné à <literal>select</literal> alors Hibernate utilisera un select séquentiel pour une <literal>&lt;jointure&gt;</literal> définie sur une sous-classe, qui ne sera délivrée que si une ligne se représente une instance de la sous-classe. Les jointures internes seront quand même utilisées pour charger une <literal>&lt;jointure&gt;</literal> définie par une classe et ses super-classes.
ja_jp: join

source: <literal>discriminator-value</literal> (optional - defaults to the class name): A value that distiguishes individual subclasses.
fr_fr: <literal>inverse</literal> (optionnel - par défaut à <literal>false</literal>) : Si positionné à true, Hibernate n'essaiera pas d'insérer ou de mettre à jour les propriétés définies par cette jointure.
ja_jp: <literal>&lt;join&gt;</literal> 要素を使うことで、 １つのクラスのプロパティをいくつものテーブルにマッピングすることができます。
