Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/basic_mapping.po
Languages: fr_fr, ja_jp

source: <literal>insert</literal> (optional - defaults to <literal>true</literal>) set this to <literal>false</literal> if your discriminator column is also part of a mapped composite identifier. (Tells Hibernate to not include the column in SQL <literal>INSERT</literal>s.)
fr_fr: <literal>name</literal> : nom de la propriété, avec une lettre initiale en minuscule.
ja_jp: <literal>source</literal> (オプション - デフォルトは <literal>vm</literal> ): Hibernateはどこからタイムスタンプの値を取得するべきでしょうか？ データベースからでしょうか、現在のJVMからでしょうか？ データベースによるタイムスタンプは、Hibernateが"次の値"を決定するために データベースをヒットしなければならないため、オーバヘッドを招きます。 しかしクラスタ環境ではJVMから取得するより安全です。 データベースの現在のタイムスタンプの取得をサポートする すべての <literal>データベース方言</literal> が知られているわけではないことに 注意してください。また一方で、精密さを欠くために、 ロックで使用するには安全でないものもあります(例えばOracle 8)。

source: <literal>formula</literal> (optional) an arbitrary SQL expression that is executed when a type has to be evaluated. Allows content-based discrimination.
fr_fr: <literal>column</literal> (optionnel - par défaut au nom de la propriété) : le nom de la colonne mappée. Cela peut aussi être indiqué dans le(s) sous-élément(s) <literal>&lt;column&gt;</literal>.
ja_jp: <literal>generated</literal> (オプション - デフォルトは <literal>never</literal> ): このタイムスタンプ・プロパティの値が、データベースによって生成されることを指定します。 <xref linkend="mapping-generated"/>生成プロパティ を参照してください。

source: Actual values of the discriminator column are specified by the <literal>discriminator-value</literal> attribute of the <literal>&lt;class&gt;</literal> and <literal>&lt;subclass&gt;</literal> elements.
fr_fr: <literal>type</literal> (optionnel) : nom indiquant le type Hibernate.
ja_jp: <literal>&lt;timestamp&gt;</literal> は <literal>&lt;version type="timestamp"&gt;</literal> と等価であることに注意してください。 <literal>&lt;timestamp source="db"&gt;</literal> は <literal>&lt;version type="dbtimestamp"&gt;</literal> と等価であることに注意してください。

source: The <literal>force</literal> attribute is (only) useful if the table contains rows with "extra" discriminator values that are not mapped to a persistent class. This will not usually be the case.
fr_fr: <literal>update, insert</literal> (optionnel - par défaut à <literal>true</literal>) : indique que les colonnes mappées devraient être incluses dans des <literal>UPDATE</literal> SQL et/ou des <literal>INSERT</literal>. Mettre les deux à <literal>false</literal> empêche la propagation en base de données (utile si vous savez qu'un trigger affectera la valeur à la colonne).
ja_jp: property

source: Using the <literal>formula</literal> attribute you can declare an arbitrary SQL expression that will be used to evaluate the type of a row:
fr_fr: <literal>formula</literal> (optionnel) : une expression SQL qui définit la valeur pour une propriété <emphasis>calculée</emphasis>. Les propriétés calculées ne possède pas leur propre mapping.
ja_jp: <literal>&lt;property&gt;</literal> 要素は、クラスの永続的なJavaBeanスタイルのプロパティを定義します。

source: <![CDATA[<discriminator formula="case when CLASS_TYPE in ('a', 'b', 'c') then 0 else 1 end" type="integer"/>]]>
fr_fr: <literal>access</literal> (optionnel - par défaut à <literal>property</literal>): Stratégie que Hibernate doit utiliser pour accéder à cette valeur.
ja_jp: <![CDATA[<property name="propertyName" column="column_name" type="typename" update="true|false" insert="true|false" formula="arbitrary SQL expression" access="field|property|ClassName" lazy="true|false" unique="true|false" not-null="true|false" optimistic-lock="true|false" generated="never|insert|always" node="element-name|@attribute-name|element/@attribute|." index="index_name" unique_key="unique_key_id" length="L" precision="P" scale="S" />]]>

source: version (optional)
fr_fr: <literal>lazy</literal> (optionnel - par défaut à <literal>false</literal>): Indique que cette propriété devrait être chargée en différé (lazy loading) quand on accède à la variable d'instance pour la première fois.
ja_jp: <literal>name</literal>：小文字で始まるプロパティ名。

source: The <literal>&lt;version&gt;</literal> element is optional and indicates that the table contains versioned data. This is particularly useful if you plan to use <emphasis>long transactions</emphasis> (see below).
fr_fr: <literal>unique</literal> (optionnel): Génère le DDL d'une contrainte d'unicité pour les colonnes. Permet aussi d'en faire la cible d'un <literal>property-ref</literal>.
ja_jp: <literal>column</literal>（オプション - デフォルトはプロパティ名）： マッピングされたデータベーステーブルのカラムの名前。 ネストした <literal>&lt;column&gt;</literal> 要素でも指定できます。

source: <![CDATA[<version column="version_column" name="propertyName" type="typename" access="field|property|ClassName" unsaved-value="null|negative|undefined" generated="never|always" insert="true|false" node="element-name|@attribute-name|element/@attribute|." />]]>
fr_fr: <literal>not-null</literal> (optionnel): Génère le DDL d'une contrainte de non nullité pour les colonnes.
ja_jp: <literal>type</literal>（オプション）：Hibernateの型を示す名前。

source: <literal>column</literal> (optional - defaults to the property name): The name of the column holding the version number.
fr_fr: <literal>optimistic-lock</literal> (optionnel - par défaut à <literal>true</literal>): Indique que les mises à jour de cette propriété peuvent ou non nécessiter l'acquisition d'un verrou optimiste. En d'autres termes, cela détermine s'il est nécessaire d'incrémenter un numéro de version quand cette propriété est marquée obsolète (dirty).
ja_jp: <literal>update, insert</literal> （オプション - デフォルトは <literal>true</literal> ）： マッピングされたカラムがSQLの <literal>UPDATE</literal> や <literal>INSERT</literal> に含まれることを指定します。 両方とも <literal>false</literal> に設定すると、 同じカラムにマッピングされた他のプロパティやトリガや 他のアプリケーションによって初期化された純粋な「導出」プロパティが可能になります。

source: <literal>name</literal>: The name of a property of the persistent class.
fr_fr: <literal>generated</literal> (optional - défaut à<literal>never</literal>): Indique que la valeur de ce timestamp est générée par la base de données cf. <xref linkend="mapping-generated"/>generated properties.
ja_jp: <literal>formula</literal>（オプション）： <emphasis>計算</emphasis> プロパティのための値を定義するSQL式。 計算されたプロパティは自身のカラムへのマッピングがありません。

source: <literal>type</literal> (optional - defaults to <literal>integer</literal>): The type of the version number.
fr_fr: <emphasis>typename</emphasis> peut être:
ja_jp: <literal>access</literal>（オプション - デフォルトは <literal>property</literal> ）： プロパティの値へのアクセスにHibernateが使う戦略。

source: <literal>unsaved-value</literal> (optional - defaults to <literal>undefined</literal>): A version property value that indicates that an instance is newly instantiated (unsaved), distinguishing it from detached instances that were saved or loaded in a previous session. (<literal>undefined</literal> specifies that the identifier property value should be used.)
fr_fr: Nom d'une classe Java avec un type basique par défaut (ex: <literal>int, float, char, java.lang.String, java.util.Date, java.lang.Integer, java.sql.Clob</literal>).
ja_jp: <literal>unique</literal> (オプション):カラムにユニーク制約をつけるDDLの生成を可能にします。 また、<literal>property-ref</literal> のターゲットとすることもできます。

source: <literal>generated</literal> (optional - defaults to <literal>never</literal>): Specifies that this version property value is actually generated by the database. See the discussion of <xref linkend="mapping-generated"/>generated properties.
fr_fr: Nom d'une classe Java sérialisable.
ja_jp: <literal>not-null</literal> (オプション):カラムにnull値を許可するDDLの生成を可能にします。

source: <literal>insert</literal> (optional - defaults to <literal>true</literal>): Specifies whether the version column should be included in SQL insert statements. May be set to <literal>false</literal> if and only if the database column is defined with a default value of <literal>0</literal>.
fr_fr: Nom d'une classe ayant un type spécifique (ex: <literal>com.illflow.type.MyCustomType</literal>).
ja_jp: <literal>optimistic-lock</literal> (オプション - デフォルトは <literal>true</literal> ): このプロパティの更新に楽観ロックの取得を要求するかどうかを指定します。 言い換えれば、このプロパティがダーティであるときにバージョンを増やすべきかを決定します。

source: Version numbers may be of Hibernate type <literal>long</literal>, <literal>integer</literal>, <literal>short</literal>, <literal>timestamp</literal> or <literal>calendar</literal>.
fr_fr: Si vous n'indiquez pas un type, Hibernate utlisera la réflexion sur le nom de la propriété pour tenter de trouver le type Hibernate correct. Hibernate essayera d'interprêter le nom de la classe retournée par le getter de la propriété en utilisant les régles 2, 3, 4 dans cet ordre. Cependant, ce n'est pas toujours suffisant. Dans certains cas vous aurez encore besoin de l'attribut <literal>type</literal> (Par exemple, pour distinguer <literal>Hibernate.DATE</literal> et <literal>Hibernate.TIMESTAMP</literal>, ou pour préciser un type spécifique).
ja_jp: <literal>generated</literal> (オプション - デフォルトは <literal>never</literal> ): プロパティの値が、データベースによって生成されたことを指定します。 <xref linkend="mapping-generated"/>生成プロパティ を参照してください。

source: A version or timestamp property should never be null for a detached instance, so Hibernate will detect any instance with a null version or timestamp as transient, no matter what other <literal>unsaved-value</literal> strategies are specified. <emphasis>Declaring a nullable version or timestamp property is an easy way to avoid any problems with transitive reattachment in Hibernate, especially useful for people using assigned identifiers or composite keys!</emphasis>
fr_fr: L'attribut <literal>access</literal> permet de contrôler comment Hibernate accèdera à la propriété à l'exécution. Par défaut, Hibernate utilisera les méthodes set/get. Si vous indiquez <literal>access="field"</literal>, Hibernate ignorera les getter/setter et accèdera à la propriété directement en utilisant la réflexion. Vous pouvez spécifier votre propre stratégie d'accès aux propriété en donnant une classe qui implémente l'interface <literal>org.hibernate.property.PropertyAccessor</literal>.
ja_jp: <emphasis>typename</emphasis> には以下の値が可能です：

source: timestamp (optional)
fr_fr: Une fonctionnalité particulièrement intéressante est les propriétés dérivées. Ces propriétés sont par définition en lecture seule, la valeur de la propriété est calculée au chargement. Le calcul est déclaré comme une expression SQL, qui se traduit par une sous-requête <literal>SELECT</literal> dans la requête SQL qui charge une instance :
ja_jp: Hibernateの基本型の名前（例 <literal>integer, string, character, date, timestamp, float, binary, serializable, object, blob</literal> ）。

source: The optional <literal>&lt;timestamp&gt;</literal> element indicates that the table contains timestamped data. This is intended as an alternative to versioning. Timestamps are by nature a less safe implementation of optimistic locking. However, sometimes the application might use the timestamps in other ways.
fr_fr: <![CDATA[ <property name="totalPrice" formula="( SELECT SUM (li.quantity*p.price) FROM LineItem li, Product p WHERE li.productId = p.productId AND li.customerId = customerId AND li.orderNumber = orderNumber )"/>]]>
ja_jp: デフォルトの基本型のJavaクラス名 （例 <literal>int, float, char, java.lang.String, java.util.Date, java.lang.Integer, java.sql.Clob</literal> ）。

source: <![CDATA[<timestamp column="timestamp_column" name="propertyName" access="field|property|ClassName" unsaved-value="null|undefined" source="vm|db" generated="never|always" node="element-name|@attribute-name|element/@attribute|." />]]>
fr_fr: Remarquez que vous pouvez référencer la propre table des entités en ne déclarant pas un alias sur une colonne particulière (<literal>customerId</literal> dans l'exemple donné). Notez aussi que vous pouvez utiliser le sous-élément de mapping <literal>&lt;formula&gt;</literal> plutôt que d'utiliser l'attribut si vous le souhaitez.
ja_jp: シリアライズ可能なJavaクラスの名前。

source: <literal>column</literal> (optional - defaults to the property name): The name of a column holding the timestamp.
fr_fr: many-to-one
ja_jp: カスタム型のクラス名（例 <literal>com.illflow.type.MyCustomType</literal> ）。

source: <literal>name</literal>: The name of a JavaBeans style property of Java type <literal>Date</literal> or <literal>Timestamp</literal> of the persistent class.
fr_fr: Une association ordinaire vers une autre classe persistante est déclarée en utilisant un élément <literal>many-to-one</literal>. Le modèle relationnel est une association de type many-to-one : une clef étrangère dans une table référence la ou les clef(s) primaire(s) dans la table cible.
ja_jp: 型を指定しなければ、Hibernateは正しいHibernateの型を推測するために、 指定されたプロパティに対してリフレクションを使います。 Hibernateはルール2, 3, 4をその順序に使い、 getterプロパティの返り値のクラスの名前を解釈しようとします。 しかしこれで常に十分であるとは限りません。 場合によっては、<literal>type</literal> 属性が必要な場合があります。 （例えば <literal>Hibernate.DATE</literal> と <literal>Hibernate.TIMESTAMP</literal> を区別するため、 またはカスタム型を指定するためなどです。）

source: <literal>unsaved-value</literal> (optional - defaults to <literal>null</literal>): A version property value that indicates that an instance is newly instantiated (unsaved), distinguishing it from detached instances that were saved or loaded in a previous session. (<literal>undefined</literal> specifies that the identifier property value should be used.)
fr_fr: <literal>name</literal> : Nom de la propriété.
ja_jp: 特に強力な特徴は生成プロパティです。 これらのプロパティは当然読み取り専用であり、プロパティの値はロード時に計算されます。 計算をSQL式として宣言すると、このプロパティは インスタンスをロードするSQLクエリの <literal>SELECT</literal> 句のサブクエリに変換されます。

source: <literal>source</literal> (optional - defaults to <literal>vm</literal>): From where should Hibernate retrieve the timestamp value? From the database, or from the current JVM? Database-based timestamps incur an overhead because Hibernate must hit the database in order to determine the "next value", but will be safer for use in clustered environments. Note also, that not all <literal>Dialect</literal>s are known to support retrieving of the database's current timestamp, while others might be unsafe for usage in locking due to lack of precision (Oracle 8 for example).
fr_fr: <literal>column</literal> (optionnel) : Le nom de la clef étrangère. Cela peut être aussi indiqué avec le sous-élément <literal>&lt;column&gt;</literal>.
ja_jp: <![CDATA[ <property name="totalPrice" formula="( SELECT SUM (li.quantity*p.price) FROM LineItem li, Product p WHERE li.productId = p.productId AND li.customerId = customerId AND li.orderNumber = orderNumber )"/>]]>

source: <literal>generated</literal> (optional - defaults to <literal>never</literal>): Specifies that this timestamp property value is actually generated by the database. See the discussion of <xref linkend="mapping-generated"/>generated properties.
fr_fr: <literal>class</literal> (optionnel - par défaut le type de la propriété déterminé par réflexion) : Le nom de la classe associée.
ja_jp: 特定のカラム(例では <literal>customerId</literal> がそれにあたります)のエイリアスを宣言することなく、 エンティティ自身のテーブルを参照できることに注意してください。 もし属性を使用したくなければ、 ネストした <literal>&lt;formula&gt;</literal> マッピング要素を使えることにも注意してください。

source: Note that <literal>&lt;timestamp&gt;</literal> is equivalent to <literal>&lt;version type="timestamp"&gt;</literal>. And <literal>&lt;timestamp source="db"&gt;</literal> is equivalent to <literal>&lt;version type="dbtimestamp"&gt;</literal>
fr_fr: <literal>cascade</literal> (optionnel) : Indique quelles opérations doivent être propagées de l'objet père vers les objets associés.
ja_jp: many-to-one

source: property
fr_fr: <literal>fetch</literal> (optionnel - par défaut à <literal>select</literal>) : Choisit entre le chargement de type outer-join ou le chargement par select successifs.
ja_jp: 他の永続クラスへの通常の関連は <literal>many-to-one</literal> 要素を使って定義します。 リレーショナルモデルは多対一関連です。 つまりあるテーブルの外部キーは、ターゲットとなるテーブルの主キーカラムを参照しています。

source: The <literal>&lt;property&gt;</literal> element declares a persistent, JavaBean style property of the class.
fr_fr: <literal>update, insert</literal> (optionnel - par défaut à <literal>true</literal>) : indique que les colonnes mappées devraient être incluses dans des <literal>UPDATE</literal> SQL et/ou des <literal>INSERT</literal>. Mettre les deux à <literal>false</literal> empêche la propagation en base de données (utile si vous savez qu'un trigger affectera la valeur à la colonne).
ja_jp: <![CDATA[<many-to-one name="propertyName" column="column_name" class="ClassName" cascade="cascade_style" fetch="join|select" update="true|false" insert="true|false" property-ref="propertyNameFromAssociatedClass" access="field|property|ClassName" unique="true|false" not-null="true|false" optimistic-lock="true|false" lazy="proxy|no-proxy|false" not-found="ignore|exception" entity-name="EntityName" formula="arbitrary SQL expression" node="element-name|@attribute-name|element/@attribute|." embed-xml="true|false" index="index_name" unique_key="unique_key_id" foreign-key="foreign_key_name" />]]>

source: <![CDATA[<property name="propertyName" column="column_name" type="typename" update="true|false" insert="true|false" formula="arbitrary SQL expression" access="field|property|ClassName" lazy="true|false" unique="true|false" not-null="true|false" optimistic-lock="true|false" generated="never|insert|always" node="element-name|@attribute-name|element/@attribute|." index="index_name" unique_key="unique_key_id" length="L" precision="P" scale="S" />]]>
fr_fr: <literal>property-ref</literal> : (optionnel) Le nom d'une propriété de la classe associée qui est liée à cette clef étrangère. Si ce n'est pas spécifié, la clef primaire de la classe associée est utilisée.
ja_jp: <literal>name</literal>：プロパティ名。

source: <literal>name</literal>: the name of the property, with an initial lowercase letter.
fr_fr: <literal>access</literal> (optionnel - par défaut à <literal>property</literal>) : La stratégie à utiliser par Hibernate pour accéder à la valeur de cette propriété.
ja_jp: <literal>column</literal> (オプション):外部キーカラムの名前。 ネストした <literal>&lt;column&gt;</literal> 要素でも指定できます。

source: <literal>column</literal> (optional - defaults to the property name): the name of the mapped database table column. This may also be specified by nested <literal>&lt;column&gt;</literal> element(s).
fr_fr: <literal>unique</literal> (optionnel) : Génère le DDL d'une contrainte d'unicité pour la clef étrangère. Permet aussi d'en faire la cible d'un <literal>property-ref</literal>. Cela permet de créer une véritable association one-to-one.
ja_jp: <literal>class</literal>（オプション - デフォルトは、 リフレクションにより決定されるプロパティの型）：関連クラスの名前。

source: <literal>type</literal> (optional): a name that indicates the Hibernate type.
fr_fr: <literal>not-null</literal> (optionnel) : Génère le DDL pour une contrainte de non nullité pour la clef étrangère.
ja_jp: <literal>cascade</literal>（オプション）： どの操作を、親オブジェクトから関連オブジェクトへとカスケードさせるかを指定します。

source: <literal>update, insert</literal> (optional - defaults to <literal>true</literal>) : specifies that the mapped columns should be included in SQL <literal>UPDATE</literal> and/or <literal>INSERT</literal> statements. Setting both to <literal>false</literal> allows a pure "derived" property whose value is initialized from some other property that maps to the same colum(s) or by a trigger or other application.
fr_fr: <literal>optimistic-lock</literal> (optionnel - par défaut à <literal>true</literal>) : Indique que les mises à jour de cette propriété requièrent ou non l'acquisition d'un verrou optimiste. En d'autres termes, détermine si un incrément de version doit avoir lieu quand la propriété est marquée obsolète (dirty).
ja_jp: <literal>fetch</literal> (オプション - デフォルトは <literal>select</literal> ): 外部結合フェッチか順次選択フェッチ（sequential select fetch）を選択します。

source: <literal>formula</literal> (optional): an SQL expression that defines the value for a <emphasis>computed</emphasis> property. Computed properties do not have a column mapping of their own.
fr_fr: <literal>lazy</literal> (optionnel - par défaut à <literal>false</literal>) : Indique que cette propriété doit être chargée en différé (lazy loading) au premier accès à la variable d'instance (nécessite une instrumentation du bytecode lors de la phase de construction). Remarquez que cela n'influence pas le comportement du proxy Hibernate - comme l'attribut <literal>lazy</literal> sur des classes ou des mappings de collections, mais utilise l'interception pour le chargement différé. <literal>lazy="false"</literal> indique que l'association sera toujours chargée.
ja_jp: <literal>update, insert</literal>（オプション - デフォルトは <literal>true</literal> ）： マッピングされたカラムがSQLの <literal>UPDATE</literal> または <literal>INSERT</literal> 文に含まれることを指定します。 両方とも <literal>false</literal> に設定すると、 その値が同じカラムにマッピングされた他のプロパティやトリガや 他のアプリケーションによって初期化された純粋な「導出」プロパティが可能になります。

source: <literal>lazy</literal> (optional - defaults to <literal>false</literal>): Specifies that this property should be fetched lazily when the instance variable is first accessed (requires build-time bytecode instrumentation).
fr_fr: <literal>entity-name</literal> (optionnel) : Le nom de l'entité de la classe associée.
ja_jp: <literal>access</literal>（オプション - デフォルトは <literal>property</literal> ）： プロパティの値へのアクセスにHibernateが使う戦略。

source: <literal>unique</literal> (optional): Enable the DDL generation of a unique constraint for the columns. Also, allow this to be the target of a <literal>property-ref</literal>.
fr_fr: <literal>formula</literal> (optionnel) : une expression SQL qui définit la valeur pour une clé étrangère calculée.
ja_jp: <literal>unique</literal>（オプション）： 外部キーカラムに対してユニーク制約をつけたDDLの生成を可能にします。 また、<literal>property-ref</literal> のターゲットにすることもできます。 これにより関連の多重度を効果的に一対一にします。

source: <literal>not-null</literal> (optional): Enable the DDL generation of a nullability constraint for the columns.
fr_fr: Donner une valeur significative à l'attribut <literal>cascade</literal> autre que <literal>none</literal> propagera certaines opérations à l'objet associé. Les valeurs significatives sont les noms des opérations Hibernate basiques, <literal>persist, merge, delete, save-update, evict, replicate, lock, refresh</literal>, ainsi que les valeurs spéciales <literal>delete-orphan</literal> et <literal>all</literal> et des combinaisons de noms d'opérations séparées par des virgules, comme par exemple <literal>cascade="persist,merge,evict"</literal> ou <literal>cascade="all,delete-orphan"</literal>. Voir <xref linkend="objectstate-transitive"/> pour une explication complète. Notez que les assocations many-to-one et one-to-one ne supportent pas orphan delete.
ja_jp: <literal>not-null</literal> (オプション):外部キーカラムに対して、 null値を許可するDDLの生成を可能にします

source: <literal>optimistic-lock</literal> (optional - defaults to <literal>true</literal>): Specifies that updates to this property do or do not require acquisition of the optimistic lock. In other words, determines if a version increment should occur when this property is dirty.
fr_fr: Une déclaration <literal>many-to-one</literal> typique est aussi simple que :
ja_jp: <literal>optimistic-lock</literal> (オプション - デフォルトは <literal>true</literal> ): このプロパティの更新に楽観的ロックの取得を要求するかどうかを指定します。 言い換えれば、このプロパティがダーティであるときにバージョンを増やすべきかを決定します。

source: <literal>generated</literal> (optional - defaults to <literal>never</literal>): Specifies that this property value is actually generated by the database. See the discussion of <xref linkend="mapping-generated"/>generated properties.
fr_fr: <![CDATA[<many-to-one name="product" class="Product" column="PRODUCT_ID"/>]]>
ja_jp: <literal>lazy</literal> (オプション - デフォルトは <literal>proxy</literal> ): デフォルトでは、多重度１の関連がプロキシとなります。 <literal>lazy="no-proxy"</literal> は、インスタンス変数に最初にアクセスしたときに、 プロパティを遅延フェッチするよう指定します (ビルド時にバイトコード実装が必要になります)。 <literal>lazy="false"</literal> は関連を常に即時にフェッチするよう指定します。
