Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/basic_mapping.po
Languages: fr_fr, ja_jp

source: <literal>increment_size</literal> (optional, defaults to <literal>1</literal>): The value by which subsequent calls to the sequence/table should differ. In sequence creation terms, this is analogous to the clause typical named "INCREMENT BY".
fr_fr: <literal>name</literal> (optionnel, requis pour cette approche) : une propriété de type composant qui contient l'identifiant composé (voir chapitre 9).
ja_jp: <![CDATA[<composite-id class="MedicareId" mapped="true"> <key-property name="medicareNumber"/> <key-property name="dependent"/> </composite-id>]]>

source: <literal>force_table_use</literal> (optional, defaults to <literal>false</literal>): Should we force the use of a table as the backing structure even though the dialect might support sequence?
fr_fr: <literal>access</literal> (optionnel - défaut à <literal>property</literal>) : La stratégie qu'Hibernate utilisera pour accéder à la valeur de la propriété.
ja_jp: この例では、複合識別子クラス（ <literal>MedicareId</literal> ）とエンティティクラス自身の両方が、 <literal>medicareNumber</literal> と <literal>dependent</literal> という名前のプロパティを持ちます。 識別子クラスは、<literal>equals()</literal> と <literal>hashCode()</literal> をオーバライドし、 <literal>Serializable</literal> を実装しなくてはなりません。 この方法には、明らかにコードが重複するという不都合があります。

source: <literal>value_column</literal> (optional, defaults to <literal>next_val</literal>): Only relevant for table structures! The name of the column on the table which is used to hold the value.
fr_fr: <literal>class</literal> (optionnel - défaut au type de la propriété déterminé par réflexion) : La classe composant utilisée comme identifiant (voir prochaine section).
ja_jp: 次の属性はマッピングした複合識別子を指定するために使用します。

source: <literal>optimizer</literal> (optional, defaults to <literal>none</literal>): See
fr_fr: Cette dernière approche est celle que nous recommandons pour toutes vos applications.
ja_jp: <literal>mapped</literal> (オプション、デフォルトは <literal>false</literal> ): マッピングした複合識別子が使用されることと、包含されたプロパティのマッピングが、 エンティティクラスと複合識別子クラスの両方を参照することを示します。

source: The second of these new generators is <literal>org.hibernate.id.enhanced.TableGenerator</literal> which is intended firstly as a replacement for the <literal>table</literal> generator (although it actually functions much more like <literal>org.hibernate.id.MultipleHiLoPerTableGenerator</literal>) and secondly as a re-implementation of <literal>org.hibernate.id.MultipleHiLoPerTableGenerator</literal> utilizing the notion of pluggable optimiziers. Essentially this generator defines a table capable of holding a number of different increment values simultaneously by using multiple distinctly keyed rows. This generator has a number of configuration parameters:
fr_fr: discriminator
ja_jp: <literal>class</literal> (オプション,ただしマッピングした複合識別子には必須): 複合識別子として使用するクラス。

source: <literal>table_name</literal> (optional, defaults to <literal>hibernate_sequences</literal>): The name of the table to be used.
fr_fr: L'élément <literal>&lt;discriminator&gt;</literal> est nécessaire pour la persistance polymorphique qui utilise la stratégie de mapping de table par hiérarchie de classe. La colonne discriminante contient une valeur marqueur qui permet à la couche de persistance de savoir quelle sous-classe instancier pour une ligne particulière de table en base. Un nombre restreint de types peuvent être utilisés : <literal>string</literal>, <literal>character</literal>, <literal>integer</literal>, <literal>byte</literal>, <literal>short</literal>, <literal>boolean</literal>, <literal>yes_no</literal>, <literal>true_false</literal>.
ja_jp: 3つ目のさらに便利な方法は、複合識別子を<xref linkend="components-compositeid"/>内の コンポーネントクラスとして実装することです。 下で記述している属性は、この代替方法にのみ適用されます。

source: <literal>value_column_name</literal> (optional, defaults to <literal>next_val</literal>): The name of the column on the table which is used to hold the value.
fr_fr: <![CDATA[<discriminator column="discriminator_column" type="discriminator_type" force="true|false" insert="true|false" formula="arbitrary sql expression" />]]>
ja_jp: <literal>name</literal> (オプション, このアプローチでは必須): 複合識別子を保持するコンポーネントタイプのプロパティ(9章を参照してください).

source: <literal>segment_column_name</literal> (optional, defaults to <literal>sequence_name</literal>): The name of the column on the table which is used to hold the "segement key". This is the value which distinctly identifies which increment value to use.
fr_fr: <literal>column</literal> (optionnel - par défaut à <literal>class</literal>) le nom de la colonne discriminante.
ja_jp: <literal>access</literal> (オプション - デフォルトは <literal>property</literal> ): Hibernateがプロパティの値にアクセスするために使用すべき戦略。

source: <literal>segment_value</literal> (optional, defaults to <literal>default</literal>): The "segment key" value for the segment from which we want to pull increment values for this generator.
fr_fr: <literal>type</literal> (optionnel - par défaut à <literal>string</literal>) un nom indiquant le type Hibernate.
ja_jp: <literal>class</literal> （オプション - デフォルトはリフレクションにより決定されるプロパティの型）： 複合識別子として使われるコンポーネントのクラス（次の節を見てください）。

source: <literal>segment_value_length</literal> (optional, defaults to <literal>255</literal>): Used for schema generation; the column size to create this segment key column.
fr_fr: <literal>force</literal> (optionnel - par défaut à <literal>false</literal>) "oblige" Hibernate à spécifier une valeur discriminante autorisée même quand on récupère toutes les instances de la classe de base.
ja_jp: この3つ目の方法は <emphasis> 識別子コンポーネント</emphasis> と呼び、 ほとんどすべてのアプリケーションに対して推奨する方法です。

source: <literal>initial_value</literal> (optional, defaults to <literal>1</literal>): The initial value to be retrieved from the table.
fr_fr: <literal>insert</literal> (optionnel - par défaut à <literal>true</literal>) à passer à <literal>false</literal> si la colonne discriminante fait aussi partie d'un identifiant composé mappé (Indique à Hibernate de ne pas inclure la colonne dans les <literal>INSERT</literal> SQL).
ja_jp: discriminator

source: <literal>increment_size</literal> (optional, defaults to <literal>1</literal>): The value by which subsequent calls to the table should differ.
fr_fr: <literal>formula</literal> (optionnel) une expression SQL arbitraire qui est exécutée quand un type doit être évalué. Permet la discrimination basée sur le contenu.
ja_jp: <literal>&lt;discriminator&gt;</literal> 要素は、 table-per-class-hierarchyマッピング戦略を使うポリモーフィックな永続化に必要であり、 テーブルの識別カラムを定義します。 識別カラムは、ある行に対して永続層がどのサブクラスをインスタンス化するかを 伝えるマーカー値を含んでいます。 以下のような型に制限されます： <literal>string</literal> , <literal>character</literal> , <literal>integer</literal>, <literal>byte</literal> , <literal>short</literal> , <literal>boolean</literal> , <literal>yes_no</literal> , <literal>true_false</literal>.

source: <literal>optimizer</literal> (optional, defaults to <literal></literal>): See
fr_fr: Les véritables valeurs de la colonne discriminante sont spécifiées par l'attribut <literal>discriminator-value</literal> des éléments <literal>&lt;class&gt;</literal> et <literal>&lt;subclass&gt;</literal>.
ja_jp: <![CDATA[<discriminator column="discriminator_column" type="discriminator_type" force="true|false" insert="true|false" formula="arbitrary sql expression" />]]>

source: Identifier generator optimization
fr_fr: L'attribut <literal>force</literal> n'est utile que si la table contient des lignes avec des valeurs "extra" discriminantes qui ne sont pas mappées à une classe persistante. Ce ne sera généralement pas le cas.
ja_jp: <literal>column</literal>（オプション - デフォルトは <literal>class</literal> ）： 識別カラムの名前。

source: For identifier generators which store values in the database, it is inefficient for them to hit the database on each and every call to generate a new identifier value. Instead, you'd ideally want to group a bunch of them in memory and only hit the database when you have exhausted your in-memory value group. This is the role of the pluggable optimizers. Currently only the two enhanced generators (<xref linkend="mapping-declaration-id-enhanced"/> support this notion.
fr_fr: En utilisant l'attribut <literal>formula</literal> vous pouvez déclarer une expression SQL arbitraire qui sera utilisée pour évaluer le type d'une ligne :
ja_jp: <literal>type</literal> （オプション - デフォルトは <literal>string</literal> ）：Hibernateの型を示す名前。

source: <literal>none</literal> (generally this is the default if no optimizer was specified): This says to not perform any optimizations, and hit the database each and every request.
fr_fr: <![CDATA[<discriminator formula="case when CLASS_TYPE in ('a', 'b', 'c') then 0 else 1 end" type="integer"/>]]>
ja_jp: <literal>force</literal> （オプション - デフォルトは <literal>false</literal> ）： ルートクラスのすべてのインスタンスを検索する場合であっても、 Hibernateが使用できる識別カラムの指定を「強制」します。

source: <literal>hilo</literal>: applies a hi/lo algorithm around the database retrieved values. The values from the database for this optimizer are expected to be sequential. The values retrieved from the database structure for this optimizer indicates the "group number"; the <literal>increment_size</literal> is multiplied by that value in memory to define a group "hi value".
fr_fr: version (optionnel)
ja_jp: <literal>insert</literal> （オプション - デフォルトは <literal>true</literal> ）： もし識別カラムがマッピングする複合識別子の一部ならば、<literal>false</literal> と設定してください。 (HibernateにSQLの <literal>INSERT</literal> には含まれないことを知らせる)

source: <literal>pooled</literal>: like was discussed for <literal>hilo</literal>, this optimizers attempts to minimize the number of hits to the database. Here, however, we simply store the starting value for the "next group" into the database structure rather than a sequential value in combination with an in-memory grouping algorithm. <literal>increment_size</literal> here refers to the values coming from the database.
fr_fr: L'élément <literal>&lt;version&gt;</literal> est optionnel et indique que la table contient des données versionnées. C'est particulièrement utile si vous avez l'intention d'utiliser des <emphasis>transactions longues</emphasis> (voir plus-bas).
ja_jp: <literal>formula</literal> (オプション)型が評価されるときに実行される任意のSQL式。 コンテンツベースの識別を可能にします。

source: composite-id
fr_fr: <![CDATA[<version column="version_column" name="propertyName" type="typename" access="field|property|ClassName" unsaved-value="null|negative|undefined" generated="never|always" insert="true|false" node="element-name|@attribute-name|element/@attribute|." />]]>
ja_jp: 識別カラムの実際の値は、 <literal>&lt;class&gt;</literal> と <literal>&lt;subclass&gt;</literal> 要素の <literal>discriminator-value</literal> 属性で指定されます。

source: <![CDATA[<composite-id name="propertyName" class="ClassName" mapped="true|false" access="field|property|ClassName"> node="element-name|." <key-property name="propertyName" type="typename" column="column_name"/> <key-many-to-one name="propertyName class="ClassName" column="column_name"/> ...... </composite-id>]]>
fr_fr: <literal>column</literal> (optionnel - par défaut égal au nom de la propriété) : Le nom de la colonne contenant le numéro de version.
ja_jp: 永続クラスへマッピングされない｢余分な」識別値を持つ行が テーブルにあれば、（そのときに限り）<literal>force</literal> 属性は有効です。 ただし、普通はそういうことはありません。

source: For a table with a composite key, you may map multiple properties of the class as identifier properties. The <literal>&lt;composite-id&gt;</literal> element accepts <literal>&lt;key-property&gt;</literal> property mappings and <literal>&lt;key-many-to-one&gt;</literal> mappings as child elements.
fr_fr: <literal>name</literal> : Le nom d'un attribut de la classe persistante.
ja_jp: <literal>formula</literal> 属性を使うと、行の型を評価するために任意のSQL式を宣言できます。

source: <![CDATA[<composite-id> <key-property name="medicareNumber"/> <key-property name="dependent"/> </composite-id>]]>
fr_fr: <literal>type</literal> (optionnel - par défaut à <literal>integer</literal>) : Le type du numéro de version.
ja_jp: <![CDATA[<discriminator formula="case when CLASS_TYPE in ('a', 'b', 'c') then 0 else 1 end" type="integer"/>]]>

source: Your persistent class <emphasis>must</emphasis> override <literal>equals()</literal> and <literal>hashCode()</literal> to implement composite identifier equality. It must also implements <literal>Serializable</literal>.
fr_fr: <literal>access</literal> (optionnel - par défaut à <literal>property</literal>) : La stratégie à utiliser par Hibernate pour accéder à la valeur de la propriété.
ja_jp: version（オプション）

source: Unfortunately, this approach to composite identifiers means that a persistent object is its own identifier. There is no convenient "handle" other than the object itself. You must instantiate an instance of the persistent class itself and populate its identifier properties before you can <literal>load()</literal> the persistent state associated with a composite key. We call this approach an <emphasis>embedded</emphasis> composite identifier, and discourage it for serious applications.
fr_fr: <literal>unsaved-value</literal> (optionnel - par défaut à <literal>undefined</literal>) : Une valeur de la propriété d'identifiant qui indique que l'instance est nouvellement instanciée (non sauvegardée), et qui la distingue des instances détachées qui ont été sauvegardées ou chargées dans une session précédente (<literal>undefined</literal> indique que la valeur de l'atribut identifiant devrait être utilisé).
ja_jp: <literal>&lt;version&gt;</literal> 要素はオプションであり、 テーブルがバージョンデータを含むことを示します。 これは <emphasis>ロングトランザクション</emphasis> を使うつもりなら、特に役立ちます（以下を見てください）。

source: A second approach is what we call a <emphasis>mapped</emphasis> composite identifier, where the identifier properties named inside the <literal>&lt;composite-id&gt;</literal> element are duplicated on both the persistent class and a separate identifier class.
fr_fr: <literal>generated</literal> (optional - défaut à <literal>never</literal>) : Indique que la valeur de la propriété version est générée par la base de données cf. <xref linkend="mapping-generated"/>generated properties.
ja_jp: <![CDATA[<version column="version_column" name="propertyName" type="typename" access="field|property|ClassName" unsaved-value="null|negative|undefined" generated="never|always" insert="true|false" node="element-name|@attribute-name|element/@attribute|." />]]>

source: <![CDATA[<composite-id class="MedicareId" mapped="true"> <key-property name="medicareNumber"/> <key-property name="dependent"/> </composite-id>]]>
fr_fr: <literal>insert</literal> (optionnel - défaut à <literal>true</literal>) : Indique si la colonne de version doit être incluse dans les ordres insert. Peut être à <literal>false</literal> si et seulement si la colonne de la base de données est définie avec une valeur par défaut à <literal>0</literal>.
ja_jp: <literal>column</literal>（オプション - デフォルトはプロパティ名）: バージョン番号を保持するカラムの名前。

source: In this example, both the composite identifier class, <literal>MedicareId</literal>, and the entity class itself have properties named <literal>medicareNumber</literal> and <literal>dependent</literal>. The identifier class must override <literal>equals()</literal> and <literal>hashCode()</literal> and implement. <literal>Serializable</literal>. The disadvantage of this approach is quite obvious&mdash;code duplication.
fr_fr: Les numéros de version doivent avoir les types Hibernate <literal>long</literal>, <literal>integer</literal>, <literal>short</literal>, <literal>timestamp</literal> ou <literal>calendar</literal>.
ja_jp: <literal>name</literal> ：永続クラスのプロパティの名前。

source: The following attributes are used to specify a mapped composite identifier:
fr_fr: Une propriété de version ou un timestamp ne doit jamais être null pour une instance détachée, ainsi Hibernate pourra détecter toute instance ayant une version ou un timestamp null comme transient, quelles que soient les stratégies <literal>unsaved-value</literal> spécifiées. <emphasis>Déclarer un numéro de version ou un timestamp "nullable" est un moyen pratique d'éviter tout problème avec les réattachements transitifs dans Hibernate, particulièrement utile pour ceux qui utilisent des identifiants assignés ou des clefs composées !</emphasis>
ja_jp: <literal>type</literal> （オプション - デフォルトは <literal>integer</literal> ）：バージョン番号の型。

source: <literal>mapped</literal> (optional, defaults to <literal>false</literal>): indicates that a mapped composite identifier is used, and that the contained property mappings refer to both the entity class and the composite identifier class.
fr_fr: timestamp (optionnel)
ja_jp: <literal>access</literal> （オプション - デフォルトは <literal>property</literal> ）： プロパティの値へのアクセスにHibernateが使う戦略。

source: <literal>class</literal> (optional, but required for a mapped composite identifier): The class used as a composite identifier.
fr_fr: L'élément optionnel <literal>&lt;timestamp&gt;</literal> indique que la table contient des données horodatées (timestamp). Cela sert d'alternative à l'utilisation de numéros de version. Les timestamps (ou horodatage) sont par nature une implémentation moins fiable pour l'optimistic locking. Cependant, l'application peut parfois utiliser l'horodatage à d'autres fins.
ja_jp: <literal>unsaved-value</literal> （オプション - デフォルトは <literal>undefined</literal> ）： インスタンスが新しくインスタンス化されたことを示す （セーブされていないことを示す）バージョンプロパティの値。 以前のSessionでセーブまたはロードされた一時的なインスタンスと区別するために 使います。 （ <literal>undefined</literal> は識別子プロパティの値が使われることを指定します。）

source: We will describe a third, even more convenient approach where the composite identifier is implemented as a component class in <xref linkend="components-compositeid"/>. The attributes described below apply only to this alternative approach:
fr_fr: <![CDATA[<timestamp column="timestamp_column" name="propertyName" access="field|property|ClassName" unsaved-value="null|undefined" source="vm|db" generated="never|always" node="element-name|@attribute-name|element/@attribute|." />]]>
ja_jp: <literal>generated</literal> (オプション - デフォルトは <literal>never</literal> ): このバージョンのプロパティの値が、データベースによって生成されたことを指定します。 <xref linkend="mapping-generated"/>生成プロパティ の議論を見てください。

source: <literal>name</literal> (optional, required for this approach): A property of component type that holds the composite identifier (see chapter 9).
fr_fr: <literal>column</literal> (optionnel - par défaut à le nom de la propriété) : Le nom d'une colonne contenant le timestamp.
ja_jp: <literal>insert</literal> (オプション - デフォルトは <literal>true</literal> ): SQLのinsert文にバージョン・カラムを含めるべきかどうかを指定します。 もしデータベース・カラムのデフォルト値が <literal>0</literal> と定義されるときには、 <literal>false</literal> に設定すると良いでしょう。

source: <literal>class</literal> (optional - defaults to the property type determined by reflection): The component class used as a composite identifier (see next section).
fr_fr: <literal>access</literal> (optionnel - par défaut à <literal>property</literal>) : La stratégie à utiliser par Hibernate pour accéder à la valeur de la propriété.
ja_jp: バージョンやタイムスタンプのプロパティは、分離されたインスタンスに対してnullであってはなりません。 そのためどのような <literal>unsaved-value</literal> 戦略が指定されても、 Hibernateはnullのバージョンやタイムスタンプを持ったすべてのインスタンスを、 一時的なものであると判断します。 <emphasis> nullを許容するバージョンやタイムスタンプのプロパティを定義することは、 過渡的に一時オブジェクトとすることを防ぐ簡単な方法です。 特に識別子の割り当てや複合キーを使用しているときには特に有用です。</emphasis>

source: This third approach, an <emphasis>identifier component</emphasis> is the one we recommend for almost all applications.
fr_fr: <literal>unsaved-value</literal> (optionnel - par défaut à <literal>null</literal>) : Propriété dont la valeur est un numéro de version qui indique que l'instance est nouvellement instanciée (non sauvegardée), et qui la distingue des instances détachées qui ont été sauvegardées ou chargées dans une session précédente (<literal>undefined</literal> indique que la valeur de l'attribut identifiant devrait être utilisée).
ja_jp: timestamp（オプション）

source: discriminator
fr_fr: <literal>source</literal> (optionnel - par défaut à <literal>vm</literal>) : D'où Hibernate doit-il récupérer la valeur du timestamp? Depuis la base de données ou depuis la JVM d'exécution? Les valeurs de timestamp de la base de données provoquent une surcharge puisque Hibernate doit interroger la base pour déterminer la prochaine valeur mais cela est plus sûr lorsque vous fonctionnez dans un cluster. Remarquez aussi que certains des dialectes ne supportent pas cette fonction, et que d'autres l'implémentent mal, provoquant des erreurs de précision (Oracle 8 par exemple).
ja_jp: オプションの <literal>&lt;timestamp&gt;</literal> 要素は、 テーブルがタイムスタンプデータを含むことを示します。 これはバージョン付けの代わりの方法として用意されています。 タイムスタンプはもともと楽観的ロックにおける安全性の低い実装です。 しかしアプリケーションは異なる用途で使うこともあるかもしれません。

source: The <literal>&lt;discriminator&gt;</literal> element is required for polymorphic persistence using the table-per-class-hierarchy mapping strategy and declares a discriminator column of the table. The discriminator column contains marker values that tell the persistence layer what subclass to instantiate for a particular row. A restricted set of types may be used: <literal>string</literal>, <literal>character</literal>, <literal>integer</literal>, <literal>byte</literal>, <literal>short</literal>, <literal>boolean</literal>, <literal>yes_no</literal>, <literal>true_false</literal>.
fr_fr: <literal>generated</literal> (optional - défaut à <literal>never</literal>) : Indique que la valeur de ce timestamp est générée par la base de données cf. <xref linkend="mapping-generated"/>generated properties.
ja_jp: <![CDATA[<timestamp column="timestamp_column" name="propertyName" access="field|property|ClassName" unsaved-value="null|undefined" source="vm|db" generated="never|always" node="element-name|@attribute-name|element/@attribute|." />]]>

source: <![CDATA[<discriminator column="discriminator_column" type="discriminator_type" force="true|false" insert="true|false" formula="arbitrary sql expression" />]]>
fr_fr: Notez que <literal>&lt;timestamp&gt;</literal> est équivalent à <literal>&lt;version type="timestamp"&gt;</literal>.
ja_jp: <literal>column</literal>（オプション - デフォルトはプロパティ名）： タイムスタンプを保持するカラムの名前。

source: <literal>column</literal> (optional - defaults to <literal>class</literal>) the name of the discriminator column.
fr_fr: property
ja_jp: <literal>name</literal> ： 永続クラスであるJava の <literal>Date</literal>型 または <literal>Timestamp</literal> 型 の、JavaBeansスタイルプロパティの名前。

source: <literal>type</literal> (optional - defaults to <literal>string</literal>) a name that indicates the Hibernate type
fr_fr: L'élément <literal>&lt;property&gt;</literal> déclare une propriété de la classe au sens JavaBean.
ja_jp: <literal>access</literal> （オプション - デフォルトは <literal>property</literal> ）： プロパティの値へのアクセスにHibernateが使う戦略。

source: <literal>force</literal> (optional - defaults to <literal>false</literal>) "force" Hibernate to specify allowed discriminator values even when retrieving all instances of the root class.
fr_fr: <![CDATA[<property name="propertyName" column="column_name" type="typename" update="true|false" insert="true|false" formula="arbitrary SQL expression" access="field|property|ClassName" lazy="true|false" unique="true|false" not-null="true|false" optimistic-lock="true|false" generated="never|insert|always" node="element-name|@attribute-name|element/@attribute|." index="index_name" unique_key="unique_key_id" length="L" precision="P" scale="S" />]]>
ja_jp: <literal>unsaved-value</literal> （オプション - デフォルトは <literal>null</literal> ）： インスタンスが新しくインスタンス化された （セーブされていない）ことを示すバージョンプロパティの値。 以前のSessionでセーブまたはロードされた一時的なインスタンスと 区別するために使われます。 （ <literal>undefined</literal> と指定すると、 識別子プロパティの値が使われます。）
