Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/configuration.po
Languages: fr_fr

source: Set the JDBC transaction isolation level. Check <literal>java.sql.Connection</literal> for meaningful values but note that most databases do not support all isolation levels.
fr_fr: Définit le niveau d'isolation des transactions JDBC. Regardez <literal>java.sql.Connection</literal> pour connaître le sens des différentes valeurs mais notez également que la plupart des bases de données ne supportent pas tous les niveaux d'isolation.

source: <emphasis role="strong">eg.</emphasis> <literal>1, 2, 4, 8</literal>
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>1, 2, 4, 8</literal>

source: Enables autocommit for JDBC pooled connections (not recommended).
fr_fr: Active le mode de commit automatique (autocommit) pour les connexions JDBC du pool (non recommandé).

source: Specify when Hibernate should release JDBC connections. By default, a JDBC connection is held until the session is explicitly closed or disconnected. For an application server JTA datasource, you should use <literal>after_statement</literal> to aggressively release connections after every JDBC call. For a non-JTA connection, it often makes sense to release the connection at the end of each transaction, by using <literal>after_transaction</literal>. <literal>auto</literal> will choose <literal>after_statement</literal> for the JTA and CMT transaction strategies and <literal>after_transaction</literal> for the JDBC transaction strategy.
fr_fr: Spécifie à quel moment Hibernate doit relacher les connexion JDBC. Par défaut une connexion JDBC est conservée jusqu'à ce que la session soit explicitement fermée ou déconnectée. Pour une source de données JTA d'un serveur d'application, vous devriez utiliser <literal>after_statement</literal> pour libérer les connexions de manière plus agressive après chaque appel JDBC. Pour une connexion non JTA, il est souvent préférable de libérer la connexion à la fin de chaque transaction en utilisant <literal>after_transaction</literal>. <literal>auto</literal> choisira <literal>after_statement</literal> pour des transactions JTA et CMT et <literal>after_transaction</literal> pour des transactions JDBC.

source: <emphasis role="strong">eg.</emphasis> <literal>auto</literal> (default) | <literal>on_close</literal> | <literal>after_transaction</literal> | <literal>after_statement</literal>
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>on_close</literal> (default) | <literal>after_transaction</literal> | <literal>after_statement</literal> | <literal>auto</literal>

source: Note that this setting only affects <literal>Session</literal>s returned from <literal>SessionFactory.openSession</literal>. For <literal>Session</literal>s obtained through <literal>SessionFactory.getCurrentSession</literal>, the <literal>CurrentSessionContext</literal> implementation configured for use controls the connection release mode for those <literal>Session</literal>s. See
fr_fr: hibernate.connection.<emphasis>&lt;propertyName&gt;</emphasis>

source: hibernate.connection.<emphasis>&lt;propertyName&gt;</emphasis>
fr_fr: Passe la propriété JDBC<literal>propertyName</literal> à <literal>DriverManager.getConnection()</literal>.

source: Pass the JDBC property <literal>propertyName</literal> to <literal>DriverManager.getConnection()</literal>.
fr_fr: hibernate.jndi.<emphasis>&lt;propertyName&gt;</emphasis>

source: hibernate.jndi.<emphasis>&lt;propertyName&gt;</emphasis>
fr_fr: Passe la propriété <literal>propertyName</literal> à l'<literal>InitialContextFactory</literal> de JNDI.

source: Pass the property <literal>propertyName</literal> to the JNDI <literal>InitialContextFactory</literal>.
fr_fr: Propriétés du Cache d'Hibernate

source: Hibernate Cache Properties
fr_fr: Nom de la propriété

source: hibernate.cache.provider_class
fr_fr: Le nom de classe d'un <literal>CacheProvider</literal> spécifique.

source: The classname of a custom <literal>CacheProvider</literal>.
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>nom.de.classe.du.CacheProvider</literal>

source: <emphasis role="strong">eg.</emphasis> <literal>classname.of.CacheProvider</literal>
fr_fr: hibernate.cache.use_minimal_puts

source: hibernate.cache.use_minimal_puts
fr_fr: Optimise le cache de second niveau en minimisant les écritures, au prix de plus de lectures. Ce paramètre est surtout utile pour les caches en cluster et est activé par défaut dans hibernate3 pour les implémentations de cache en cluster.

source: Optimize second-level cache operation to minimize writes, at the cost of more frequent reads. This setting is most useful for clustered caches and, in Hibernate3, is enabled by default for clustered cache implementations.
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>true|false</literal>

source: hibernate.cache.use_query_cache
fr_fr: Activer le cache de requête, les requêtes individuelles doivent tout de même être déclarées comme pouvant être mise en cache.

source: Enable the query cache, individual queries still have to be set cachable.
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>true|false</literal>

source: hibernate.cache.use_second_level_cache
fr_fr: Peut être utilisé pour désactiver complètement le cache de second niveau qui est activé par défaut pour les classes qui spécifient un élément <literal>&lt;cache&gt;</literal> dans leur mapping.

source: May be used to completely disable the second level cache, which is enabled by default for classes which specify a <literal>&lt;cache&gt;</literal> mapping.
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>true|false</literal>

source: hibernate.cache.query_cache_factory
fr_fr: Le nom de classe d'une interface <literal>QueryCacheFactory</literal> , par défaut = built-in <literal>StandardQueryCacheFactory</literal>.

source: The classname of a custom <literal>QueryCache</literal> interface, defaults to the built-in <literal>StandardQueryCache</literal>.
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>nom.de.la.classe.de.QueryCacheFactory</literal>

source: <emphasis role="strong">eg.</emphasis> <literal>classname.of.QueryCache</literal>
fr_fr: hibernate.cache.region_prefix

source: hibernate.cache.region_prefix
fr_fr: Un préfixe à utiliser pour le nom des régions du cache de second niveau.

source: A prefix to use for second-level cache region names.
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>prefix</literal>

source: <emphasis role="strong">eg.</emphasis> <literal>prefix</literal>
fr_fr: hibernate.cache.use_structured_entries

source: hibernate.cache.use_structured_entries
fr_fr: Force Hibernate à stocker les données dans le cache de second niveau dans un format plus adapté à la visualisation par un humain.

source: Forces Hibernate to store data in the second-level cache in a more human-friendly format.
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>true|false</literal>

source: Hibernate Transaction Properties
fr_fr: Nom de la propriété

source: hibernate.transaction.factory_class
fr_fr: Le nom de classe d'une <literal>TransactionFactory</literal> qui sera utilisée par l'API <literal>Transaction</literal> d'Hibernate (la valeur par défaut est <literal>JDBCTransactionFactory</literal>).

source: The classname of a <literal>TransactionFactory</literal> to use with Hibernate <literal>Transaction</literal> API (defaults to <literal>JDBCTransactionFactory</literal>).
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>nom.de.classe.d.une.TransactionFactory</literal>

source: <emphasis role="strong">eg.</emphasis> <literal>classname.of.TransactionFactory</literal>
fr_fr: jta.UserTransaction

source: jta.UserTransaction
fr_fr: Le nom JNDI utilisé par la <literal>JTATransactionFactory</literal> pour obtenir la <literal>UserTransaction</literal> JTA du serveur d'applications.

source: A JNDI name used by <literal>JTATransactionFactory</literal> to obtain the JTA <literal>UserTransaction</literal> from the application server.
fr_fr: <emphasis role="strong">eg.</emphasis> <literal>jndi/nom/compose</literal>

source: hibernate.transaction.manager_lookup_class
fr_fr: Le nom de la classe du <literal>TransactionManagerLookup</literal> - requis lorsque le cache de niveau JVM est activé ou lorsque l'on utilise un générateur hilo dans un environnement JTA.

source: The classname of a <literal>TransactionManagerLookup</literal> - required when JVM-level caching is enabled or when using hilo generator in a JTA environment.
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>nom.de.classe.du.TransactionManagerLookup</literal>

source: <emphasis role="strong">eg.</emphasis> <literal>classname.of.TransactionManagerLookup</literal>
fr_fr: hibernate.transaction.flush_before_completion

source: hibernate.transaction.flush_before_completion
fr_fr: Si activé, la session sera automatiquement vidée durant la phase qui précède la fin de la transaction (before completion). La gestion automatique de contexte fourni par Hibernate est recommandée, voir <xref linkend="architecture-current-session"/>.

source: If enabled, the session will be automatically flushed during the before completion phase of the transaction. Built-in and automatic session context management is preferred, see <xref linkend="architecture-current-session"/>.
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>true</literal> | <literal>false</literal>

source: hibernate.transaction.auto_close_session
fr_fr: Si activé, la session sera automatiquement fermé pendant la phase qui suit la fin de la transaction (after completion). La gestion automatique de contexte fourni par Hibernate est recommandée, voir

source: If enabled, the session will be automatically closed during the after completion phase of the transaction. Built-in and utomatic session context management is preferred, see <xref linkend="architecture-current-session"/>.
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>true</literal> | <literal>false</literal>

source: Miscellaneous Properties
fr_fr: Nom de la propriété

source: hibernate.current_session_context_class
fr_fr: Fournit une stratégie particulière pour contextualiser la <literal>Session</literal> courante. Voir <xref linkend="architecture-current-session"/> pour plus d'informations sur les stratégies fournies.

source: Supply a (custom) strategy for the scoping of the "current" <literal>Session</literal>. See <xref linkend="architecture-current-session"/> for more information about the built-in strategies.
fr_fr: <emphasis role="strong">eg.</emphasis> <literal>jta</literal> | <literal>thread</literal> | <literal>custom.Class</literal>

source: <emphasis role="strong">eg.</emphasis> <literal>jta</literal> | <literal>thread</literal> | <literal>managed</literal> | <literal>custom.Class</literal>
fr_fr: hibernate.query.factory_class

source: hibernate.query.factory_class
fr_fr: Choisi l'implémentation du parseur de requête

source: Chooses the HQL parser implementation.
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>org.hibernate.hql.ast.ASTQueryTranslatorFactory</literal> ou <literal>org.hibernate.hql.classic.ClassicQueryTranslatorFactory</literal>

source: <emphasis role="strong">eg.</emphasis> <literal>org.hibernate.hql.ast.ASTQueryTranslatorFactory</literal> or <literal>org.hibernate.hql.classic.ClassicQueryTranslatorFactory</literal>
fr_fr: hibernate.query.substitutions

source: hibernate.query.substitutions
fr_fr: Lien entre les tokens de requêtes Hibernate et les tokens SQL (les tokens peuvent être des fonctions ou des noms littéraux par exemple).

source: Mapping from tokens in Hibernate queries to SQL tokens (tokens might be function or literal names, for example).
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>hqlLiteral=SQL_LITERAL, hqlFunction=SQLFUNC</literal>

source: <emphasis role="strong">eg.</emphasis> <literal>hqlLiteral=SQL_LITERAL, hqlFunction=SQLFUNC</literal>
fr_fr: hibernate.hbm2ddl.auto

source: hibernate.hbm2ddl.auto
fr_fr: Valide ou exporte automatiquement le schéma DDL vers la base de données lorsque la <literal>SessionFactory</literal> est créée. La valeur <literal>create-drop</literal> permet de supprimer le schéma de base de données lorsque la <literal>SessionFactory</literal> est fermée explicitement.

source: Automatically validate or export schema DDL to the database when the <literal>SessionFactory</literal> is created. With <literal>create-drop</literal>, the database schema will be dropped when the <literal>SessionFactory</literal> is closed explicitly.
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>validate</literal> | <literal>update</literal> | <literal>create</literal> | <literal>create-drop</literal>

source: <emphasis role="strong">eg.</emphasis> <literal>validate</literal> | <literal>update</literal> | <literal>create</literal> | <literal>create-drop</literal>
fr_fr: hibernate.cglib.use_reflection_optimizer

source: hibernate.cglib.use_reflection_optimizer
fr_fr: Active l'utilisation de CGLIB à la place de la réflexion à l'exécution (Propriété de niveau système). La réflexion peut parfois être utile pour résoudre des problèmes. Notez qu'Hibernate a tout de même toujours besoin de CGLIB même si l'optimiseur est désactivé. Cette optimisation ne peut être définie que dans le fichier <literal>hibernate.cfg.xml</literal>.

source: Enables use of CGLIB instead of runtime reflection (System-level property). Reflection can sometimes be useful when troubleshooting, note that Hibernate always requires CGLIB even if you turn off the optimizer. You can not set this property in <literal>hibernate.cfg.xml</literal>.
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>true</literal> | <literal>false</literal>

source: SQL Dialects
fr_fr: Vous devriez toujours positionner la propriété <literal>hibernate.dialect</literal> à la sous-classe de <literal>org.hibernate.dialect.Dialect</literal> appropriée à votre base de données. Si vous spécifiez un dialecte, Hibernate utilisera des valeurs adaptées pour certaines autres propriétés listées ci-dessus, vous évitant l'effort de le faire à la main.

source: You should always set the <literal>hibernate.dialect</literal> property to the correct <literal>org.hibernate.dialect.Dialect</literal> subclass for your database. If you specify a dialect, Hibernate will use sensible defaults for some of the other properties listed above, saving you the effort of specifying them manually.
fr_fr: Dialectes SQL d'Hibernate (<literal>hibernate.dialect</literal>)

source: Hibernate SQL Dialects (<literal>hibernate.dialect</literal>)
fr_fr: SGBD

source: RDBMS
fr_fr: Dialecte

source: Dialect
fr_fr: <entry>DB2</entry>

source: <entry>DB2</entry>
fr_fr: org.hibernate.dialect.DB2Dialect

source: org.hibernate.dialect.DB2Dialect
fr_fr: DB2 AS/400

source: DB2 AS/400
fr_fr: org.hibernate.dialect.DB2400Dialect

source: org.hibernate.dialect.DB2400Dialect
fr_fr: DB2 OS390

source: DB2 OS390
fr_fr: org.hibernate.dialect.DB2390Dialect

source: org.hibernate.dialect.DB2390Dialect
fr_fr: PostgreSQL

source: PostgreSQL
fr_fr: org.hibernate.dialect.PostgreSQLDialect

source: org.hibernate.dialect.PostgreSQLDialect
fr_fr: MySQL

source: MySQL
fr_fr: org.hibernate.dialect.MySQLDialect

source: org.hibernate.dialect.MySQLDialect
fr_fr: MySQL with InnoDB

source: MySQL with InnoDB
fr_fr: org.hibernate.dialect.MySQLInnoDBDialect

source: org.hibernate.dialect.MySQLInnoDBDialect
fr_fr: MySQL with MyISAM

source: MySQL with MyISAM
fr_fr: org.hibernate.dialect.MySQLMyISAMDialect

source: org.hibernate.dialect.MySQLMyISAMDialect
fr_fr: Oracle (any version)

source: Oracle (any version)
fr_fr: org.hibernate.dialect.OracleDialect

source: org.hibernate.dialect.OracleDialect
fr_fr: Oracle 9i/10g

source: Oracle 9i/10g
fr_fr: org.hibernate.dialect.Oracle9Dialect

source: org.hibernate.dialect.Oracle9Dialect
fr_fr: Sybase

source: Sybase
fr_fr: org.hibernate.dialect.SybaseDialect

source: org.hibernate.dialect.SybaseDialect
fr_fr: Sybase Anywhere

source: Sybase Anywhere
fr_fr: org.hibernate.dialect.SybaseAnywhereDialect

source: org.hibernate.dialect.SybaseAnywhereDialect
fr_fr: Microsoft SQL Server

source: Microsoft SQL Server
fr_fr: org.hibernate.dialect.SQLServerDialect

source: org.hibernate.dialect.SQLServerDialect
fr_fr: SAP DB

source: SAP DB
fr_fr: org.hibernate.dialect.SAPDBDialect

source: org.hibernate.dialect.SAPDBDialect
fr_fr: Informix

source: Informix
fr_fr: org.hibernate.dialect.InformixDialect

source: org.hibernate.dialect.InformixDialect
fr_fr: HypersonicSQL

source: HypersonicSQL
fr_fr: org.hibernate.dialect.HSQLDialect

source: org.hibernate.dialect.HSQLDialect
fr_fr: Ingres

source: Ingres
fr_fr: org.hibernate.dialect.IngresDialect

source: org.hibernate.dialect.IngresDialect
fr_fr: Progress

source: Progress
fr_fr: org.hibernate.dialect.ProgressDialect

source: org.hibernate.dialect.ProgressDialect
fr_fr: Mckoi SQL

source: Mckoi SQL
fr_fr: org.hibernate.dialect.MckoiDialect

source: org.hibernate.dialect.MckoiDialect
fr_fr: Interbase

source: Interbase
fr_fr: org.hibernate.dialect.InterbaseDialect

source: org.hibernate.dialect.InterbaseDialect
fr_fr: Pointbase

source: Pointbase
fr_fr: org.hibernate.dialect.PointbaseDialect

source: org.hibernate.dialect.PointbaseDialect
fr_fr: FrontBase

source: FrontBase
fr_fr: org.hibernate.dialect.FrontbaseDialect

source: org.hibernate.dialect.FrontbaseDialect
fr_fr: Firebird

source: Firebird
fr_fr: org.hibernate.dialect.FirebirdDialect

source: org.hibernate.dialect.FirebirdDialect
fr_fr: Chargement par Jointure Ouverte

source: Outer Join Fetching
fr_fr: Si votre base de données supporte les outer joins de type ANSI, Oracle ou Sybase, <emphasis>le chargement par jointure ouverte</emphasis> devrait améliorer les performances en limitant le nombre d'aller-retour avec la base de données (la base de données effectuant donc potentiellement plus de travail). Le chargement par jointure ouverte permet à un graphe entier d'objets connectés par une relation plusieurs-à-un, un-à-plusieurs ou un-à-un d'être chargé en un seul <literal>SELECT</literal> SQL.

source: If your database supports ANSI, Oracle or Sybase style outer joins, <emphasis>outer join fetching</emphasis> will often increase performance by limiting the number of round trips to and from the database (at the cost of possibly more work performed by the database itself). Outer join fetching allows a whole graph of objects connected by many-to-one, one-to-many, many-to-many and one-to-one associations to be retrieved in a single SQL <literal>SELECT</literal>.
fr_fr: Le chargement par jointure ouverte peut être désactiver <emphasis>globalement</emphasis> en mettant la propriété <literal>hibernate.max_fetch_depth</literal> à <literal>0</literal>. Une valeur de <literal>1</literal> ou plus active le chargement par jointure ouverte pour les associatiosn un-à-un et plusieurs-à-un qui ont été mappée avec <literal>fetch="join"</literal>.

source: Outer join fetching may be disabled <emphasis>globally</emphasis> by setting the property <literal>hibernate.max_fetch_depth</literal> to <literal>0</literal>. A setting of <literal>1</literal> or higher enables outer join fetching for one-to-one and many-to-one associations which have been mapped with <literal>fetch="join"</literal>.
fr_fr: Reportez vous à <xref linkend="performance-fetching"/> pour plus d'information.

source: See <xref linkend="performance-fetching"/> for more information.
fr_fr: Flux binaires

source: Binary Streams
fr_fr: Oracle limite la taille d'un tableau de <literal>byte</literal> qui peuvent être passées à et vers son pilote JDBC. Si vous souhaitez utiliser des instances larges de type <literal>binary</literal> ou <literal>serializable</literal>, vous devez activer la propriété <literal>hibernate.jdbc.use_streams_for_binary</literal>. <emphasis>C'est une fonctionalité de niveau système uniquement.</emphasis>

source: Oracle limits the size of <literal>byte</literal> arrays that may be passed to/from its JDBC driver. If you wish to use large instances of <literal>binary</literal> or <literal>serializable</literal> type, you should enable <literal>hibernate.jdbc.use_streams_for_binary</literal>. <emphasis>This is a system-level setting only.</emphasis>
fr_fr: Cache de second niveau et cache de requêtes

source: Second-level and query cache
fr_fr: Les propriétés préfixées par <literal>hibernate.cache</literal> vous permettent d'utiliser un système de cache de second niveau. Ce cache peut avoir une portée dans le processus ou même être utilisable dans un système distribué. Référez vous au chapitre <xref linkend="performance-cache"/> pour plus de détails.

source: The properties prefixed by <literal>hibernate.cache</literal> allow you to use a process or cluster scoped second-level cache system with Hibernate. See the <xref linkend="performance-cache"/> for more details.
fr_fr: Substitution dans le langage de requêtage

source: Query Language Substitution
fr_fr: Vous pouvez définir de nouveaux tokens dans les requêtes Hibernate en utilisant la propriété <literal>hibernate.query.substitutions</literal>. Par exemple :

source: You may define new Hibernate query tokens using <literal>hibernate.query.substitutions</literal>. For example:
fr_fr: hibernate.query.substitutions vrai=1, faux=0

source: hibernate.query.substitutions true=1, false=0
fr_fr: remplacerait les tokens <literal>vrai</literal> et <literal>faux</literal> par des entiers dans le SQL généré.

source: would cause the tokens <literal>true</literal> and <literal>false</literal> to be translated to integer literals in the generated SQL.
fr_fr: hibernate.query.substitutions toLowercase=LOWER

source: hibernate.query.substitutions toLowercase=LOWER
fr_fr: permettrait de renommer la fonction SQL <literal>LOWER</literal> en <literal>toLowercase</literal>

source: would allow you to rename the SQL <literal>LOWER</literal> function.
fr_fr: Statistiques Hibernate

source: Hibernate statistics
fr_fr: Si vous activez <literal>hibernate.generate_statistics</literal>, Hibernate va fournir un certains nombre de métriques utiles pour régler les performances d'une application qui tourne via <literal>SessionFactory.getStatistics()</literal>. Hibernate peut aussi être configuré pour exposer ces statistiques via JMX. Lisez les Javadoc des interfaces dans le package <literal>org.hibernate.stats</literal> pour plus d'informations.

source: If you enable <literal>hibernate.generate_statistics</literal>, Hibernate will expose a number of metrics that are useful when tuning a running system via <literal>SessionFactory.getStatistics()</literal>. Hibernate can even be configured to expose these statistics via JMX. Read the Javadoc of the interfaces in <literal>org.hibernate.stats</literal> for more information.
fr_fr: Tracer

source: Logging
fr_fr: Hibernate trace divers évènements en utilisant Apache commons-logging.

source: Hibernate logs various events using Apache commons-logging.
fr_fr: Le service commons-logging délèguera directement à Apache Log4j (si vous incluez <literal>log4j.jar</literal> dans votre classpath) ou le système de trace du JDK 1.4 (si vous tournez sous le JDK 1.4 et supérieur). Vous pouvez télécharger Log4j à partir de <literal>http://jakarta.apache.org</literal>. Pour utiliser Log4j, vous devrez placer dans votre classpath un fichier <literal>log4j.properties</literal>. Un exemple de fichier est distribué avec Hibernate dans le répertoire <literal>src/</literal>.
