Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/configuration.po
Languages: fr_fr

source: The commons-logging service will direct output to either Apache Log4j (if you include <literal>log4j.jar</literal> in your classpath) or JDK1.4 logging (if running under JDK1.4 or above). You may download Log4j from <literal>http://jakarta.apache.org</literal>. To use Log4j you will need to place a <literal>log4j.properties</literal> file in your classpath, an example properties file is distributed with Hibernate in the <literal>src/</literal> directory.
fr_fr: Nous vous recommandons fortement de vous familiariser avec les messages des traces d'Hibernate. Beaucoup de soins a été apporté pour donner le plus de détails possible sans les rendre illisibles. C'est un outil essentiel en cas de soucis. Les catégories de trace les plus intéressantes sont les suivantes :

source: We strongly recommend that you familiarize yourself with Hibernate's log messages. A lot of work has been put into making the Hibernate log as detailed as possible, without making it unreadable. It is an essential troubleshooting device. The most interesting log categories are the following:
fr_fr: Catégories de trace d'Hibernate

source: Hibernate Log Categories
fr_fr: Catégorie

source: Category
fr_fr: Fonction

source: Function
fr_fr: org.hibernate.SQL

source: org.hibernate.SQL
fr_fr: Trace toutes les requêts SQL de type DML (gestion des données) qui sont exécutées

source: Log all SQL DML statements as they are executed
fr_fr: org.hibernate.type

source: org.hibernate.type
fr_fr: Trace tous les paramètres JDBC

source: Log all JDBC parameters
fr_fr: org.hibernate.tool.hbm2ddl

source: org.hibernate.tool.hbm2ddl
fr_fr: Trace toutes les requêts SQL de type DDL (gestion de la structure de la base) qui sont exécutées

source: Log all SQL DDL statements as they are executed
fr_fr: org.hibernate.pretty

source: org.hibernate.pretty
fr_fr: Trace l'état de toutes les entités (20 entités maximum) qui sont associées avec la session hibernate au moment du flush

source: Log the state of all entities (max 20 entities) associated with the session at flush time
fr_fr: org.hibernate.cache

source: org.hibernate.cache
fr_fr: Trace toute l'activité du cache de second niveau

source: Log all second-level cache activity
fr_fr: org.hibernate.transaction

source: org.hibernate.transaction
fr_fr: Trace toute l'activité relative aux transactions

source: Log transaction related activity
fr_fr: org.hibernate.jdbc

source: org.hibernate.jdbc
fr_fr: Trace toute acquisition de ressource JDBC

source: Log all JDBC resource acquisition
fr_fr: org.hibernate.hql.ast.AST

source: org.hibernate.hql.ast.AST
fr_fr: Trace l'arbre syntaxique des requêtes HQL et SQL durant l'analyse syntaxique des requêtes

source: Log HQL and SQL ASTs during query parsing
fr_fr: org.hibernate.secure

source: org.hibernate.secure
fr_fr: Trace toutes les demandes d'autorisation JAAS

source: Log all JAAS authorization requests
fr_fr: org.hibernate

source: org.hibernate
fr_fr: Trace tout (beaucoupe d'informations, mais très utile pour résoudre les problèmes).

source: Log everything (a lot of information, but very useful for troubleshooting)
fr_fr: Lorsque vous développez des applications avec Hibernate, vous devriez quasiment toujours travailler avec le niveau <literal>debug</literal> activé pour la catégorie <literal>org.hibernate.SQL</literal>, ou sinon avec la propriété <literal>hibernate.show_sql</literal> activée.

source: When developing applications with Hibernate, you should almost always work with <literal>debug</literal> enabled for the category <literal>org.hibernate.SQL</literal>, or, alternatively, the property <literal>hibernate.show_sql</literal> enabled.
fr_fr: Implémenter une <literal>NamingStrategy</literal>

source: Implementing a <literal>NamingStrategy</literal>
fr_fr: L'interface <literal>org.hibernate.cfg.NamingStrategy</literal> vous permet de spécifier une "stratégie de nommage" des objets et éléments de la base de données.

source: The interface <literal>org.hibernate.cfg.NamingStrategy</literal> allows you to specify a "naming standard" for database objects and schema elements.
fr_fr: Vous pouvez fournir des règles pour automatiquement générer les identifiants de base de données à partir des identifiants Java, ou transformer une colonne ou table "logique" donnée dans le fichier de mapping en une colonne ou table "physique". Cette fonctionnalité aide à réduire la verbosité de documents de mapping, en éliminant le bruit répétitif (les préfixes <literal>TBL_</literal> par exemple). La stratégie par défaut utilisée par Hibernate est minimale.

source: You may provide rules for automatically generating database identifiers from Java identifiers or for processing "logical" column and table names given in the mapping file into "physical" table and column names. This feature helps reduce the verbosity of the mapping document, eliminating repetitive noise (<literal>TBL_</literal> prefixes, for example). The default strategy used by Hibernate is quite minimal.
fr_fr: Vous pouvez définir une stratégie différente en appelant <literal>Configuration.setNamingStrategy()</literal> avant d'ajouter des mappings :

source: You may specify a different strategy by calling <literal>Configuration.setNamingStrategy()</literal> before adding mappings:
fr_fr: <![CDATA[SessionFactory sf = new Configuration() .setNamingStrategy(ImprovedNamingStrategy.INSTANCE) .addFile("Item.hbm.xml") .addFile("Bid.hbm.xml") .buildSessionFactory();]]>

source: <![CDATA[SessionFactory sf = new Configuration() .setNamingStrategy(ImprovedNamingStrategy.INSTANCE) .addFile("Item.hbm.xml") .addFile("Bid.hbm.xml") .buildSessionFactory();]]>
fr_fr: <literal>net.sf.hibernate.cfg.ImprovedNamingStrategy</literal> est une stratégie fournie qui peut être utile comme point de départ de quelques applications.

source: <literal>org.hibernate.cfg.ImprovedNamingStrategy</literal> is a built-in strategy that might be a useful starting point for some applications.
fr_fr: Fichier de configuration XML

source: XML configuration file
fr_fr: Une approche alternative est de spécifier toute la configuration dans un fichier nommé <literal>hibernate.cfg.xml</literal>. Ce fichier peut être utilisé à la place du fichier <literal>hibernate.properties</literal>, voire même peut servir à surcharger les propriétés si les deux fichiers sont présents.

source: An alternative approach to configuration is to specify a full configuration in a file named <literal>hibernate.cfg.xml</literal>. This file can be used as a replacement for the <literal>hibernate.properties</literal> file or, if both are present, to override properties.
fr_fr: Le fichier de configuration XML doit par défaut se placer à la racine du <literal>CLASSPATH</literal>. En voici un exemple :

source: The XML configuration file is by default expected to be in the root o your <literal>CLASSPATH</literal>. Here is an example:
fr_fr: <![CDATA[<?xml version='1.0' encoding='utf-8'?> <!DOCTYPE hibernate-configuration PUBLIC "-//Hibernate/Hibernate Configuration DTD//EN" "http://hibernate.sourceforge.net/hibernate-configuration-3.0.dtd"> <hibernate-configuration> <!-- a SessionFactory instance listed as /jndi/name --> <session-factory name="java:hibernate/SessionFactory"> <!-- properties --> <property name="connection.datasource">java:/comp/env/jdbc/MyDB</property> <property name="dialect">org.hibernate.dialect.MySQLDialect</property> <property name="show_sql">false</property> <property name="transaction.factory_class"> org.hibernate.transaction.JTATransactionFactory </property> <property name="jta.UserTransaction">java:comp/UserTransaction</property> <!-- mapping files --> <mapping resource="org/hibernate/auction/Item.hbm.xml"/> <mapping resource="org/hibernate/auction/Bid.hbm.xml"/> <!-- cache settings --> <class-cache class="org.hibernate.auction.Item" usage="read-write"/> <class-cache class="org.hibernate.auction.Bid" usage="read-only"/> <collection-cache collection="org.hibernate.auction.Item.bids" usage="read-write"/> </session-factory> </hibernate-configuration>]]>

source: <![CDATA[<?xml version='1.0' encoding='utf-8'?> <!DOCTYPE hibernate-configuration PUBLIC "-//Hibernate/Hibernate Configuration DTD//EN" "http://hibernate.sourceforge.net/hibernate-configuration-3.0.dtd"> <hibernate-configuration> <!-- a SessionFactory instance listed as /jndi/name --> <session-factory name="java:hibernate/SessionFactory"> <!-- properties --> <property name="connection.datasource">java:/comp/env/jdbc/MyDB</property> <property name="dialect">org.hibernate.dialect.MySQLDialect</property> <property name="show_sql">false</property> <property name="transaction.factory_class"> org.hibernate.transaction.JTATransactionFactory </property> <property name="jta.UserTransaction">java:comp/UserTransaction</property> <!-- mapping files --> <mapping resource="org/hibernate/auction/Item.hbm.xml"/> <mapping resource="org/hibernate/auction/Bid.hbm.xml"/> <!-- cache settings --> <class-cache class="org.hibernate.auction.Item" usage="read-write"/> <class-cache class="org.hibernate.auction.Bid" usage="read-only"/> <collection-cache collection="org.hibernate.auction.Item.bids" usage="read-write"/> </session-factory> </hibernate-configuration>]]>
fr_fr: Commme vous pouvez le voir, l'avantage de cette approche est l'externalisation des noms des fichiers de mapping de la configuration. Le fichier <literal>hibernate.cfg.xml</literal> est également plus pratique quand on commence à régler le cache d'Hibernate. Notez que vous pouvez choisir entre utiliser <literal>hibernate.properties</literal> ou <literal>hibernate.cfg.xml</literal>, les deux sont équivalents, sauf en ce qui concerne les bénéfices de l'utilisation de la syntaxe XML mentionnés ci-dessus.

source: As you can see, the advantage of this approach is the externalization of the mapping file names to configuration. The <literal>hibernate.cfg.xml</literal> is also more convenient once you have to tune the Hibernate cache. Note that is your choice to use either <literal>hibernate.properties</literal> or <literal>hibernate.cfg.xml</literal>, both are equivalent, except for the above mentioned benefits of using the XML syntax.
fr_fr: Avec la configuration XML, démarrer Hibernate devient donc aussi simple que ceci :

source: With the XML configuration, starting Hibernate is then as simple as
fr_fr: <![CDATA[SessionFactory sf = new Configuration().configure().buildSessionFactory();]]>

source: <![CDATA[SessionFactory sf = new Configuration().configure().buildSessionFactory();]]>
fr_fr: Intégration à un serveur d'application J2EE

source: You can pick a different XML configuration file using
fr_fr: Hibernate possède les points suivants d'intégration à l'infrastructure J2EE :

source: <![CDATA[SessionFactory sf = new Configuration() .configure("catdb.cfg.xml") .buildSessionFactory();]]>
fr_fr: <emphasis>Source de données gérée par le conteneur</emphasis> : Hibernate peut utiliser des connexions JDBC gérées par le conteneur et fournie par l'intermédiaire de JNDI. Souvent, un <literal>TransactionManager</literal> compatible JTA et un <literal>ResourceManager</literal> s'occupent de la gestion des transactions (CMT). Ils sont particulièrement prévus pour pouvoir gérer des transactions distribuées sur plusieurs sources de données. Vous pouvez bien sûr également définir vos limites de transaction dans votre programme (BMT) ou vous pouvez sinon aussi utiliser l'API optionnelle <literal>Transaction</literal> d'Hibernate qui vous garantira la portabilité de votre code entre plusieurs serveurs d'application.

source: J2EE Application Server integration
fr_fr: <emphasis>Association JNDI automatique</emphasis>: Hibernate peut associer sa <literal>SessionFactory</literal> à JNDI après le démarrage.

source: Hibernate has the following integration points for J2EE infrastructure:
fr_fr: <emphasis>Association de la Session à JTA:</emphasis> La <literal>Session</literal> Hibernate peut être associée automatiquement à une transaction JTA si vous utilisez les EJBs. Vous avez juste à récupérer la <literal>SessionFactory</literal> depuis JNDI et à récupérer la <literal>Session</literal> courante. Hibernate s'occupe de vider et fermer la <literal>Session</literal> lorsque le transaction JTA se termine. La démarcation des transactions se fait de manière déclarative dans les descripteurs de déploiement.

source: <emphasis>Container-managed datasources</emphasis>: Hibernate can use JDBC connections managed by the container and provided through JNDI. Usually, a JTA compatible <literal>TransactionManager</literal> and a <literal>ResourceManager</literal> take care of transaction management (CMT), esp. distributed transaction handling across several datasources. You may of course also demarcate transaction boundaries programmatically (BMT) or you might want to use the optional Hibernate <literal>Transaction</literal> API for this to keep your code portable.
fr_fr: <emphasis>Déploiement JMX :</emphasis>Si vous avez un serveur d'application compatible JMX (JBoss AS par exemple), vous pouvez choisir de déployer Hibernate en temps que MBean géré par le serveur. Cela vous évite de coder la ligne de démarrage qui permet de construire la <literal>SessionFactory</literal> depuis la <literal>Configuration</literal>. Le conteneur va démarrer votre <literal>HibernateService</literal>, et va idéalement s'occuper des dépendances entre les services (la source de données doit être disponible avant qu'Hibernate ne démarre, etc).

source: <emphasis>Automatic JNDI binding</emphasis>: Hibernate can bind its <literal>SessionFactory</literal> to JNDI after startup.
fr_fr: En fonction de votre environnement, vous devrez peut être mettre l'option de configuration <literal>hibernate.connection.aggressive_release</literal> à vrai si le serveur d'application affiche des exceptions de type "connection containment".

source: <emphasis>JTA Session binding:</emphasis> The Hibernate <literal>Session</literal> may be automatically bound to the scope of JTA transactions. Simply lookup the <literal>SessionFactory</literal> from JNDI and get the current <literal>Session</literal>. Let Hibernate take care of flushing and closing the <literal>Session</literal> when your JTA transaction completes. Transaction demarcation is either declarative (CMT) or programmatic (BMT/UserTransaction).
fr_fr: Configuration de la stratégie transactionnelle

source: <emphasis>JMX deployment:</emphasis> If you have a JMX capable application server (e.g. JBoss AS), you can chose to deploy Hibernate as a managed MBean. This saves you the one line startup code to build your <literal>SessionFactory</literal> from a <literal>Configuration</literal>. The container will startup your <literal>HibernateService</literal>, and ideally also take care of service dependencies (Datasource has to be available before Hibernate starts, etc).
fr_fr: L'API de la <literal>Session</literal> Hibernate est indépendante de tout système de démarcation des transactions qui peut être présent dans votre architecture. Si vous laissez Hibernate utiliser l'API JDBC directement via un pool de connexion, vous devrez commencer et terminer vos transactions en utilisant l'API JDBC. Si votre application tourne à l'intérieur d'un serveur d'application J2EE, vous voudrez peut être utiliser les transactions gérées par les beans (BMT) et appeller l'API JTA et <literal>UserTransaction</literal> lorsque cela est nécessaire.

source: Depending on your environment, you might have to set the configuration option <literal>hibernate.connection.aggressive_release</literal> to true if your application server shows "connection containment" exceptions.
fr_fr: Pour conserver votre code portable entre ces deux environnements (et d'autres éventuels) nous vous recommandons d'utiliser l'API optionnelle <literal>Transaction</literal> d'Hibernate, qui va encapsuler et masquer le système de transaction sous-jacent. Pour cela, vous devez préciser une classe de fabrique d'instances de <literal>Transaction</literal> en positionnant la propriété <literal>hibernate.transaction.factory_class</literal>.

source: Transaction strategy configuration
fr_fr: Il existe trois choix standards (fournis) :

source: The Hibernate <literal>Session</literal> API is independent of any transaction demarcation system in your architecture. If you let Hibernate use JDBC directly, through a connection pool, you may begin and end your transactions by calling the JDBC API. If you run in a J2EE application server, you might want to use bean-managed transactions and call the JTA API and <literal>UserTransaction</literal> when needed.
fr_fr: net.sf.hibernate.transaction.JDBCTransactionFactory

source: To keep your code portable between these two (and other) environments we recommend the optional Hibernate <literal>Transaction</literal> API, which wraps and hides the underlying system. You have to specify a factory class for <literal>Transaction</literal> instances by setting the Hibernate configuration property <literal>hibernate.transaction.factory_class</literal>.
fr_fr: délègue aux transactions de la base de données (JDBC). Valeur par défaut.

source: There are three standard (built-in) choices:
fr_fr: org.hibernate.transaction.JTATransactionFactory

source: org.hibernate.transaction.JDBCTransactionFactory
fr_fr: délègue à CMT si une transaction existante est sous ce contexte (ex: méthode d'un EJB session), sinon une nouvelle transaction est entamée et une transaction gérée par le bean est utilisée.

source: delegates to database (JDBC) transactions (default)
fr_fr: org.hibernate.transaction.CMTTransactionFactory

source: org.hibernate.transaction.JTATransactionFactory
fr_fr: délègue à aux transactions JTA gérées par le conteneur

source: delegates to container-managed transaction if an existing transaction is underway in this context (e.g. EJB session bean method), otherwise a new transaction is started and bean-managed transaction are used.
fr_fr: Vous pouvez également définir votre propre stratégie transactionnelle (pour un service de transaction CORBA par exemple).

source: org.hibernate.transaction.CMTTransactionFactory
fr_fr: Certaines fonctionnalités d'Hibernate (i.e. le cache de second niveau, l'association automatique des Session à JTA, etc.) nécessitent l'accès au <literal>TransactionManager</literal> JTA dans un environnement "managé". Dans un serveur d'application, vous devez indiquer comment Hibernate peut obtenir une référence vers le <literal>TransactionManager</literal>, car J2EE ne fournit pas un seul mécanisme standard.

source: delegates to container-managed JTA transactions
fr_fr: TransactionManagers JTA

source: You may also define your own transaction strategies (for a CORBA transaction service, for example).
fr_fr: Fabrique de Transaction

source: Some features in Hibernate (i.e. the second level cache, Contextual Sessions with JTA, etc.) require access to the JTA <literal>TransactionManager</literal> in a managed environment. In an application server you have to specify how Hibernate should obtain a reference to the <literal>TransactionManager</literal>, since J2EE does not standardize a single mechanism:
fr_fr: Serveur d'application

source: JTA TransactionManagers
fr_fr: org.hibernate.transaction.JBossTransactionManagerLookup

source: Transaction Factory
fr_fr: JBoss

source: Application Server
fr_fr: org.hibernate.transaction.WeblogicTransactionManagerLookup

source: org.hibernate.transaction.JBossTransactionManagerLookup
fr_fr: Weblogic

source: JBoss
fr_fr: org.hibernate.transaction.WebSphereTransactionManagerLookup

source: org.hibernate.transaction.WeblogicTransactionManagerLookup
fr_fr: WebSphere

source: Weblogic
fr_fr: org.hibernate.transaction.WebSphereExtendedJTATransactionLookup

source: org.hibernate.transaction.WebSphereTransactionManagerLookup
fr_fr: WebSphere 6

source: WebSphere
fr_fr: org.hibernate.transaction.OrionTransactionManagerLookup

source: org.hibernate.transaction.WebSphereExtendedJTATransactionLookup
fr_fr: Orion

source: WebSphere 6
fr_fr: org.hibernate.transaction.ResinTransactionManagerLookup

source: org.hibernate.transaction.OrionTransactionManagerLookup
fr_fr: Resin

source: Orion
fr_fr: org.hibernate.transaction.JOTMTransactionManagerLookup

source: org.hibernate.transaction.ResinTransactionManagerLookup
fr_fr: JOTM

source: Resin
fr_fr: org.hibernate.transaction.JOnASTransactionManagerLookup

source: org.hibernate.transaction.JOTMTransactionManagerLookup
fr_fr: JOnAS

source: JOTM
fr_fr: org.hibernate.transaction.JRun4TransactionManagerLookup

source: org.hibernate.transaction.JOnASTransactionManagerLookup
fr_fr: JRun4

source: JOnAS
fr_fr: org.hibernate.transaction.BESTransactionManagerLookup

source: org.hibernate.transaction.JRun4TransactionManagerLookup
fr_fr: Borland ES

source: JRun4
fr_fr: <literal>SessionFactory</literal> associée au JNDI

source: org.hibernate.transaction.BESTransactionManagerLookup
fr_fr: Une <literal>SessionFactory</literal> Hibernate associée au JNDI peut simplifier l'accès à la fabrique et donc la création de nouvelles <literal>Session</literal>s. Notez que cela n'est pas lié avec les <literal>Datasource</literal> associées au JNDI, elles utilisent juste le même registre.

source: Borland ES
fr_fr: Si vous désirez associer la <literal>SessionFactory</literal> à un nom JNDI, spécifiez un nom (ex. <literal>java:hibernate/SessionFactory</literal>) en utilisant la propriété <literal>hibernate.session_factory_name</literal>. Si cette propriété est omise, la <literal>SessionFactory</literal> ne sera pas associée au JNDI (c'est particulièrement pratique dans les environnements ayant une implémentation de JNDI en lecture seule, comme c'est le cas pour Tomcat).

source: JNDI-bound <literal>SessionFactory</literal>
fr_fr: Lorsqu'il associe la <literal>SessionFactory</literal> au JNDI, Hibernate utilisera les valeurs de <literal>hibernate.jndi.url</literal>, <literal>hibernate.jndi.class</literal> pour instancier un contexte d'initialisation. S'ils ne sont pas spécifiés, l'<literal>InitialContext</literal> par défaut sera utilisé.

source: A JNDI bound Hibernate <literal>SessionFactory</literal> can simplify the lookup of the factory and the creation of new <literal>Session</literal>s. Note that this is not related to a JNDI bound <literal>Datasource</literal>, both simply use the same registry!
fr_fr: Hibernate va automatiquement placer la <literal>SessionFactory</literal> dans JNDI après avoir appelé <literal>cfg.buildSessionFactory()</literal>. Cela signifie que vous devez avoir cet appel dans un code de démarrage (ou dans une classe utilitaire) dans votre application sauf si vous utilisez le déploiement JMX avec le service <literal>HibernateService</literal> présenté plus tard dans ce document.

source: If you wish to have the <literal>SessionFactory</literal> bound to a JNDI namespace, specify a name (eg. <literal>java:hibernate/SessionFactory</literal>) using the property <literal>hibernate.session_factory_name</literal>. If this property is omitted, the <literal>SessionFactory</literal> will not be bound to JNDI. (This is especially useful in environments with a read-only JNDI default implementation, e.g. Tomcat.)
fr_fr: Si vous utilisez <literal>SessionFactory</literal> JNDI, un EJB ou n'importe quelle autre classe peut obtenir la <literal>SessionFactory</literal> en utilisant un lookup JNDI.
