Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/configuration.po
Languages: fr_fr

source: Because Hibernate is designed to operate in many different environments, there are a large number of configuration parameters. Fortunately, most have sensible default values and Hibernate is distributed with an example <literal>hibernate.properties</literal> file in <literal>etc/</literal> that shows the various options. Just put the example file in your classpath and customize it.
fr_fr: Parce qu'Hibernate est conçu pour fonctionner dans différents environnements, il existe beaucoup de paramètres de configuration. Heureusement, la plupart ont des valeurs par défaut appropriées et la distribution d'Hibernate contient un exemple de fichier <literal>hibernate.properties</literal> dans le répertoire <literal>etc/</literal> qui montre les différentes options. Vous n'avez qu'à placer ce fichier dans votre classpath et à l'adapter.

source: Programmatic configuration
fr_fr: Configuration par programmation

source: An instance of <literal>org.hibernate.cfg.Configuration</literal> represents an entire set of mappings of an application's Java types to an SQL database. The <literal>Configuration</literal> is used to build an (immutable) <literal>SessionFactory</literal>. The mappings are compiled from various XML mapping files.
fr_fr: Une instance de <literal>org.hibernate.cfg.Configuration</literal> représente un ensemble de mappings des classes Java d'une application vers la base de données SQL. La <literal>Configuration</literal> est utilisée pour construire un objet (immuable) <literal>SessionFactory</literal>. Les mappings sont constitués d'un ensemble de fichiers de mapping XML.

source: You may obtain a <literal>Configuration</literal> instance by instantiating it directly and specifying XML mapping documents. If the mapping files are in the classpath, use <literal>addResource()</literal>:
fr_fr: Vous pouvez obtenir une instance de <literal>Configuration</literal> en l'instanciant directement et en spécifiant la liste des documents XML de mapping. Si les fichiers de mapping sont dans le classpath, vous pouvez le faire à l'aide de la méthode <literal>addResource()</literal> :

source: An alternative (sometimes better) way is to specify the mapped class, and let Hibernate find the mapping document for you:
fr_fr: Une alternative (parfois meilleure) est de spécifier les classes mappées et de laisser Hibernate trouver les documents de mapping pour vous :

source: Then Hibernate will look for mapping files named <literal>/org/hibernate/auction/Item.hbm.xml</literal> and <literal>/org/hibernate/auction/Bid.hbm.xml</literal> in the classpath. This approach eliminates any hardcoded filenames.
fr_fr: Hibernate va rechercher les fichiers de mappings <literal>/org/hibernate/auction/Item.hbm.xml</literal> et <literal>/org/hibernate/auction/Bid.hbm.xml</literal> dans le classpath. Cette approche élimine les noms de fichiers en dur.

source: A <literal>Configuration</literal> also allows you to specify configuration properties:
fr_fr: Une <literal>Configuration</literal> vous permet également de préciser des propriétés de configuration :

source: This is not the only way to pass configuration properties to Hibernate. The various options include:
fr_fr: Ce n'est pas le seul moyen de passer des propriétés de configuration à Hibernate. Les différentes options sont :

source: Pass an instance of <literal>java.util.Properties</literal> to <literal>Configuration.setProperties()</literal>.
fr_fr: Passer une instance de <literal>java.util.Properties</literal> à <literal>Configuration.setProperties()</literal>.

source: Place <literal>hibernate.properties</literal> in a root directory of the classpath.
fr_fr: Placer <literal>hibernate.properties</literal> dans un répertoire racine du classpath

source: Set <literal>System</literal> properties using <literal>java -Dproperty=value</literal>.
fr_fr: Positionner les propriétés <literal>System</literal> en utilisant <literal>java -Dproperty=value</literal>.

source: Include <literal>&lt;property&gt;</literal> elements in <literal>hibernate.cfg.xml</literal> (discussed later).
fr_fr: Inclure des éléments <literal>&lt;property&gt;</literal> dans le fichier <literal>hibernate.cfg.xml</literal> (voir plus loin).

source: <literal>hibernate.properties</literal> is the easiest approach if you want to get started quickly.
fr_fr: L'utilisation d'<literal>hibernate.properties</literal> est l'approche la plus simple si vous voulez démarrer rapidement

source: The <literal>Configuration</literal> is intended as a startup-time object, to be discarded once a <literal>SessionFactory</literal> is created.
fr_fr: La <literal>Configuration</literal> est un objet de démarrage qui sera supprimé une fois qu'une <literal>SessionFactory</literal> aura été créée.

source: Obtaining a SessionFactory
fr_fr: Obtenir une SessionFactory

source: When all mappings have been parsed by the <literal>Configuration</literal>, the application must obtain a factory for <literal>Session</literal> instances. This factory is intended to be shared by all application threads:
fr_fr: Une fois que tous les mappings ont été parsés par la <literal>Configuration</literal>, l'application doit obtenir une fabrique d'instances de <literal>Session</literal>. Cette fabrique sera partagée entre tous les threads de l'application :

source: Hibernate does allow your application to instantiate more than one <literal>SessionFactory</literal>. This is useful if you are using more than one database.
fr_fr: Hibernate permet à votre application d'instancier plus d'une <literal>SessionFactory</literal>. Cela est pratique lorsque vous utilisez plus d'une base de données.

source: JDBC connections
fr_fr: Connexions JDBC

source: Usually, you want to have the <literal>SessionFactory</literal> create and pool JDBC connections for you. If you take this approach, opening a <literal>Session</literal> is as simple as:
fr_fr: Habituellement, vous voulez que la <literal>SessionFactory</literal> crée les connexions JDBC et les mette dans un pool pour vous. Si vous suivez cette approche, ouvrir une <literal>Session</literal> est aussi simple que :

source: As soon as you do something that requires access to the database, a JDBC connection will be obtained from the pool.
fr_fr: Dès que vous ferez quelquechose qui requiert un accès à la base de données, une connexion JDBC sera récupérée dans le pool.

source: For this to work, we need to pass some JDBC connection properties to Hibernate. All Hibernate property names and semantics are defined on the class <literal>org.hibernate.cfg.Environment</literal>. We will now describe the most important settings for JDBC connection configuration.
fr_fr: Pour faire cela, il faut passer les propriétés de la connexion JDBC à Hibernate. Tous les noms des propriétés Hibernate et leur signification sont définies dans la classe <literal>org.hibernate.cfg.Environment</literal>. Nous allons maintenant décrire les paramètres de configuration des connexions JDBC les plus importants.

source: Hibernate will obtain (and pool) connections using <literal>java.sql.DriverManager</literal> if you set the following properties:
fr_fr: Hibernate obtiendra des connexions (et les mettra dans un pool) en utilisant <literal>java.sql.DriverManager</literal> si vous positionnez les paramètres de la manière suivante :

source: Hibernate JDBC Properties
fr_fr: Propriétés JDBC d'Hibernate

source: Property name
fr_fr: Nom de la propriété

source: Purpose
fr_fr: Fonction

source: JDBC driver class
fr_fr: Classe du driver jdbc

source: JDBC URL
fr_fr: URL jdbc

source: database user
fr_fr: utilisateur de la base de données

source: database user password
fr_fr: mot de passe de la base de données

source: maximum number of pooled connections
fr_fr: nombre maximum de connexions dans le pool

source: Hibernate's own connection pooling algorithm is however quite rudimentary. It is intended to help you get started and is <emphasis>not intended for use in a production system</emphasis> or even for performance testing. You should use a third party pool for best performance and stability. Just replace the <literal>hibernate.connection.pool_size</literal> property with connection pool specific settings. This will turn off Hibernate's internal pool. For example, you might like to use C3P0.
fr_fr: L'algorithme natif de pool de connexions d'Hibernate est plutôt rudimentaire. Il a été fait dans le but de vous aider à démarrer et <emphasis>n'est pas prévu pour un système en production</emphasis> ou même pour un test de peformance. Utilisez plutôt un pool tiers pour de meilleures performances et une meilleure stabilité : pour cela, remplacez la propriété <literal>hibernate.connection.pool_size</literal> avec les propriétés spécifique au pool de connexions que vous avez choisi. Cela désactivera le pool de connexions interne d'Hibernate. Vous pouvez par exemple utiliser C3P0.

source: C3P0 is an open source JDBC connection pool distributed along with Hibernate in the <literal>lib</literal> directory. Hibernate will use its <literal>C3P0ConnectionProvider</literal> for connection pooling if you set <literal>hibernate.c3p0.*</literal> properties. If you'd like to use Proxool refer to the packaged <literal>hibernate.properties</literal> and the Hibernate web site for more information.
fr_fr: C3P0 est un pool de connexions JDBC open source distribué avec Hibernate dans le répertoire <literal>lib</literal>. Hibernate utilisera son provider <literal>C3P0ConnectionProvider</literal> pour le pool de connexions si vous positionnez les propriétés <literal>hibernate.c3p0.*</literal>. Si vous voulez utiliser Proxool, référez vous au groupe de propriétés d'<literal>hibernate.properties</literal> correspondant et regardez sur le site web d'Hibernate pour plus d'informations.

source: Here is an example <literal>hibernate.properties</literal> file for C3P0:
fr_fr: Voici un exemple de fichier <literal>hibernate.properties</literal> pour C3P0:

source: <![CDATA[hibernate.connection.driver_class = org.postgresql.Driver hibernate.connection.url = jdbc:postgresql://localhost/mydatabase hibernate.connection.username = myuser hibernate.connection.password = secret hibernate.c3p0.min_size=5 hibernate.c3p0.max_size=20 hibernate.c3p0.timeout=1800 hibernate.c3p0.max_statements=50 hibernate.dialect = org.hibernate.dialect.PostgreSQLDialect]]>
fr_fr: <![CDATA[hibernate.connection.driver_class = org.postgresql.Driver hibernate.connection.url = jdbc:postgresql://localhost/mydatabase hibernate.connection.username = myuser hibernate.connection.password = secret hibernate.c3p0.min_size=5 hibernate.c3p0.max_size=20 hibernate.c3p0.timeout=1800 hibernate.c3p0.max_statement=50 hibernate.dialect = org.hibernate.dialect.PostgreSQLDialect]]>

source: For use inside an application server, you should almost always configure Hibernate to obtain connections from an application server <literal>Datasource</literal> registered in JNDI. You'll need to set at least one of the following properties:
fr_fr: Dans le cadre de l'utilisation au sein d'un serveur d'applications, vous devriez quasiment toujours configurer Hibernate pour qu'il obtienne ses connexions de la <literal>DataSource</literal> du serveur d'application enregistrée dans le JNDI. Pour cela vous devrez définir au moins une des propriétés suivantes :

source: Hibernate Datasource Properties
fr_fr: Propriété d'une Datasource Hibernate

source: datasource JNDI name
fr_fr: Nom JNDI de la datasource

source: <emphasis>URL of the JNDI provider</emphasis> (optional)
fr_fr: <emphasis>URL du fournisseur JNDI</emphasis> (optionnelle)

source: <emphasis>class of the JNDI <literal>InitialContextFactory</literal></emphasis> (optional)
fr_fr: <emphasis>Classe de l'<literal>InitialContextFactory</literal> du JNDI</emphasis> (optionnelle)

source: <emphasis>database user</emphasis> (optional)
fr_fr: <emphasis>utilisateur de la base de données</emphasis> (optionnelle)

source: <emphasis>database user password</emphasis> (optional)
fr_fr: <emphasis>mot de passe de la base de données</emphasis> (optionnelle)

source: Here's an example <literal>hibernate.properties</literal> file for an application server provided JNDI datasource:
fr_fr: Voici un exemple de fichier <literal>hibernate.properties</literal> pour l'utilisation d'une datasource JNDI fournie par un serveur d'applications :

source: JDBC connections obtained from a JNDI datasource will automatically participate in the container-managed transactions of the application server.
fr_fr: Les connexions JDBC obtenues à partir d'une datasource JNDI participeront automatiquement aux transactions gérées par le conteneur du serveur d'applications.

source: Arbitrary connection properties may be given by prepending "<literal>hibernate.connection</literal>" to the property name. For example, you may specify a <literal>charSet</literal> using <literal>hibernate.connection.charSet</literal>.
fr_fr: Des propriétés supplémentaires de connexion peuvent être passées en préfixant le nom de la propriété par "<literal>hibernate.connnection</literal>". Par exemple, vous pouvez spécifier un jeu de caractères en utilisant <literal>hibernate.connection.charSet</literal>.

source: You may define your own plugin strategy for obtaining JDBC connections by implementing the interface <literal>org.hibernate.connection.ConnectionProvider</literal>. You may select a custom implementation by setting <literal>hibernate.connection.provider_class</literal>.
fr_fr: Vous pouvez fournir votre propre stratégie d'obtention des connexions JDBC en implémentant l'interface <literal>org.hibernate.connection.ConnectionProvider</literal>. Vous pouvez sélectionner une implémentation spécifique en positionnant <literal>hibernate.connection.provider_class</literal>.

source: Optional configuration properties
fr_fr: Propriétés de configuration optionnelles

source: There are a number of other properties that control the behaviour of Hibernate at runtime. All are optional and have reasonable default values.
fr_fr: Il y a un certain nombre d'autres propriétés qui contrôlent le fonctionnement d'Hibernate à l'exécution. Toutes sont optionnelles et ont comme valeurs par défaut des valeurs "raisonnables" pour un fonctionnement nominal.

source: <emphasis>Warning: some of these properties are "system-level" only.</emphasis> System-level properties can be set only via <literal>java -Dproperty=value</literal> or <literal>hibernate.properties</literal>. They may <emphasis>not</emphasis> be set by the other techniques described above.
fr_fr: <emphasis>Attention : Certaines de ces propriétés sont uniquement de niveau System.</emphasis> Les propriétés de niveau System ne peuvent être positionnées que via la ligne de commande (<literal>java -Dproperty=value</literal>) ou être définies dans <literal>hibernate.properties</literal>. Elle <emphasis>ne peuvent pas</emphasis> l'être via une des autres techniques décrites ci-dessus.

source: Hibernate Configuration Properties
fr_fr: Propriétés de configuration d'Hibernate

source: The classname of a Hibernate <literal>Dialect</literal> which allows Hibernate to generate SQL optimized for a particular relational database.
fr_fr: Le nom de la classe du <literal>Dialect</literal> Hibernate. qui permet à Hibernate de générer du SQL optimisé pour une base de données relationnelle particulière.

source: <emphasis role="strong">eg.</emphasis> <literal>full.classname.of.Dialect</literal>
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>nom.complet.de.ma.classe.de.Dialect</literal>

source: Write all SQL statements to console. This is an alternative to setting the log category <literal>org.hibernate.SQL</literal> to <literal>debug</literal>.
fr_fr: Ecrit toutes les requêtes SQL sur la console. Il s'agit d'une alternative au positionnement de la catégorie de log <literal>org.hibernate.SQL</literal> au niveau <literal>debug</literal>.

source: <emphasis role="strong">eg.</emphasis> <literal>true</literal> | <literal>false</literal>
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>true</literal> | <literal>false</literal>

source: Pretty print the SQL in the log and console.
fr_fr: Formate et indente le sql dans la console et dans le log

source: Qualify unqualified table names with the given schema/tablespace in generated SQL.
fr_fr: Positionne dans le SQL généré un schéma/tablespace par défaut pour les noms de table ne l'ayant pas surchargé.

source: <emphasis role="strong">eg.</emphasis> <literal>SCHEMA_NAME</literal>
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>MON_SCHEMA</literal>

source: Qualify unqualified table names with the given catalog in generated SQL.
fr_fr: Qualifie les noms de tables non qualifiées avec ce catalogue dans le SQL généré.

source: <emphasis role="strong">eg.</emphasis> <literal>CATALOG_NAME</literal>
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>CATALOG_NAME</literal>

source: The <literal>SessionFactory</literal> will be automatically bound to this name in JNDI after it has been created.
fr_fr: La <literal>SessionFactory</literal> sera automatiquement liée à ce nom dans le JNDI après sa création.

source: <emphasis role="strong">eg.</emphasis> <literal>jndi/composite/name</literal>
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>jndi/nom/hierarchique</literal>

source: Set a maximum "depth" for the outer join fetch tree for single-ended associations (one-to-one, many-to-one). A <literal>0</literal> disables default outer join fetching.
fr_fr: Définit la profondeur maximale d'un arbre de chargement par jointures ouvertes pour les associations à cardinalité unitaire (un-à-un, plusieurs-à-un). Un <literal>0</literal> désactive le chargement par jointure ouverte.

source: <emphasis role="strong">eg.</emphasis> recommended values between <literal>0</literal> and <literal>3</literal>
fr_fr: <emphasis role="strong">ex.</emphasis> valeurs recommandées entre <literal>0</literal> et <literal>3</literal>

source: Set a default size for Hibernate batch fetching of associations.
fr_fr: Définit une taille par défaut pour le chargement par lot des associations

source: <emphasis role="strong">eg.</emphasis> recommended values <literal>4</literal>, <literal>8</literal>, <literal>16</literal>
fr_fr: <emphasis role="strong">ex.</emphasis> Valeurs recommandées : <literal>4</literal>, <literal>8</literal>, <literal>16</literal>

source: Set a default mode for entity representation for all sessions opened from this <literal>SessionFactory</literal>
fr_fr: Définit un mode de représentation par défaut des entités pour toutes les sessions ouvertes depuis cette <literal>SessionFactory</literal>

source: Force Hibernate to order SQL updates by the primary key value of the items being updated. This will result in fewer transaction deadlocks in highly concurrent systems.
fr_fr: Force Hibernate à trier les updates SQL par la valeur de la clé primaire des éléments qui sont mis à jour. Cela permet de limiter les deadlocks de transaction dans les systèmes hautement concurents.

source: If enabled, Hibernate will collect statistics useful for performance tuning.
fr_fr: Si activé, Hibernate va collecter des statistiques utiles pour le réglage des performances.

source: hibernate.use_identifier_rollback
fr_fr: hibernate.use_identifer_rollback

source: If enabled, generated identifier properties will be reset to default values when objects are deleted.
fr_fr: Si activé, les propriétés correspondant à l'identifiant des objets vont être remises aux valeurs par défaut lorsque les objets seront supprimés.

source: If turned on, Hibernate will generate comments inside the SQL, for easier debugging, defaults to <literal>false</literal>.
fr_fr: Si activé, Hibernate va générer des commentaires à l'intérieur des requêtes SQL pour faciliter le debogage., par défaut à <literal>false</literal>.

source: Hibernate JDBC and Connection Properties
fr_fr: Propriétés Hibernate liées à JDBC et aux connexions

source: A non-zero value determines the JDBC fetch size (calls <literal>Statement.setFetchSize()</literal>).
fr_fr: Une valeur non nulle détermine la taille de chargement des statements JDBC (appelle <literal>Statement.setFetchSize()</literal>).

source: A non-zero value enables use of JDBC2 batch updates by Hibernate.
fr_fr: Une valeur non nulle active l'utilisation par Hibernate des mises à jour par batch de JDBC2.

source: <emphasis role="strong">eg.</emphasis> recommended values between <literal>5</literal> and <literal>30</literal>
fr_fr: <emphasis role="strong">ex.</emphasis> les valeurs recommandées entre <literal>5</literal> et <literal>30</literal>

source: Set this property to <literal>true</literal> if your JDBC driver returns correct row counts from <literal>executeBatch()</literal> (it is usually safe to turn this option on). Hibernate will then use batched DML for automatically versioned data. Defaults to <literal>false</literal>.
fr_fr: Paramétrez cette propriété à <literal>true</literal> si votre pilote JDBC retourne des row counts corrects depuis <literal>executeBatch()</literal> (il est souvent approprié d'activer cette option). Hibernate utilisera alors le "batched DML" pour versionner automatiquement les données. Par défaut = <literal>false</literal>.

source: Select a custom <literal>Batcher</literal>. Most applications will not need this configuration property.
fr_fr: Sélectionne un <literal>Batcher</literal> personnalisé. La plupart des applications n'auront pas besoin de cette propriété de configuration

source: <emphasis role="strong">eg.</emphasis> <literal>classname.of.BatcherFactory</literal>
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>classname.of.BatcherFactory</literal>

source: Enables use of JDBC2 scrollable resultsets by Hibernate. This property is only necessary when using user supplied JDBC connections, Hibernate uses connection metadata otherwise.
fr_fr: Active l'utilisation par Hibernate des resultsets scrollables de JDBC2. Cette propriété est seulement nécessaire lorsque l'on utilise une connexion JDBC fournie par l'utilisateur. Autrement, Hibernate utilise les métadonnées de la connexion.

source: Use streams when writing/reading <literal>binary</literal> or <literal>serializable</literal> types to/from JDBC (system-level property).
fr_fr: Utilise des flux lorsque l'on écrit/lit des types <literal>binary</literal> ou <literal>serializable</literal> vers et à partir de JDBC (propriété de niveau système).

source: Enable use of JDBC3 <literal>PreparedStatement.getGeneratedKeys()</literal> to retrieve natively generated keys after insert. Requires JDBC3+ driver and JRE1.4+, set to false if your driver has problems with the Hibernate identifier generators. By default, tries to determine the driver capabilities using connection metadata.
fr_fr: Active l'utilisation de <literal>PreparedStatement.getGeneratedKeys()</literal> de JDBC3 pour récupérer nativement les clés générées après insertion. Nécessite un pilote JDBC3+, le mettre à false si votre pilote a des problèmes avec les générateurs d'identifiant Hibernate. Par défaut, essaie de déterminer les possibilités du pilote en utilisant les meta données de connexion.

source: The classname of a custom <literal>ConnectionProvider</literal> which provides JDBC connections to Hibernate.
fr_fr: Le nom de la classe d'un <literal>ConnectionProvider</literal> personnalisé qui fournit des connexions JDBC à Hibernate

source: <emphasis role="strong">eg.</emphasis> <literal>classname.of.ConnectionProvider</literal>
fr_fr: <emphasis role="strong">ex.</emphasis> <literal>classname.of.ConnectionProvider</literal>
