Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/inheritance_mapping.po
Languages: es_es, ja_jp

source: Inheritance Mapping
es_es: Mapeo de Herencia
ja_jp: 継承マッピング

source: The Three Strategies
es_es: Las Tres Estrategias
ja_jp: 3つの戦略

source: Hibernate supports the three basic inheritance mapping strategies:
es_es: Hibernate soporta las tres estrategias básicas de mapeo de herencia:
ja_jp: Hibernateは3つの基本的な継承のマッピング戦略をサポートします。

source: table per class hierarchy
es_es: tabla por jerarquía de clases
ja_jp: <para>クラス階層ごとのテーブル（table-per-class-hierarchy）</para>

source: <para>table per subclass</para>
ja_jp: <para>サブクラスごとのテーブル（table-per-subclass）</para>

source: table per concrete class
es_es: tabla por clase concreta
ja_jp: <para>具象クラスごとのテーブル（table-per-concrete-class）</para>

source: In addition, Hibernate supports a fourth, slightly different kind of polymorphism:
es_es: En adición, Hibernate soporta un cuarto, ligeramente diferente tipo de polimorfismo:
ja_jp: 加えて4つ目に、Hibernateはわずかに異なる性質を持ったポリモーフィズムをサポートします。

source: implicit polymorphism
es_es: polimorfismo implícito
ja_jp: 暗黙的ポリモーフィズム

source: It is possible to use different mapping strategies for different branches of the same inheritance hierarchy, and then make use of implicit polymorphism to achieve polymorphism across the whole hierarchy. However, Hibernate does not support mixing <literal>&lt;subclass&gt;</literal>, and <literal>&lt;joined-subclass&gt;</literal> and <literal>&lt;union-subclass&gt;</literal> mappings under the same root <literal>&lt;class&gt;</literal> element. It is possible to mix together the table per hierarchy and table per subclass strategies, under the the same <literal>&lt;class&gt;</literal> element, by combining the <literal>&lt;subclass&gt;</literal> and <literal>&lt;join&gt;</literal> elements (see below).
es_es: UNTRANSLATED! It is possible to define <literal>subclass</literal>, <literal>union-subclass</literal>, and <literal>joined-subclass</literal> mappings in separate mapping documents, directly beneath <literal>hibernate-mapping</literal>. This allows you to extend a class hierachy just by adding a new mapping file. You must specify an <literal>extends</literal> attribute in the subclass mapping, naming a previously mapped superclass. Note: Previously this feature made the ordering of the mapping documents important. Since Hibernate3, the ordering of mapping files does not matter when using the extends keyword. The ordering inside a single mapping file still needs to be defined as superclasses before subclasses.
ja_jp: 同一の継承階層の異なるブランチに対して異なるマッピング戦略を使うことができます。 その場合には全体の階層に渡るポリモーフィズムを実現するために暗黙的ポリモーフィズムを使用します。 しかし、Hibernateは同じルート <literal>&lt;class&gt;</literal> 要素内で <literal>&lt;subclass&gt;</literal> マッピング、<literal>&lt;joined-subclass&gt;</literal> マッピング、 <literal>&lt;union-subclass&gt;</literal> マッピングの同時使用をサポートしていません。 <literal>&lt;subclass&gt;</literal> 要素と <literal>&lt;join&gt;</literal> 要素を組み合わせることで、 同一 <literal>&lt;class&gt;</literal> 要素内での table-per-hierarchy 戦略と table-per-subclass 戦略の同時使用は可能です。次の例を見てください。

source: It is possible to define <literal>subclass</literal>, <literal>union-subclass</literal>, and <literal>joined-subclass</literal> mappings in separate mapping documents, directly beneath <literal>hibernate-mapping</literal>. This allows you to extend a class hierachy just by adding a new mapping file. You must specify an <literal>extends</literal> attribute in the subclass mapping, naming a previously mapped superclass. Note: Previously this feature made the ordering of the mapping documents important. Since Hibernate3, the ordering of mapping files does not matter when using the extends keyword. The ordering inside a single mapping file still needs to be defined as superclasses before subclasses.
es_es: Es posible usar estrategias de mapeo diferentes para diferentes ramificaciones de la misma jerarquía de herencia, y entonces usar polimorfismo implícito para conseguir polimorfismo a través de toda la jerarquía. Sin embargo, Hibernate no soporta la mezcla de mapeos <literal>&lt;subclass&gt;</literal>, y <literal>&lt;joined-subclass&gt;</literal> y <literal>&lt;union-subclass&gt;</literal> bajo el mismo elemento <literal>&lt;class&gt;</literal> raíz. Es posible mezclar juntas las estrategias de tabla por jerarquía y tabla por subclase, bajo el mismo elemento <literal>&lt;class&gt;</literal>, combinando los elementos <literal>&lt;subclass&gt;</literal> y <literal>&lt;join&gt;</literal> (ver debajo).
ja_jp: <literal>subclass</literal>, <literal>union-subclass</literal> と <literal>joined-subclass</literal> マッピングを複数のマッピングドキュメントに定義することが出来、 <literal>hibernate-mapping</literal> の直下に配置します。 これは新しいマッピングファイルを追加するだけで、クラス階層を拡張できるということです。 あらかじめマップしたスーパークラスを指定して、サブクラスマッピングに <literal>extends</literal> 属性を記述しなければなりません。 注意：この特徴により、以前はマッピング・ドキュメントの順番が重要でした。 Hibernate3からは、extendsキーワードを使う場合、マッピングドキュメントの順番は問題になりません。 １つのマッピングファイル内で順番付けを行うときは、 依然として、サブクラスを定義する前にスーパークラスを定義する必要があります。)

source: Table per class hierarchy
es_es: Tabla por jerarquía de clases
ja_jp: <title>クラス階層ごとのテーブル（table-per-class-hierarchy）</title>

source: Suppose we have an interface <literal>Payment</literal>, with implementors <literal>CreditCardPayment</literal>, <literal>CashPayment</literal>, <literal>ChequePayment</literal>. The table per hierarchy mapping would look like:
es_es: Supón que tenemos una interface <literal>Payment</literal>, con los implementadores <literal>CreditCardPayment</literal>, <literal>CashPayment</literal>, <literal>ChequePayment</literal>. El mapeo de tabla por jerarquía se vería así:
ja_jp: 例えば、インターフェイス <literal>Payment</literal> と、それを実装した <literal>CreditCardPayment</literal>、<literal>CashPayment</literal>、 <literal>ChequePayment</literal> があるとします。階層ごとのテーブルマッピングは 以下のようになります。

source: Exactly one table is required. There is one big limitation of this mapping strategy: columns declared by the subclasses, such as <literal>CCTYPE</literal>, may not have <literal>NOT NULL</literal> constraints.
es_es: Se requiere exactamente una tabla. Hay una gran limitación de esta estrategia de mapeo: las columnas declaradas por las subclases, como <literal>CCTYPE</literal>, no pueden tener restricciones <literal>NOT NULL</literal>.
ja_jp: ちょうど一つのテーブルが必要です。 このマッピング戦略には一つ大きな制限があります。 <literal>CCTYPE</literal> のような、サブクラスで宣言されたカラムは <literal>NOT NULL</literal> 制約を持てません。

source: Table per subclass
es_es: Tabla por subclase
ja_jp: <title>サブクラスごとのテーブル（table-per-subclass）</title>

source: A table per subclass mapping would look like:
es_es: Un mapeo de tabla por sublclase se vería así:
ja_jp: table-per-subclass マッピングは以下のようになります。

source: Four tables are required. The three subclass tables have primary key associations to the superclass table (so the relational model is actually a one-to-one association).
es_es: Se requieren cuatro tablas. Las tres tablas de subclase tienen asociaciones de clave primaria a la tabla de superclase (de modo que en el modelo relacional es realmente una asociación uno-a-uno).
ja_jp: このマッピングには4つのテーブルが必要です。3つのサブクラステーブルは スーパークラステーブルとの関連を示す主キーを持っています （実際、関係モデル上は一対一関連です）。

source: Table per subclass, using a discriminator
es_es: Tabla por subclase, usando un discriminador
ja_jp: 弁別子を用いた table-per-subclass

source: Note that Hibernate's implementation of table per subclass requires no discriminator column. Other object/relational mappers use a different implementation of table per subclass which requires a type discriminator column in the superclass table. The approach taken by Hibernate is much more difficult to implement but arguably more correct from a relational point of view. If you would like to use a discriminator column with the table per subclass strategy, you may combine the use of <literal>&lt;subclass&gt;</literal> and <literal>&lt;join&gt;</literal>, as follow:
es_es: Observa que la implementación de Hibernate de tabla por subclase no requiere ninguna columna discriminadora. Otros mapeadores objeto/relacional usan una implementación diferente de tabla por subclase que requiere una columna discriminadora de tipo en la tabla de superclase. Este enfoque es mucho más difícil de implementar pero discutiblemente más correcto desde un punto de vista relacional. Si quisieras usar una columna discriminadora con la estrategia de tabla por subclase, puedes combinar el uso de <literal>&lt;subclass&gt;</literal> y <literal>&lt;join&gt;</literal>, como sigue:
ja_jp: Hibernateの table-per-subclass 実装は、discriminatorカラムを必要としないことを覚えておいてください。 Hibernate以外のO/Rマッパーは、table-per-subclass に異なる実装を用います。 それは、スーパークラスのテーブルにタイプdiscriminatorカラムを必要とします。 このアプローチは実装が困難になりますが、関係の視点から見ると、より正確なものです。 table-per-subclass 戦略でdiscriminatorカラムを使いたければ、 <literal>&lt;subclass&gt;</literal> と <literal>&lt;join&gt;</literal> を以下のように組み合わせて使ってください。

source: The optional <literal>fetch="select"</literal> declaration tells Hibernate not to fetch the <literal>ChequePayment</literal> subclass data using an outer join when querying the superclass.
es_es: la declaración opcional <literal>fetch="select"</literal> dice a Hibernate que no recupere los datos de la subclase <literal>ChequePayment</literal> usando una unión externa (outer join) al consultar la superclase.
ja_jp: オプションの <literal>fetch="select"</literal> 宣言は、 スーパークラスのクエリ実行時に外部結合を使って、 サブクラスの <literal>ChequePayment</literal> データを取得しないように指定するためのものです。

source: Mixing table per class hierarchy with table per subclass
es_es: Mezclando tabla por jerarquía de clases con tabla por subclase
ja_jp: table-per-subclass と table-per-class-hierarchy の混合

source: You may even mix the table per hierarchy and table per subclass strategies using this approach:
es_es: Puedes incluso mezclar las estrategias de tabla po jerarquía y tabla por subclase usando este enfoque:
ja_jp: このアプローチを使用すると、table-per-hierarchy と table-per-subclass 戦略を 組み合わせる事も可能です。

source: For any of these mapping strategies, a polymorphic association to the root <literal>Payment</literal> class is mapped using <literal>&lt;many-to-one&gt;</literal>.
es_es: Para cualquiera de estas estrategias de mapeo, una asociación polimórfica a la clase raíz <literal>Payment</literal> es mapeada usando <literal>&lt;many-to-one&gt;</literal>.
ja_jp: いずれのマッピング戦略であっても、ルートである <literal>Payment</literal> クラスへの ポリモーフィックな関連は <literal>&lt;many-to-one&gt;</literal> を使ってマッピングします。

source: Table per concrete class
es_es: Tabla por clase concreta
ja_jp: <title>具象クラスごとのテーブル（table-per-concrete-class）</title>

source: There are two ways we could go about mapping the table per concrete class strategy. The first is to use <literal>&lt;union-subclass&gt;</literal>.
es_es: Podríamos ir de dos maneras a la estrategia de mapeo de tabla por clase concreta. La primera es usar <literal>&lt;union-subclass&gt;</literal>.
ja_jp: table-per-concrete-class 戦略のマッピングに対するアプローチは、2つあります。 1つ目は <literal>&lt;union-subclass&gt;</literal> を利用する方法です。

source: Three tables are involved for the subclasses. Each table defines columns for all properties of the class, including inherited properties.
es_es: Están implicadas tres tablas. Cada tabla define columnas para todas las propiedades de la clase, inccluyendo las propiedades heredadas.
ja_jp: サブクラスごとに3つのテーブルが必要です。それぞれのテーブルは、継承プロパティを含んだ、 クラスの全てのプロパティに対するカラムを定義します。

source: The limitation of this approach is that if a property is mapped on the superclass, the column name must be the same on all subclass tables. (We might relax this in a future release of Hibernate.) The identity generator strategy is not allowed in union subclass inheritance, indeed the primary key seed has to be shared accross all unioned subclasses of a hierarchy.
es_es: La limitación de este enfoque es que si una propiedad es mapeada en la superclase, el nombre de columna debe ser el mismo en todas las tablas de subclase. (Podríamos relajar esto en un lanzamiento futuro de Hibernate.) La estrategia de generador de indentidad no está permitida en la herencia de unión de subclase, de hecho la semilla de clave primaria tiene que ser compartida a través de todas las subclases unidas de una jerarquía.
ja_jp: このアプローチには制限があります。 それは、プロパティがスーパークラスにマッピングされていた場合、 全てのサブクラスにおいてカラム名が同じでなければならないというものです。 （Hibernateの今後のリリースで緩和されるかもしれません）。 &lt;union-subclass&gt; を使った table-per-concrete-class 戦略では識別子生成戦略を使用できません。 主キーを生成するためのシードは、全ての union subclass の階層内で共有する必要があるからです。

source: If your superclass is abstract, map it with <literal>abstract="true"</literal>. Of course, if it is not abstract, an additional table (defaults to <literal>PAYMENT</literal> in the example above) is needed to hold instances of the superclass.
es_es: UNTRANSLATED! If your superclass is abstract, map it with <literal>abstract="true"</literal>. Of course, if it is not abstract, an additional table (defaults to <literal>PAYMENT</literal> in the example above) is needed to hold instances of the superclass.
ja_jp: もしスーパークラスが抽象クラスなら、<literal>abstract="true"</literal>とマッピングします。 もちろん、スーパークラスが抽象クラスでないなら、スーパークラスのインスタンスを 保持するためのテーブルの追加が必要となります(上の例でのデフォルトは <literal>PAYMENT</literal> )。

source: Table per concrete class, using implicit polymorphism
es_es: Tabla por clase concreta, usando polimorfismo implícito
ja_jp: 暗黙的ポリモーフィズムを用いた table-per-concrete-class

source: An alternative approach is to make use of implicit polymorphism:
es_es: Un enfoque alternativo es hacer uso de polimorfismo implícito:
ja_jp: もう一つのアプローチは暗黙的ポリモーフィズムの使用です。

source: Notice that nowhere do we mention the <literal>Payment</literal> interface explicitly. Also notice that properties of <literal>Payment</literal> are mapped in each of the subclasses. If you want to avoid duplication, consider using XML entities (e.g. <literal>[ &lt;!ENTITY allproperties SYSTEM "allproperties.xml"&gt; ]</literal> in the <literal>DOCTYPE</literal> declartion and <literal>&amp;allproperties;</literal> in the mapping).
es_es: Nota que en ningún sitio mencionamos la interface <literal>Payment</literal> explícitamente. Nota además que las propiedades de <literal>Payment</literal> son mapeadas en cada una de las subclases. Si quieres evitar duplicación, considera usar entidades XML. (por ejemplo, <literal>[ &lt;!ENTITY allproperties SYSTEM "allproperties.xml"&gt; ]</literal> en la declaración <literal>DOCTYPE</literal> y <literal>&amp;allproperties;</literal> en el mapeo).
ja_jp: <literal>Payment</literal> インターフェイスがどこにも明示的に示されていないことに注意してください。 そして、<literal>Payment</literal> プロパティがそれぞれのサブクラスにマッピングされていることにも注意してください。 もし重複を避けたいのであれば、XMLエンティティの利用を考えてください。 （例： <literal>DOCTYPE</literal> 宣言における <literal>[ &lt;!ENTITY allproperties SYSTEM "allproperties.xml"&gt; ]</literal> と、マッピングにおける <literal>&amp;allproperties;</literal>）

source: The disadvantage of this approach is that Hibernate does not generate SQL <literal>UNION</literal>s when performing polymorphic queries.
es_es: La desventaja de este enfoque es que Hibernate no genera <literal>UNION</literal>s de SQL al realizar consultas polimórficas.
ja_jp: このアプローチの欠点は、Hibernateがポリモーフィックなクエリの実行時にSQL <literal>UNION</literal> を生成しない点です。

source: For this mapping strategy, a polymorphic association to <literal>Payment</literal> is usually mapped using <literal>&lt;any&gt;</literal>.
es_es: Para esta estrategia de mapeo, una asociación polimórfica a <literal>Payment</literal> es mapeada generalmente usando <literal>&lt;any&gt;</literal>.
ja_jp: このマッピング戦略に対しては、<literal>Payment</literal> へのポリモーフィックな関連は 通常、<literal>&lt;any&gt;</literal> を使ってマッピングされます。

source: Mixing implicit polymorphism with other inheritance mappings
es_es: Mezclando polimorfismo implícito con otros mapeos de herencia
ja_jp: 他の継承マッピングと暗黙的ポリモーフィズムの組み合わせ

source: There is one further thing to notice about this mapping. Since the subclasses are each mapped in their own <literal>&lt;class&gt;</literal> element (and since <literal>Payment</literal> is just an interface), each of the subclasses could easily be part of another inheritance hierarchy! (And you can still use polymorphic queries against the <literal>Payment</literal> interface.)
es_es: Hay una cosa más por notar acerca de este mapeo. Ya que las subclases se mapean cada una en su propio elemento <literal>&lt;class&gt;</literal> (y ya que <literal>Payment</literal> es sólo una interface), cada una de las subclases podría ser parte de otra jerarquía de herencia! (Y todavía puedes seguir usando consultas polimórficas contra la interface <literal>Payment</literal>.)
ja_jp: このマッピングについての更なる注意点があります。 サブクラスが自身を <literal>&lt;class&gt;</literal> 要素としてマッピングしているので、 （かつ <literal>Payment</literal> は単なるインターフェイスなので）、 それぞれのサブクラスは簡単にその他の継承階層の一部となります。 （しかも、今までどおり <literal>Payment</literal> インターフェイスに対するポリモーフィックなクエリ を使用することができます）

source: Once again, we don't mention <literal>Payment</literal> explicitly. If we execute a query against the <literal>Payment</literal> interface - for example, <literal>from Payment</literal> - Hibernate automatically returns instances of <literal>CreditCardPayment</literal> (and its subclasses, since they also implement <literal>Payment</literal>), <literal>CashPayment</literal> and <literal>ChequePayment</literal> but not instances of <literal>NonelectronicTransaction</literal>.
es_es: Una vez más, no mencionamos a <literal>Payment</literal> explícitamente. Si ejecutamos una consulta contra la interface <literal>Payment</literal> - por ejemplo, <literal>from Payment</literal> - Hibernate devuelve automáticamente instancias de <literal>CreditCardPayment</literal> (y sus subclases, ya que ellas también implementan <literal>Payment</literal>), <literal>CashPayment</literal> y <literal>ChequePayment</literal> pero no instancias de <literal>NonelectronicTransaction</literal>.
ja_jp: もう一度述べますが、<literal>Payment</literal> は明示的に定義されません。 もし、<literal>Payment</literal> インターフェイスに対してクエリを実行するなら （例えば <literal>from Payment</literal> 節を使って）、 Hibernateは自動的に <literal>CreditCardPayment</literal> （とCreditCardPaymentのサブクラス、<literal>Payment</literal> の実装であるため）、 および、<literal>CashPayment</literal> 、<literal>ChequePayment</literal> のインスタンスを返します。 <literal>NonelectronicTransaction</literal> インスタンスは返しません。

source: Limitations
es_es: Limitaciones
ja_jp: <title>制限</title>

source: There are certain limitations to the "implicit polymorphism" approach to the table per concrete-class mapping strategy. There are somewhat less restrictive limitations to <literal>&lt;union-subclass&gt;</literal> mappings.
es_es: Existen ciertas limitaciones al enfoque de "polimorfismo implícito" en la estrategia de mapeo de tabla por clase concreta. Existen limitaciones algo menos restrictivas a los mapeos <literal>&lt;union-subclass&gt;</literal>.
ja_jp: table-per-concrete-class マッピング戦略への「暗黙的ポリモーフィズム」アプローチには いくつかの制限があります。<literal>&lt;union-subclass&gt;</literal> マッピングに対しても 少し弱めの制限があります。

source: The following table shows the limitations of table per concrete-class mappings, and of implicit polymorphism, in Hibernate.
es_es: La siguiente tabla muestra las limitaciones de mapeos de tabla por clase concreta, y de polmorfismo implícito, en Hibernate.
ja_jp: 次のテーブルに、Hibernateにおけるtable-per-concrete-classマッピングの 制限や暗黙的ポリモーフィズムの制限を示します。

source: Features of inheritance mappings
es_es: Funcionalidades de mapeo de herencia
ja_jp: 継承マッピングの機能

source: Inheritance strategy
es_es: Estrategia de herencia
ja_jp: 継承戦略

source: Polymorphic many-to-one
es_es: muchos-a-uno polimórfica
ja_jp: 多対一のポリモーフィズム

source: Polymorphic one-to-one
es_es: uno-a-uno polimórfica
ja_jp: 一対一のポリモーフィズム

source: Polymorphic one-to-many
es_es: uno-a-muchos polimórfica
ja_jp: 一対多のポリモーフィズム

source: Polymorphic many-to-many
es_es: mushos-a-muchos polimórfica
ja_jp: 多対多のポリモーフィズム

source: Polymorphic <literal>load()/get()</literal>
ja_jp: ポリモーフィズムを使った<literal>load()/get()</literal>

source: Polymorphic queries
es_es: Consultas polimórficas
ja_jp: ポリモーフィズムを使ったクエリ

source: Polymorphic joins
es_es: Uniones polimórficas
ja_jp: ポリモーフィズムを使った結合

source: Outer join fetching
es_es: Recuperación por unión externa (outer join)
ja_jp: 外部結合によるフェッチ

source: supported
es_es: soportada
ja_jp: サポート

source: <entry>table per subclass</entry>
ja_jp: table per subclass

source: not supported
ja_jp: サポートしていません

source: ROLES_OF_TRANSLATORS
ja_jp: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
ja_jp: <!--TRANS:CREDIT_FOR_TRANSLATORS-->

source: table per class-hierarchy
es_es: tabla por jerarquía de clases

source: table per concrete-class (union-subclass)
es_es: tabla por clase concreta (union-subclass)

source: table per concrete class (implicit polymorphism)
es_es: tabla por clase concreta (polimorfismo implícito)
