Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/performance.po
Languages: fr_fr, ja_jp

source: Suppose we add a single element to a collection of size twenty and then remove two elements. Hibernate will issue one <literal>INSERT</literal> statement and two <literal>DELETE</literal> statements (unless the collection is a bag). This is certainly desirable.
fr_fr: Parfois, effacer les éléments d'une collection un par un peut être extrêmement inefficace. Hibernate n'est pas totalement stupide, il sait qu'il ne faut pas le faire dans le cas d'une collection complètement vidée (lorsque vous appellez <literal>list.clear()</literal>, par exemple). Dans ce cas, Hibernate fera un simple <literal>DELETE</literal> et le travail est fait !
ja_jp: 一括削除

source: However, suppose that we remove eighteen elements, leaving two and then add thee new elements. There are two possible ways to proceed
fr_fr: Supposons que nous ajoutions un élément dans une collection de taille vingt et que nous enlevions ensuite deux éléments. Hibernate effectuera un <literal>INSERT</literal> puis deux <literal>DELETE</literal> (à moins que la collection ne soit un bag). Ce qui est souhaitable.
ja_jp: 時々、コレクションの要素を一つ一つ削除することは極めて非効率的になることがあります。 Hibernateは愚かではないので、新しい空のコレクションの場合（ <literal>list.clear()</literal> を呼び出した場合など）ではこれをすべきでないことを知っています。この場合は、Hibernateは <literal>DELETE</literal> を一回発行して、それですべて終わります！

source: delete eighteen rows one by one and then insert three rows
fr_fr: Cependant, supposons que nous enlevions dix huit éléments, laissant ainsi deux éléments, puis que nous ajoutions trois nouveaux éléments. Il y a deux moyens de procéder.
ja_jp: サイズ20のコレクションに一つの要素を追加し、それから二つの要素を削除するとします。 Hibernateは一つの <literal>INSERT</literal> 文と二つの <literal>DELETE</literal> 文を発行します （コレクションがbagでなければ）。これは確かに望ましい動作です。

source: remove the whole collection (in one SQL <literal>DELETE</literal>) and insert all five current elements (one by one)
fr_fr: effacer dix huit enregistrements un à un puis en insérer trois
ja_jp: しかし、18個の要素を削除して2つを残し、それから3つ新しい要素を追加するとします。 このとき二つの方法があります。

source: Hibernate isn't smart enough to know that the second option is probably quicker in this case. (And it would probably be undesirable for Hibernate to be that smart; such behaviour might confuse database triggers, etc.)
fr_fr: effacer la totalité de la collection (en un <literal>DELETE</literal> SQL) puis insérer les cinq éléments restant un à un
ja_jp: 18行を一つ一つ削除して、3行を追加する

source: Fortunately, you can force this behaviour (ie. the second strategy) at any time by discarding (ie. dereferencing) the original collection and returning a newly instantiated collection with all the current elements. This can be very useful and powerful from time to time.
fr_fr: Hibernate n'est pas assez intelligent pour savoir que, dans ce cas, la seconde méthode est plus rapide (Il plutôt heureux qu'Hibernate ne soit pas trop intelligent ; un tel comportement pourrait rendre l'utilisation de triggers de bases de données plutôt aléatoire, etc...).
ja_jp: コレクション全体を削除（ <literal>DELETE</literal> のSQLを一回）し、そして5つの要素すべてを （一つずつ）追加する

source: Of course, one-shot-delete does not apply to collections mapped <literal>inverse="true"</literal>.
fr_fr: Heureusement, vous pouvez forcer ce comportement lorsque vous le souhaitez, en liberant (c'est-à-dire en déréférençant) la collection initiale et en retournant une collection nouvellement instanciée avec les éléments restants. Ceci peut être très pratique et très puissant de temps en temps.
ja_jp: Hibernateはこの場合に2番目の方法がより速いだろうとわかるほど賢くはありません。 （そしてHibernateがこのように賢いことも望ましくないでしょう。このような振る舞いは データベースのトリガなどを混乱させるかもしれません。）

source: Monitoring performance
fr_fr: Bien sûr, la suppression en un coup ne s'applique pas pour les collections qui sont mappées avec <literal>inverse="true"</literal>.
ja_jp: 幸いにも、元のコレクションを捨て（つまり参照をやめて）、現在の要素をすべて持つ新しいコレクションの インスタンスを返すことで、いつでもこの振る舞い（2番目の戦略）を強制することが出来ます。 時にこれはとても便利で強力です。

source: Optimization is not much use without monitoring and access to performance numbers. Hibernate provides a full range of figures about its internal operations. Statistics in Hibernate are available per <literal>SessionFactory</literal>.
fr_fr: Moniteur de performance
ja_jp: もちろん、一括削除は <literal>inverse="true"</literal> を指定したコレクションには行いません。

source: Monitoring a SessionFactory
fr_fr: L'optimisation n'est pas d'un grand intérêt sans le suivi et l'accès aux données de performance. Hibernate fournit toute une panoplie de rapport sur ses opérations internes. Les statistiques dans Hibernate sont fournies par <literal>SessionFactory</literal>.
ja_jp: パフォーマンスのモニタリング

source: You can access <literal>SessionFactory</literal> metrics in two ways. Your first option is to call <literal>sessionFactory.getStatistics()</literal> and read or display the <literal>Statistics</literal> yourself.
fr_fr: Suivi d'une SessionFactory
ja_jp: 最適化はモニタリングやパフォーマンスを示す数値がなければ十分に行えません。 Hibernateは内部処理のすべての範囲の数値を提供します。 Hibernateの統計情報は <literal>SessionFactory</literal> 単位で取得可能です。

source: Hibernate can also use JMX to publish metrics if you enable the <literal>StatisticsService</literal> MBean. You may enable a single MBean for all your <literal>SessionFactory</literal> or one per factory. See the following code for minimalistic configuration examples:
fr_fr: Vous pouvez accéder au métriques d'une <literal>SessionFactory</literal> de deux manières. La première option est d'appeler <literal>sessionFactory.getStatistics()</literal> et de lire ou d'afficher les <literal>Statistics</literal> vous même.
ja_jp: SessionFactoryのモニタリング

source: <![CDATA[// MBean service registration for a specific SessionFactory Hashtable tb = new Hashtable(); tb.put("type", "statistics"); tb.put("sessionFactory", "myFinancialApp"); ObjectName on = new ObjectName("hibernate", tb); // MBean object name StatisticsService stats = new StatisticsService(); // MBean implementation stats.setSessionFactory(sessionFactory); // Bind the stats to a SessionFactory server.registerMBean(stats, on); // Register the Mbean on the server]]>
fr_fr: Hibernate peut également utiliser JMX pour publier les métriques si vous activez le MBean <literal>StatisticsService</literal>. Vous pouvez activer un seul MBean pour toutes vos <literal>SessionFactory</literal> ou un par factory. Voici un code qui montre un exemple de configuration minimaliste :
ja_jp: <literal>SessionFactory</literal> のメトリクスにアクセスするには2つの方法があります。 最初の方法は、 <literal>sessionFactory.getStatistics()</literal> を呼び出し、 自分で <literal>Statistics</literal> の読み込みや表示を行います。

source: <![CDATA[// MBean service registration for all SessionFactory's Hashtable tb = new Hashtable(); tb.put("type", "statistics"); tb.put("sessionFactory", "all"); ObjectName on = new ObjectName("hibernate", tb); // MBean object name StatisticsService stats = new StatisticsService(); // MBean implementation server.registerMBean(stats, on); // Register the MBean on the server]]>
fr_fr: <![CDATA[// MBean service registration for a specific SessionFactory Hashtable tb = new Hashtable(); tb.put("type", "statistics"); tb.put("sessionFactory", "myFinancialApp"); ObjectName on = new ObjectName("hibernate", tb); // MBean object name StatisticsService stats = new StatisticsService(); // MBean implementation stats.setSessionFactory(sessionFactory); // Bind the stats to a SessionFactory server.registerMBean(stats, on); // Register the Mbean on the server]]>
ja_jp: <literal>StatisticsService</literal> MBeanを有効にしていれば、HibernateはJMXを使って メトリクスを発行することもできます。1つのMBeanをすべての <literal>SessionFactory</literal> に対して有効にするか、SessionFactoryごとに一つのMBeanを有効にすることが出来ます。 最小限の設定例である以下のコードを見てください。

source: TODO: This doesn't make sense: In the first case, we retrieve and use the MBean directly. In the second one, we must give the JNDI name in which the session factory is held before using it. Use <literal>hibernateStatsBean.setSessionFactoryJNDIName("my/JNDI/Name")</literal>
fr_fr: <![CDATA[// MBean service registration for all SessionFactory's Hashtable tb = new Hashtable(); tb.put("type", "statistics"); tb.put("sessionFactory", "all"); ObjectName on = new ObjectName("hibernate", tb); // MBean object name StatisticsService stats = new StatisticsService(); // MBean implementation server.registerMBean(stats, on); // Register the MBean on the server]]>
ja_jp: <![CDATA[// MBean service registration for a specific SessionFactory Hashtable tb = new Hashtable(); tb.put("type", "statistics"); tb.put("sessionFactory", "myFinancialApp"); ObjectName on = new ObjectName("hibernate", tb); // MBean object name StatisticsService stats = new StatisticsService(); // MBean implementation stats.setSessionFactory(sessionFactory); // Bind the stats to a SessionFactory server.registerMBean(stats, on); // Register the Mbean on the server]]>

source: You can (de)activate the monitoring for a <literal>SessionFactory</literal>
fr_fr: TODO: Cela n'a pas de sens : dans le premier cs on récupère et on utilise le MBean directement. Dans le second, on doit fournir le nom JNDI sous lequel est retenu la fabrique de session avant de l'utiliser. Pour cela il faut utiliser <literal>hibernateStatsBean.setSessionFactoryJNDIName("my/JNDI/Name")</literal>
ja_jp: <![CDATA[// MBean service registration for all SessionFactory's Hashtable tb = new Hashtable(); tb.put("type", "statistics"); tb.put("sessionFactory", "all"); ObjectName on = new ObjectName("hibernate", tb); // MBean object name StatisticsService stats = new StatisticsService(); // MBean implementation server.registerMBean(stats, on); // Register the MBean on the server]]>

source: at configuration time, set <literal>hibernate.generate_statistics</literal> to <literal>false</literal>
fr_fr: Vous pouvez (dés)activer le suivi pour une <literal>SessionFactory</literal>
ja_jp: TODO: これは意味がありません。最初のケースは、MBeanを直接復元して使用します。2番目のケースは、 使う前にsession factoryが持っているJNDI名を渡さなければなりません。 <literal>hibernateStatsBean.setSessionFactoryJNDIName("my/JNDI/Name")</literal> を使ってください。

source: at runtime: <literal>sf.getStatistics().setStatisticsEnabled(true)</literal> or <literal>hibernateStatsBean.setStatisticsEnabled(true)</literal>
fr_fr: au moment de la configuration en mettant <literal>hibernate.generate_statistics</literal> à <literal>false</literal>
ja_jp: <literal>SessionFactory</literal> に対してモニタリングの開始（終了）を行うことが出来ます。

source: Statistics can be reset programatically using the <literal>clear()</literal> method. A summary can be sent to a logger (info level) using the <literal>logSummary()</literal> method.
fr_fr: à chaud avec <literal>sf.getStatistics().setStatisticsEnabled(true)</literal> ou <literal>hibernateStatsBean.setStatisticsEnabled(true)</literal>
ja_jp: 設定時には、 <literal>hibernate.generate_statistics</literal> を <literal>false</literal> にします

source: Metrics
fr_fr: Les statistiques peuvent être remises à zéro de manière programmatique à l'aide de la méthode <literal>clear()</literal> Un résumé peut être envoyé à un logger (niveau info) à l'aide de la méthode <literal>logSummary()</literal>
ja_jp: 実行時に、 <literal>sf.getStatistics().setStatisticsEnabled(true)</literal> または <literal>hibernateStatsBean.setStatisticsEnabled(true)</literal> を呼び出します

source: Hibernate provides a number of metrics, from very basic to the specialized information only relevant in certain scenarios. All available counters are described in the <literal>Statistics</literal> interface API, in three categories:
fr_fr: Métriques
ja_jp: 統計は <literal>clear()</literal> メソッドを使って手動でリセットすることが出来ます。 サマリは <literal>logSummary()</literal> メソッドを使ってloggerに送ることが出来ます （infoレベルです）。

source: Metrics related to the general <literal>Session</literal> usage, such as number of open sessions, retrieved JDBC connections, etc.
fr_fr: Hibernate fournit un certain nombre de métriques, qui vont des informations très basiques aux informations très spécialisées qui ne sont appropriées que dans certains scenarii. Tous les compteurs accessibles sont décrits dans l'API de l'interface <literal>Statistics</literal> dans trois catégories :
ja_jp: メトリクス

source: Metrics related to he entities, collections, queries, and caches as a whole (aka global metrics),
fr_fr: Les métriques relatives à l'usage général de la <literal>Session</literal> comme le nombre de sessions ouvertes, le nombre de connexions JDBC récupérées, etc...
ja_jp: 多くのものがあります。すべての使用可能なカウンタは <literal>Statistics</literal> インターフェイスのAPIに書かれており、3つの分類があります。

source: Detailed metrics related to a particular entity, collection, query or cache region.
fr_fr: Les métriques relatives aux entités, collections, requêtes et caches dans leur ensemble (métriques globales),
ja_jp: メトリクスは一般的な <literal>Session</literal> の使い方と関係しています。 オープンしたセッションの数がJDBCコネクションと関連しているのと同じです。

source: For exampl,e you can check the cache hit, miss, and put ratio of entities, collections and queries, and the average time a query needs. Beware that the number of milliseconds is subject to approximation in Java. Hibernate is tied to the JVM precision, on some platforms this might even only be accurate to 10 seconds.
fr_fr: Les métriques détaillées relatives à une entité, une collection, une requête ou une région de cache particulière.
ja_jp: メトリクスは要素、コレクション、クエリやキャッシュなど全体に 関係しています（別名はグローバルメトリクスです）。

source: Simple getters are used to access the global metrics (i.e. not tied to a particular entity, collection, cache region, etc.). You can access the metrics of a particular entity, collection or cache region through its name, and through its HQL or SQL representation for queries. Please refer to the <literal>Statistics</literal>, <literal>EntityStatistics</literal>, <literal>CollectionStatistics</literal>, <literal>SecondLevelCacheStatistics</literal>, and <literal>QueryStatistics</literal> API Javadoc for more information. The following code shows a simple example:
fr_fr: Par exemple, vous pouvez vérifier l'accès au cache ainsi que le taux d'éléments manquants et de mise à jour des entités, collections et requêtes et le temps moyen que met une requête. Il faut faire attention au fait que le nombre de millisecondes est sujet à approximation en Java. Hibernate est lié à la précision de la machine virtuelle, sur certaines plateformes, cela n'offre qu'une précision de l'ordre de 10 secondes.
ja_jp: メトリクスの詳細は特定のエンティティ、コレクション、クエリ、キャッシュ領域に関係しています。

source: <![CDATA[Statistics stats = HibernateUtil.sessionFactory.getStatistics(); double queryCacheHitCount = stats.getQueryCacheHitCount(); double queryCacheMissCount = stats.getQueryCacheMissCount(); double queryCacheHitRatio = queryCacheHitCount / (queryCacheHitCount + queryCacheMissCount); log.info("Query Hit ratio:" + queryCacheHitRatio); EntityStatistics entityStats = stats.getEntityStatistics( Cat.class.getName() ); long changes = entityStats.getInsertCount() + entityStats.getUpdateCount() + entityStats.getDeleteCount(); log.info(Cat.class.getName() + " changed " + changes + "times" );]]>
fr_fr: Des accesseurs simples sont utilisés pour accéder aux métriques globales (e.g. celles qui ne sont pas liées à une entité, collection ou région de cache particulière). Vous pouvez accéder aux métriques d'une entité, collection, région de cache particulière à l'aide de son nom et à l'aide de sa représentation HQL ou SQL pour une requête. Référez vous à la javadoc des APIS <literal>Statistics</literal>, <literal>EntityStatistics</literal>, <literal>CollectionStatistics</literal>, <literal>SecondLevelCacheStatistics</literal>, and <literal>QueryStatistics</literal> pour plus d'informations. Le code ci-dessous montre un exemple simple :
ja_jp: 例として、キャッシュのヒット、ヒットミスや、要素、コレクション、クエリの割合、クエリの実行に 必要な平均時間を確認できます。ミリ秒の数値はJavaの近似を受けることに注意してください。 HibernateはJVMの精度に制限され、プラットフォームによっては10秒単位でしか正確でないかもしれません。

source: To work on all entities, collections, queries and region caches, you can retrieve the list of names of entities, collections, queries and region caches with the following methods: <literal>getQueries()</literal>, <literal>getEntityNames()</literal>, <literal>getCollectionRoleNames()</literal>, and <literal>getSecondLevelCacheRegionNames()</literal>.
fr_fr: <![CDATA[Statistics stats = HibernateUtil.sessionFactory.getStatistics(); double queryCacheHitCount = stats.getQueryCacheHitCount(); double queryCacheMissCount = stats.getQueryCacheMissCount(); double queryCacheHitRatio = queryCacheHitCount / (queryCacheHitCount + queryCacheMissCount); log.info("Query Hit ratio:" + queryCacheHitRatio); EntityStatistics entityStats = stats.getEntityStatistics( Cat.class.getName() ); long changes = entityStats.getInsertCount() + entityStats.getUpdateCount() + entityStats.getDeleteCount(); log.info(Cat.class.getName() + " changed " + changes + "times" );]]>
ja_jp: 単純なgetterはグローバルメトリクス（すなわち特定のエンティティ、コレクション、キャッシュ領域などに縛られない） にアクセスするために使います。特定のエンティティ、コレクション、キャッシュ領域のメトリクスは、 それらの名前や、クエリのHQL、SQL表現によってアクセスすることが出来ます。さらに詳しい情報は、 <literal>Statistics</literal> 、 <literal>EntityStatistics</literal> 、 <literal>CollectionStatistics</literal> 、 <literal>SecondLevelCacheStatistics</literal> 、 <literal>QueryStatistics</literal> APIのjavadocを 参照してください。以下のコードは簡単な例です。

source: appended paragraph 1
fr_fr: Pour travailler sur toutes les entités, collections, requêtes et régions de cache, vous pouvez récupérer la liste des noms des entités, collections, requêtes et régions de cache avec les méthodes : <literal>getQueries()</literal>, <literal>getEntityNames()</literal>, <literal>getCollectionRoleNames()</literal>, et <literal>getSecondLevelCacheRegionNames()</literal>.
ja_jp: <![CDATA[Statistics stats = HibernateUtil.sessionFactory.getStatistics(); double queryCacheHitCount = stats.getQueryCacheHitCount(); double queryCacheMissCount = stats.getQueryCacheMissCount(); double queryCacheHitRatio = queryCacheHitCount / (queryCacheHitCount + queryCacheMissCount); log.info("Query Hit ratio:" + queryCacheHitRatio); EntityStatistics entityStats = stats.getEntityStatistics( Cat.class.getName() ); long changes = entityStats.getInsertCount() + entityStats.getUpdateCount() + entityStats.getDeleteCount(); log.info(Cat.class.getName() + " changed " + changes + "times" );]]>

source: ROLES_OF_TRANSLATORS
fr_fr: <!--TRANS:ROLES_OF_TRANSLATORS-->
ja_jp: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
fr_fr: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
ja_jp: <!--TRANS:CREDIT_FOR_TRANSLATORS-->

source: Cache
ja_jp: キャッシュ

source: Type
ja_jp: <entry>タイプ</entry>

source: appended paragraph 2
ja_jp: すべてのエンティティ、コレクション、クエリ、キャッシュ領域に対して行う場合は、 <literal>getQueries()</literal> 、 <literal>getEntityNames()</literal>、 <literal>getCollectionRoleNames()</literal> 、 <literal>getSecondLevelCacheRegionNames()</literal> メソッドで それぞれの名前のリストを取得することが出来ます。
