Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/performance.po
Languages: fr_fr, ja_jp

source: However, the situation is not quite as bad as it looks. Even though we now have two references to different proxy objects, the underlying instance will still be the same object:
fr_fr: Cette situation n'est pas si mauvaise qu'il n'y parait. Même si nous avons deux références à deux objets proxys différents, l'instance de base sera quand même le même objet :
ja_jp: しかし、これは見かけほど悪い状況というわけではありません。たとえ異なったプロキシオブジェクトへの 二つの参照があったとしても、基となるインスタンスは同じオブジェクトです。

source: <![CDATA[cat.setWeight(11.0); // hit the db to initialize the proxy System.out.println( dc.getWeight() ); // 11.0]]>
fr_fr: <![CDATA[cat.setWeight(11.0); // interroge la base de données pour initialiser le proxy System.out.println( dc.getWeight() ); // 11.0]]>

source: Third, you may not use a CGLIB proxy for a <literal>final</literal> class or a class with any <literal>final</literal> methods.
fr_fr: Troisièmement, vous ne pourrez pas utiliser un proxy CGLIB pour une classe <literal>final</literal> ou pour une classe contenant la moindre méthode <literal>final</literal>.
ja_jp: 第三に、 <literal>final</literal> クラスや <literal>final</literal> メソッドを持つクラスに CGLIBプロキシを使えません。

source: Finally, if your persistent object acquires any resources upon instantiation (eg. in initializers or default constructor), then those resources will also be acquired by the proxy. The proxy class is an actual subclass of the persistent class.
fr_fr: Enfin, si votre objet persistant obtient une ressource à l'instanciation (par example dans les initialiseurs ou dans le contructeur par défaut), alors ces ressources seront aussi obtenues par le proxy. La classe proxy est vraiment une sous classe de la classe persistante.
ja_jp: 最後に、もし永続オブジェクトのインスタンス化時(例えば、初期化処理やデフォルトコンストラクタの中で) になんらかのリソースが必要となるなら、そのリソースもまたプロキシを通して取得されます。 実際には、プロキシクラスは永続クラスのサブクラスです。

source: These problems are all due to fundamental limitations in Java's single inheritance model. If you wish to avoid these problems your persistent classes must each implement an interface that declares its business methods. You should specify these interfaces in the mapping file. eg.
fr_fr: Ces problèmes sont tous dus aux limitations fondamentales du modèle d'héritage unique de Java. Si vous souhaitez éviter ces problèmes, vos classes persistantes doivent chacune implémenter une interface qui déclare ses méthodes métier. Vous devriez alors spécifier ces interfaces dans le fichier de mapping :
ja_jp: これらの問題はJavaの単一継承モデルの原理上の制限のためです。もしこれらの問題を避けたいのなら、 ビジネスメソッドを宣言したインターフェイスをそれぞれ永続クラスで実装しなければなりません。 マッピングファイルでこれらのインターフェイスを指定する必要があります。例：

source: where <literal>CatImpl</literal> implements the interface <literal>Cat</literal> and <literal>DomesticCatImpl</literal> implements the interface <literal>DomesticCat</literal>. Then proxies for instances of <literal>Cat</literal> and <literal>DomesticCat</literal> may be returned by <literal>load()</literal> or <literal>iterate()</literal>. (Note that <literal>list()</literal> does not usually return proxies.)
fr_fr: où <literal>CatImpl</literal> implémente l'interface <literal>Cat</literal> et <literal>DomesticCatImpl</literal> implémente l'interface <literal>DomesticCat</literal>. Ainsi, des proxys pour les instances de <literal>Cat</literal> et <literal>DomesticCat</literal> pourraient être retournées par <literal>load()</literal> ou <literal>iterate()</literal> (Notez que <literal>list()</literal> ne retourne généralement pas de proxy).
ja_jp: <literal>CatImpl</literal> は <literal>Cat</literal> インターフェイスを実装するのに対し、 <literal>DomesticCatImpl</literal> は <literal>DomesticCat</literal> を実装します。 すると、 <literal>load()</literal> や <literal>iterate()</literal> は、 <literal>Cat</literal> や <literal>DomesticCat</literal> のインスタンスのプロキシを 返します。（ <literal>list()</literal> は通常はプロキシを返さないことに注意してください。）

source: Relationships are also lazily initialized. This means you must declare any properties to be of type <literal>Cat</literal>, not <literal>CatImpl</literal>.
fr_fr: Les relations sont aussi initialisées tardivement. Ceci signifie que vous devez déclarer chaque propriété comme étant de type <literal>Cat</literal>, et non <literal>CatImpl</literal>.
ja_jp: 関連も遅延初期化されます。これはプロパティを <literal>Cat</literal> 型で宣言しなければ ならないことを意味します。 <literal>CatImpl</literal> ではありません。

source: Certain operations do <emphasis>not</emphasis> require proxy initialization
fr_fr: Certaines opérations ne nécessitent pas l'initialisation du proxy
ja_jp: プロキシの初期化を <emphasis>必要としない</emphasis> 操作も存在します。

source: <literal>equals()</literal>, if the persistent class does not override <literal>equals()</literal>
fr_fr: <literal>equals()</literal>, si la classe persistante ne surcharge pas <literal>equals()</literal>
ja_jp: <literal>equals()</literal> （永続クラスが <literal>equals()</literal> を オーバーライドしないとき）

source: <literal>hashCode()</literal>, if the persistent class does not override <literal>hashCode()</literal>
fr_fr: <literal>hashCode()</literal>, si la classe persistante ne surcharge pas <literal>hashCode()</literal>
ja_jp: <literal>hashCode()</literal> （永続クラスが <literal>hashCode()</literal> を オーバーライドしないとき）

source: The identifier getter method
fr_fr: Le getter de l'identifiant
ja_jp: 識別子のgetterメソッド

source: Hibernate will detect persistent classes that override <literal>equals()</literal> or <literal>hashCode()</literal>.
fr_fr: Hibernate détectera les classes qui surchargent <literal>equals()</literal> ou <literal>hashCode()</literal>.
ja_jp: Hibernateは <literal>equals()</literal> や <literal>hashCode()</literal> をオーバーライドした 永続クラスを検出します。

source: By choosing <literal>lazy="no-proxy"</literal> instead of the default <literal>lazy="proxy"</literal>, we can avoid the problems associated with typecasting. However, we will require buildtime bytecode instrumentation, and all operations will result in immediate proxy initialization.
fr_fr: Eh choisissant <literal>lazy="no-proxy"</literal> au lieu de <literal>lazy="proxy"</literal> qui est la valeur par défaut, il est possible d'éviter les problèmes liés au transtypage. Il faudra alors une instrumentation du bytecode à la compilation et toutes les opérations résulterons immédiatement en une initialisation du proxy.
ja_jp: デフォルトの <literal>lazy="proxy"</literal> の代わりに、 <literal>lazy="no-proxy"</literal> を 選んだことで、型変換に関連する問題を回避することが出来ます。 しかし、ビルド時のバイトコード組み込みが必要になり、どのような操作であっても、 ただちにプロキシの初期化を行うことになるでしょう。

source: Initializing collections and proxies
fr_fr: Initialisation des collections et des proxys
ja_jp: コレクションとプロキシの初期化

source: A <literal>LazyInitializationException</literal> will be thrown by Hibernate if an uninitialized collection or proxy is accessed outside of the scope of the <literal>Session</literal>, ie. when the entity owning the collection or having the reference to the proxy is in the detached state.
fr_fr: Une exception de type <literal>LazyInitializationException</literal> sera renvoyée par hibernate si une collection ou un proxy non initialisé est accédé en dehors de la portée de la <literal>Session</literal>, e.g. lorsque l'entité à laquelle appartient la collection ou qui a une référence vers le proxy est dans l'état "détachée".
ja_jp: <literal>LazyInitializationException</literal> は、 <literal>Session</literal> のスコープ外から 初期化していないコレクションやプロキシにアクセスされたときに、Hibernateによってスローされます。 すなわち、コレクションやプロキシへの参照を持つエンティティが分離された状態の時です。

source: Sometimes we need to ensure that a proxy or collection is initialized before closing the <literal>Session</literal>. Of course, we can alway force initialization by calling <literal>cat.getSex()</literal> or <literal>cat.getKittens().size()</literal>, for example. But that is confusing to readers of the code and is not convenient for generic code.
fr_fr: Parfois, nous devons nous assurer qu'un proxy ou une collection est initialisée avant de fermer la <literal>Session</literal>. Bien sûr, nous pouvons toujours forcer l'initialisation en appelant par exemple <literal>cat.getSex()</literal> ou <literal>cat.getKittens().size()</literal>. Mais ceci n'est pas très lisible pour les personnes parcourant le code et n'est pas très générique.
ja_jp: <literal>Session</literal> をクローズする前にプロキシやコレクションの初期化を確実に 行いたいときがあります。もちろん、 <literal>cat.getSex()</literal> や <literal>cat.getKittens().size()</literal> などを常に呼び出すことで初期化を強制することはできます。 しかしこれはコードを読む人を混乱させ、汎用的なコードという点からも不便です。

source: The static methods <literal>Hibernate.initialize()</literal> and <literal>Hibernate.isInitialized()</literal> provide the application with a convenient way of working with lazily initialized collections or proxies. <literal>Hibernate.initialize(cat)</literal> will force the initialization of a proxy, <literal>cat</literal>, as long as its <literal>Session</literal> is still open. <literal>Hibernate.initialize( cat.getKittens() )</literal> has a similar effect for the collection of kittens.
fr_fr: Les méthodes statiques <literal>Hibernate.initialize()</literal> et <literal>Hibernate.isInitialized()</literal> fournissent à l'application un moyen de travailler avec des proxys ou des collections initialisés. <literal>Hibernate.initialize(cat)</literal> forcera l'initialisation d'un proxy de <literal>cat</literal>, si tant est que sa <literal>Session</literal> est ouverte. <literal>Hibernate.initialize( cat.getKittens() )</literal> a le même effet sur la collection kittens.
ja_jp: staticメソッドの <literal>Hibernate.initialize()</literal> や <literal>Hibernate.isInitialized()</literal> は遅延初期化のコレクションやプロキシを扱うときに便利な方法をアプリケーションに提供します。 <literal>Hibernate.initialize(cat)</literal> は、 <literal>Session</literal> がオープンしている限りは <literal>cat</literal> プロキシを強制的に初期化します。 <literal>Hibernate.initialize( cat.getKittens() )</literal> はkittensコレクションに対して同様の 効果があります。

source: Another option is to keep the <literal>Session</literal> open until all needed collections and proxies have been loaded. In some application architectures, particularly where the code that accesses data using Hibernate, and the code that uses it are in different application layers or different physical processes, it can be a problem to ensure that the <literal>Session</literal> is open when a collection is initialized. There are two basic ways to deal with this issue:
fr_fr: Une autre option est de conserver la <literal>Session</literal> ouverte jusqu'à ce que toutes les collections et tous les proxys aient été chargés. Dans certaines architectures applicatives, particulièrement celles ou le code d'accès aux données via hiberante et le code qui utilise ces données sont dans des couches applicatives différentes ou des processus physiques différents, il peut devenir problématique de garantir que la <literal>Session</literal> est ouverte lorsqu'une collection est initialisée. Il y a deux moyens de traiter ce problème :
ja_jp: 別の選択肢として、必要なすべてのコレクションやプロキシがロードされるまで <literal>Session</literal> をオープンにしておく方法があります。いくつかのアプリケーションの アーキテクチャでは、特にHibernateによるデータアクセスを行うコードと、それを使う コードが異なるアプリケーションのレイヤーや、物理的に異なるプロセッサのときには、 コレクションが初期化されるときに <literal>Session</literal> がオープンしていることを 保証する問題があります。この問題に対しては2つの基本的な方法があります。

source: In a web-based application, a servlet filter can be used to close the <literal>Session</literal> only at the very end of a user request, once the rendering of the view is complete (the <emphasis>Open Session in View</emphasis> pattern). Of course, this places heavy demands on the correctness of the exception handling of your application infrastructure. It is vitally important that the <literal>Session</literal> is closed and the transaction ended before returning to the user, even when an exception occurs during rendering of the view. See the Hibernate Wiki for examples of this "Open Session in View" pattern.
fr_fr: Dans une application web, un filtre de servlet peut être utilisé pour fermer la <literal>Session</literal> uniquement lorsque la requête a été entièrement traitée, lorsque le rendu de la vue est fini (il s'agit du pattern <emphasis>Open Session in View</emphasis>). Bien sûr, cela demande plus d'attention à la bonne gestion des exceptions de l'application. Il est d'une importance vitale que la <literal>Session</literal> soit fermée et la transaction terminée avant que l'on rende la main à l'utilisateur même si une exception survient durant le traitement de la vue. Voir le wiki Hibernate pour des exemples sur le pattern "Open Session in View".
ja_jp: Webベースのアプリケーションでは、 ビューのレンダリングが完了し、リクエストが終わる一番最後で <literal>Session</literal> をクローズするために、サーブレットフィルタを使うことができます（ <emphasis>Open Session in View</emphasis> パターンです）。もちろん、アプリケーション基盤の例外処理の正確性が非常に重要になります。 ビューのレンダリング中に例外が発生したときでさえ、ユーザに処理が戻る前に <literal>Session</literal> のクローズとトランザクションの終了を行う ことが不可欠になります。 HibernateのWikiに載っている"Open Session in View"パターンの例を参照してください。

source: In an application with a separate business tier, the business logic must "prepare" all collections that will be needed by the web tier before returning. This means that the business tier should load all the data and return all the data already initialized to the presentation/web tier that is required for a particular use case. Usually, the application calls <literal>Hibernate.initialize()</literal> for each collection that will be needed in the web tier (this call must occur before the session is closed) or retrieves the collection eagerly using a Hibernate query with a <literal>FETCH</literal> clause or a <literal>FetchMode.JOIN</literal> in <literal>Criteria</literal>. This is usually easier if you adopt the <emphasis>Command</emphasis> pattern instead of a <emphasis>Session Facade</emphasis>.
fr_fr: Dans une application avec une couche métier séparée, la couche contenant la logique métier doit "préparer" toutes les collections qui seront nécessaires à la couche web avant de retourner les données. Cela signifie que la couche métier doit charger toutes les données et retourner toutes les données déjà initialisées à la couche de présentation/web pour un cas d'utilisation donné. En général l'application appelle la méthode <literal>Hibernate.initialize()</literal> pour chaque collection nécessaire dans la couche web (cet appel doit être fait avant la fermeture de la session) ou bien récupère les collections de manière agressive à l'aide d'une requête HQL avec une clause <literal>FETCH</literal> ou à l'aide du mode <literal>FetchMode.JOIN</literal> pour une requête de type <literal>Criteria</literal>. Cela est en général plus facile si vous utilisez le pattern <emphasis>Command</emphasis> plutôt que <emphasis>Session Facade</emphasis>.
ja_jp: ビジネス層が分離しているアプリケーションでは、ビジネスロジックは Web層で必要になるすべてのコレクションを事前に"準備"する必要があります。 これは特定のユースケースで必要となるプレゼンテーション/Web層に対し、 ビジネス層がすべてのデータをロードし、すべてのデータを初期化して返すべきと いうことを意味しています。通常は、アプリケーションはWeb層で必要なコレクション それぞれに対して <literal>Hibernate.initialize()</literal> を呼び出すか （この呼び出しはセッションをクローズする前に行う必要があります）、 Hibernateクエリの <literal>FETCH</literal> 節や <literal>Criteria</literal> の <literal>FetchMode.JOIN</literal> を使ってコレクションを先に復元します。 普通は <emphasis>Session Facade</emphasis> パターンの代わりに <emphasis>Command</emphasis> パターンを採用するほうがより簡単です。

source: You may also attach a previously loaded object to a new <literal>Session</literal> with <literal>merge()</literal> or <literal>lock()</literal> before accessing uninitialized collections (or other proxies). No, Hibernate does not, and certainly <emphasis>should</emphasis> not do this automatically, since it would introduce ad hoc transaction semantics!
fr_fr: Vous pouvez également attacher à une <literal>Session</literal> un objet chargé au préalable à l'aide des méthodes <literal>merge()</literal> ou <literal>lock()</literal> avant d'accéder aux collections (ou aux proxys) non initialisés. Non, Hibernate ne fait pas, et ne doit pas faire, cela automatiquement car cela pourrait introduire une sémantique transactionnelle ad hoc.
ja_jp: 初期化されていないコレクション（もしくは他のプロキシ）にアクセスする前に、 <literal>merge()</literal> や <literal>lock()</literal> を使って新しい <literal>Session</literal> に以前にロードされたオブジェクトを追加することも出来ます。 アドホックなトランザクションのセマンティクスを導入したので、Hibernateは これを自動的に行わず、 <emphasis>行うべきでもありません</emphasis> ！

source: Sometimes you don't want to initialize a large collection, but still need some information about it (like its size) or a subset of the data.
fr_fr: Parfois, vous ne voulez pas initialiser une grande collection mais vous avez quand même besoin d'informations sur elle (comme sa taille) ou un sous ensemble de ses données
ja_jp: 大きなコレクションを初期化したくはないが、コレクションについてのなんらかの情報（サイズのような） やデータのサブセットを必要とすることがあります。

source: You can use a collection filter to get the size of a collection without initializing it:
fr_fr: Vous pouvez utiliser un filtre de collection pour récupérer sa taille sans l'initialiser :
ja_jp: コレクションフィルタを使うことで、初期化せずにコレクションのサイズを取得することが出来ます。

source: The <literal>createFilter()</literal> method is also used to efficiently retrieve subsets of a collection without needing to initialize the whole collection:
fr_fr: La méthode <literal>createFilter()</literal> est également utilisée pour récupérer de manière efficace des sous ensembles d'une collection sans avoir besoin de l'initialiser dans son ensemble.
ja_jp: <literal>createFilter()</literal> メソッドは、コレクション全体を初期化する必要なしに、コレクションの サブセットを復元するために効果的に使えます。

source: Using batch fetching
fr_fr: Utiliser le chargement par lot
ja_jp: バッチフェッチの使用

source: Hibernate can make efficient use of batch fetching, that is, Hibernate can load several uninitialized proxies if one proxy is accessed (or collections. Batch fetching is an optimization of the lazy select fetching strategy. There are two ways you can tune batch fetching: on the class and the collection level.
fr_fr: Pour améliorer les performances, Hibernate peut utiliser le chargement par lot ce qui veut dire qu'Hibernate peut charger plusieurs proxys (ou collections) non initialisés en une seule requête lorsque l'on accède à l'un de ces proxys. Le chargement par lot est une optimisation intimement liée à la stratégie de chargement tardif par select. Il y a deux moyens d'activer le chargement par lot : au niveau de la classe et au niveau de la collection.
ja_jp: Hibernateはバッチフェッチを効率的に使用できます。一つのプロキシ（もしくはコレクション）がアクセス されると、Hibernateはいくつかの初期化していないプロキシをロードすることができます。バッチフェッチは 遅延セレクトフェッチ戦略に対する最適化です。バッチフェッチの調整には２つの方法があります。 クラスレベルとコレクションレベルです。

source: Batch fetching for classes/entities is easier to understand. Imagine you have the following situation at runtime: You have 25 <literal>Cat</literal> instances loaded in a <literal>Session</literal>, each <literal>Cat</literal> has a reference to its <literal>owner</literal>, a <literal>Person</literal>. The <literal>Person</literal> class is mapped with a proxy, <literal>lazy="true"</literal>. If you now iterate through all cats and call <literal>getOwner()</literal> on each, Hibernate will by default execute 25 <literal>SELECT</literal> statements, to retrieve the proxied owners. You can tune this behavior by specifying a <literal>batch-size</literal> in the mapping of <literal>Person</literal>:
fr_fr: Le chargement par lot pour les classes/entités est plus simple à comprendre. Imaginez que vous ayez la situation suivante à l'exécution : vous avez 25 instances de <literal>Cat</literal> chargées dans une <literal>Session</literal>, chaque <literal>Cat</literal> a une référence à son <literal>owner</literal>, une <literal>Person</literal>. La classe <literal>Person</literal> est mappée avec un proxy, <literal>lazy="true"</literal>. Si vous itérez sur tous les cats et appelez <literal>getOwner()</literal> sur chacun d'eux, Hibernate exécutera par défaut 25 <literal>SELECT</literal>, pour charger les owners (initialiser le proxy). Vous pouvez paramétrer ce comportement en spécifiant une <literal>batch-size</literal> (taille du lot) dans le mapping de <literal>Person</literal> :
ja_jp: クラス、要素のバッチフェッチは理解が簡単です。実行時の次の場面を想像してください。 <literal>Session</literal> にロードされた25個の <literal>Cat</literal> インスタンスが存在し、 それぞれの <literal>Cat</literal> は <literal>owner</literal> である <literal>Person</literal> への関連を持ちます。 <literal>Person</literal> クラスは <literal>lazy="true"</literal> のプロキシでマッピングされています。 もし今すべてのCatに対して繰り返し <literal>getOwner()</literal> を呼び出すと、Hibernateは デフォルトでは25回の <literal>SELECT</literal> を実行し、ownerプロキシの復元をします。 この振る舞いを <literal>Person</literal> のマッピングの <literal>batch-size</literal> の指定で調整できます。

source: Hibernate will now execute only three queries, the pattern is 10, 10, 5.
fr_fr: Hibernate exécutera désormais trois requêtes, en chargeant respectivement 10, 10, et 5 entités.
ja_jp: Hibernateはクエリを３回だけを実行するようになります。パターンは10, 10, 5です。

source: You may also enable batch fetching of collections. For example, if each <literal>Person</literal> has a lazy collection of <literal>Cat</literal>s, and 10 persons are currently loaded in the <literal>Sesssion</literal>, iterating through all persons will generate 10 <literal>SELECT</literal>s, one for every call to <literal>getCats()</literal>. If you enable batch fetching for the <literal>cats</literal> collection in the mapping of <literal>Person</literal>, Hibernate can pre-fetch collections:
fr_fr: Vous pouvez aussi activer le chargement par lot pour les collections. Par exemple, si chaque <literal>Person</literal> a une collection chargée tardivement de <literal>Cat</literal>s, et que 10 personnes sont actuellement chargées dans la <literal>Session</literal>, itérer sur toutes les persons générera 10 <literal>SELECT</literal>s, un pour chaque appel de <literal>getCats()</literal>. Si vous activez le chargement par lot pour la collection <literal>cats</literal> dans le mapping de <literal>Person</literal>, Hibernate pourra précharger les collections :
ja_jp: コレクションのバッチフェッチも有効にすることが出来ます。例として、それぞれの <literal>Person</literal> が <literal>Cat</literal> の遅延コレクションを持っており、 10個のPersonが <literal>Sesssion</literal> にロードされたとすると、すべてのPersonに 対して繰り返し <literal>getCats()</literal> を呼び出すことで、計10回の <literal>SELECT</literal> が発生します。もし <literal>Person</literal> のマッピングで <literal>cats</literal> コレクションのバッチフェッチを有効にすれば、Hibernateはコレクションの事前フェッチが出来ます。

source: With a <literal>batch-size</literal> of 3, Hibernate will load 3, 3, 3, 1 collections in four <literal>SELECT</literal>s. Again, the value of the attribute depends on the expected number of uninitialized collections in a particular <literal>Session</literal>.
fr_fr: Avec une taille de lot (<literal>batch-size</literal>) de 3, Hibernate chargera respectivement 3, 3, 3, et 1 collections en quatre <literal>SELECT</literal>s. Encore une fois, la valeur de l'attribut dépend du nombre de collections non initialisées dans une <literal>Session</literal> particulière.
ja_jp: <literal>batch-size</literal> が3なので、Hibernateは4回の <literal>SELECT</literal> で3個、3個、3個、1個をロードします。繰り返すと、属性の値は特定の <literal>Session</literal> の中の初期化されていないコレクションの期待数に依存します。

source: Batch fetching of collections is particularly useful if you have a nested tree of items, ie. the typical bill-of-materials pattern. (Although a <emphasis>nested set</emphasis> or a <emphasis>materialized path</emphasis> might be a better option for read-mostly trees.)
fr_fr: Le chargement par lot de collections est particulièrement utile si vous avez des arborescenses récursives d'éléments (typiquement, le schéma facture de matériels). (Bien qu'un <emphasis>sous ensemble</emphasis> ou un <emphasis>chemin matérialisé</emphasis> est sans doute une meilleure option pour des arbres principalement en lecture.)
ja_jp: コレクションのバッチフェッチはアイテムのネストしたツリー、 すなわち、代表的な部品表のパターンが ある場合に特に有用です。（しかし、読み込みが多いツリーでは <emphasis>ネストしたset</emphasis> や <emphasis>具体化したパス</emphasis> がよりよい選択になります。）

source: Using subselect fetching
fr_fr: Utilisation du chargement par sous select
ja_jp: サブセレクトフェッチの使用
