Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/performance.po
Languages: fr_fr, ja_jp

source: The <literal>CacheMode</literal> controls how a particular session interacts with the second-level cache.
fr_fr: <![CDATA[sessionFactory.evict(Cat.class, catId); //evict a particular Cat sessionFactory.evict(Cat.class); //evict all Cats sessionFactory.evictCollection("Cat.kittens", catId); //evict a particular collection of kittens sessionFactory.evictCollection("Cat.kittens"); //evict all kitten collections]]>
ja_jp: <![CDATA[sessionFactory.evict(Cat.class, catId); //evict a particular Cat sessionFactory.evict(Cat.class); //evict all Cats sessionFactory.evictCollection("Cat.kittens", catId); //evict a particular collection of kittens sessionFactory.evictCollection("Cat.kittens"); //evict all kitten collections]]>

source: <literal>CacheMode.NORMAL</literal> - read items from and write items to the second-level cache
fr_fr: Le <literal>CacheMode</literal> contrôle comme une session particulière interragit avec le cache de second niveau
ja_jp: <literal>CacheMode</literal> は特定のセッションが二次キャッシュとどのように相互作用するかを 指定します。

source: <literal>CacheMode.GET</literal> - read items from the second-level cache, but don't write to the second-level cache except when updating data
fr_fr: <literal>CacheMode.NORMAL</literal> - lit et écrit les items dans le cache de second niveau
ja_jp: <literal>CacheMode.NORMAL</literal> - アイテムの読み込みと書き込みで二次キャッシュを使います

source: <literal>CacheMode.PUT</literal> - write items to the second-level cache, but don't read from the second-level cache
fr_fr: <literal>CacheMode.GET</literal> - lit les items dans le cache de second niveau mais ne les écrit pas sauf dans le cache d'une mise à jour d'une donnée
ja_jp: <literal>CacheMode.GET</literal> - 読み込みは二次キャッシュから行いますが、データを 更新した場合を除いて二次キャッシュに書き込みをしません。

source: <literal>CacheMode.REFRESH</literal> - write items to the second-level cache, but don't read from the second-level cache, bypass the effect of <literal>hibernate.cache.use_minimal_puts</literal>, forcing a refresh of the second-level cache for all items read from the database
fr_fr: <literal>CacheMode.PUT</literal> - écrit les items dans le cache de second niveau mais ne les lit pas dans le cache de second niveau
ja_jp: <literal>CacheMode.PUT</literal> - 二次キャッシュにアイテムを書き込みますが、読み込みには 二次キャッシュを使いません。

source: To browse the contents of a second-level or query cache region, use the <literal>Statistics</literal> API:
fr_fr: <literal>CacheMode.REFRESH</literal> - écrit les items dans le cache de second niveau mais ne les lit pas dans le cache de second niveau, outrepasse l'effet de<literal>hibernate.cache.use_minimal_puts</literal>, en forçant un rafraîchissement du cache de second niveau pour chaque item lu dans la base
ja_jp: <literal>CacheMode.REFRESH</literal> - 二次キャッシュにアイテムを書き込みますが、読み込みには 二次キャッシュを使わず、 <literal>hibernate.cache.use_minimal_puts</literal> の影響を受けずに、データベースから読み込むすべてのアイテムの二次キャッシュを強制的にリフレッシュします。

source: <![CDATA[Map cacheEntries = sessionFactory.getStatistics() .getSecondLevelCacheStatistics(regionName) .getEntries();]]>
fr_fr: Pour parcourir le contenu du cache de second niveau ou la région du cache dédiée au requêtes, vous pouvez utiliser l'API <literal>Statistics</literal> API:
ja_jp: 二次キャッシュの内容やクエリキャッシュ領域を見るために、 <literal>Statistics</literal> APIを 使ってください。

source: You'll need to enable statistics, and, optionally, force Hibernate to keep the cache entries in a more human-understandable format:
fr_fr: <![CDATA[Map cacheEntries = sessionFactory.getStatistics() .getSecondLevelCacheStatistics(regionName) .getEntries();]]>
ja_jp: <![CDATA[Map cacheEntries = sessionFactory.getStatistics() .getSecondLevelCacheStatistics(regionName) .getEntries();]]>

source: <![CDATA[hibernate.generate_statistics true hibernate.cache.use_structured_entries true]]>
fr_fr: Vous devez pour cela activer les statistiques et optionnellement forcer Hibernate à conserver les entrées dans le cache sous un format plus compréhensible pour l'utilisateur :
ja_jp: 統計情報を有効にして、さらにオプションとして、キャッシュエントリを 人がより理解可能な形式で保持することをHibernateに強制します。

source: The Query Cache
fr_fr: <![CDATA[hibernate.generate_statistics true hibernate.cache.use_structured_entries true]]>
ja_jp: <![CDATA[hibernate.generate_statistics true hibernate.cache.use_structured_entries true]]>

source: Query result sets may also be cached. This is only useful for queries that are run frequently with the same parameters. To use the query cache you must first enable it:
fr_fr: Le cache de requêtes
ja_jp: クエリキャッシュ

source: <![CDATA[hibernate.cache.use_query_cache true]]>
fr_fr: Les résultats d'une requête peuvent aussi être placés en cache. Ceci n'est utile que pour les requêtes qui sont exécutées avec les mêmes paramètres. Pour utiliser le cache de requêtes, vous devez d'abord l'activer :
ja_jp: クエリのリザルトセットもキャッシュ出来ます。これは同じパラメータで何度も実行される クエリに対してのみ有用です。クエリキャッシュを使うには、まず設定で有効にしなくてはなりません。

source: This setting causes the creation of two new cache regions - one holding cached query result sets (<literal>org.hibernate.cache.StandardQueryCache</literal>), the other holding timestamps of the most recent updates to queryable tables (<literal>org.hibernate.cache.UpdateTimestampsCache</literal>). Note that the query cache does not cache the state of the actual entities in the result set; it caches only identifier values and results of value type. So the query cache should always be used in conjunction with the second-level cache.
fr_fr: <![CDATA[hibernate.cache.use_query_cache true]]>
ja_jp: <![CDATA[hibernate.cache.use_query_cache true]]>

source: Most queries do not benefit from caching, so by default queries are not cached. To enable caching, call <literal>Query.setCacheable(true)</literal>. This call allows the query to look for existing cache results or add its results to the cache when it is executed.
fr_fr: Ce paramètre amène la création de deux nouvelles régions dans le cache, une qui va conserver le résultat des requêtes mises en cache (<literal>org.hibernate.cache.StandardQueryCache</literal>) et l'autre qui va conserver l'horodatage des mises à jour les plus récentes effectuées sur les tables requêtables (<literal>org.hibernate.cache.UpdateTimestampsCache</literal>). Il faut noter que le cache de requête ne conserve pas l'état des entités, il met en cache uniquement les valeurs de l'identifiant et les valeurs de types de base (?). Le cache de requête doit toujours être utilisé avec le cache de second niveau pour être efficace.
ja_jp: この設定は新たに二つのキャッシュ領域の作成を行います。一つはクエリのリザルトセットの キャッシュ（ <literal>org.hibernate.cache.StandardQueryCache</literal> ）を保持し、 もう1つはクエリ可能なテーブルへの最新の更新タイムスタンプ （ <literal>org.hibernate.cache.UpdateTimestampsCache</literal> ）を保持します。 クエリキャッシュはリザルトセットの実際の要素の状態はキャッシュしないことに 注意してください。キャッシュするのは識別子の値と、値型の結果のみです。 そのため、クエリキャッシュは常に二次キャッシュと一緒に使うべきです。

source: If you require fine-grained control over query cache expiration policies, you may specify a named cache region for a particular query by calling <literal>Query.setCacheRegion()</literal>.
fr_fr: La plupart des requêtes ne retirent pas de bénéfice pas du cache, donc par défaut les requêtes ne sont pas mises en cache. Pour activer le cache, appelez <literal>Query.setCacheable(true)</literal>. Cet appel permet de vérifier si les résultats sont en cache ou non, voire d'ajouter ces résultats si la requête est exécutée.
ja_jp: ほとんどのクエリはキャッシュの恩恵を受けないので、デフォルトではクエリはキャッシュされません。 キャッシュを有効にするには、 <literal>Query.setCacheable(true)</literal> を呼び出してください。 そうすればクエリが既存のキャッシュ結果を探し、クエリ実行時にその結果をキャッシュに追加する ようになります。

source: <![CDATA[List blogs = sess.createQuery("from Blog blog where blog.blogger = :blogger") .setEntity("blogger", blogger) .setMaxResults(15) .setCacheable(true) .setCacheRegion("frontpages") .list();]]>
fr_fr: Si vous avez besoin de contrôler finement les délais d'expiration du cache, vous pouvez spécifier une région de cache nommée pour une requête particulière en appelant <literal>Query.setCacheRegion()</literal>.
ja_jp: クエリキャッシュの破棄ポリシーを細かく制御したいときは、 <literal>Query.setCacheRegion()</literal> を呼び出して特定のクエリに対するキャッシュ領域を指定することが出来ます。

source: If the query should force a refresh of its query cache region, you should call <literal>Query.setCacheMode(CacheMode.REFRESH)</literal>. This is particularly useful in cases where underlying data may have been updated via a separate process (i.e., not modified through Hibernate) and allows the application to selectively refresh particular query result sets. This is a more efficient alternative to eviction of a query cache region via <literal>SessionFactory.evictQueries()</literal>.
fr_fr: <![CDATA[List blogs = sess.createQuery("from Blog blog where blog.blogger = :blogger") .setEntity("blogger", blogger) .setMaxResults(15) .setCacheable(true) .setCacheRegion("frontpages") .list();]]>
ja_jp: <![CDATA[List blogs = sess.createQuery("from Blog blog where blog.blogger = :blogger") .setEntity("blogger", blogger) .setMaxResults(15) .setCacheable(true) .setCacheRegion("frontpages") .list();]]>

source: Understanding Collection performance
fr_fr: Si une requête doit forcer le rafraîchissement de sa région de cache, vous devez appeler <literal>Query.setCacheMode(CacheMode.REFRESH)</literal>. C'est particulièrement utile lorsque les données peuvent avoir été mises à jour par un processus séparé (e.g. elles n'ont pas été modifiées par Hibernate). Cela permet à l'application de rafraîchir de manière sélective les résultats d'une requête particulière. Il s'agit d'une alternative plus efficace à l'éviction d'une région du cache à l'aide de la méthode <literal>SessionFactory.evictQueries()</literal>.
ja_jp: クエリが自身のクエリキャッシュ領域のリフレッシュを強制しなければならないなら、 <literal>Query.setCacheMode(CacheMode.REFRESH)</literal> を呼び出すべきです。これは 元となるデータが別のプロセスによって更新されたり（すなわちHibernateを通じて更新されない）、 アプリケーションに特定のクエリリザルトセットを選択してリフレッシュさせる場合に特に有用です。 さらに有用なもう一つの方法は、 <literal>SessionFactory.evictQueries()</literal> によってクエリキャッシュ領域を消去することです。

source: We've already spent quite some time talking about collections. In this section we will highlight a couple more issues about how collections behave at runtime.
fr_fr: Comprendre les performances des Collections

source: Taxonomy
fr_fr: Nous avons déjà passé du temps à discuter des collections. Dans cette section, nous allons traiter du comportement des collections à l'exécution.
ja_jp: コレクションのパフォーマンスの理解

source: Hibernate defines three basic kinds of collections:
fr_fr: Classification
ja_jp: コレクションの話題にはすでに多くの時間を使いました。この節では コレクションが実行時にどのように振舞うかについての話題を2、3取り上げます。

source: collections of values
fr_fr: Hibernate définit trois types de collections :
ja_jp: <title>分類</title>

source: one to many associations
fr_fr: les collections de valeurs
ja_jp: Hibernateは3つの基本的なコレクションの種類を定義しています。

source: many to many associations
fr_fr: les associations un-vers-plusieurs
ja_jp: 値のコレクション

source: This classification distinguishes the various table and foreign key relationships but does not tell us quite everything we need to know about the relational model. To fully understand the relational structure and performance characteristics, we must also consider the structure of the primary key that is used by Hibernate to update or delete collection rows. This suggests the following classification:
fr_fr: les associations plusieurs-vers-plusieurs
ja_jp: 一対多関連

source: indexed collections
fr_fr: Cette classification distingue les différentes relations entre les tables et les clés étrangères mais ne nous apprend rien de ce que nous devons savoir sur le modèle relationnel. Pour comprendre parfaitement la structure relationnelle et les caractéristiques des performances, nous devons considérer la structure de la clé primaire qui est utilisée par Hibernate pour mettre à jour ou supprimer les éléments des collections. Celà nous amène aux classifications suivantes :
ja_jp: 多対多関連

source: sets
fr_fr: collections indexées
ja_jp: この分類はさまざまなテーブルや外部キー関連を区別しますが、私たちが知る必要のある 関連モデルについてほとんどなにも教えてくれません。関連構造やパフォーマンスの特徴を 完全に理解するには、Hibernateがコレクションの行を更新、削除するために使う主キーの 構造もまた考えなければなりません。これは以下の分類を提示します。

source: bags
fr_fr: sets
ja_jp: インデックス付きコレクション

source: All indexed collections (maps, lists, arrays) have a primary key consisting of the <literal>&lt;key&gt;</literal> and <literal>&lt;index&gt;</literal> columns. In this case collection updates are usually extremely efficient - the primary key may be efficiently indexed and a particular row may be efficiently located when Hibernate tries to update or delete it.
fr_fr: bags
ja_jp: <para>set</para>

source: Sets have a primary key consisting of <literal>&lt;key&gt;</literal> and element columns. This may be less efficient for some types of collection element, particularly composite elements or large text or binary fields; the database may not be able to index a complex primary key as efficently. On the other hand, for one to many or many to many associations, particularly in the case of synthetic identifiers, it is likely to be just as efficient. (Side-note: if you want <literal>SchemaExport</literal> to actually create the primary key of a <literal>&lt;set&gt;</literal> for you, you must declare all columns as <literal>not-null="true"</literal>.)
fr_fr: Toutes les collections indexées (maps, lists, arrays) ont une clé primaire constituée des colonnes clé (<literal>&lt;key&gt;</literal>) et <literal>&lt;index&gt;</literal>. Avec ce type de clé primaire, la mise à jour de collection est en général très performante - la clé primaire peut être indexées efficacement et un élément particulier peut être localisé efficacement lorsqu'Hibernate essaie de le mettre à jour ou de le supprimer.
ja_jp: <para>bag</para>

source: <literal>&lt;idbag&gt;</literal> mappings define a surrogate key, so they are always very efficient to update. In fact, they are the best case.
fr_fr: Les Sets ont une clé primaire composée de <literal>&lt;key&gt;</literal> et des colonnes représentant l'élément. Elle est donc moins efficace pour certains types de collections d'éléments, en particulier les éléments composites, les textes volumineux ou les champs binaires ; la base de données peut ne pas être capable d'indexer aussi efficacement une clé primaire aussi complexe. Cependant, pour les associations un-vers-plusieurs ou plusieurs-vers-plusieurs, spécialement lorsque l'on utilise des entités ayant des identifiants techniques, il est probable que cela soit aussi efficace (note : si vous voulez que <literal>SchemaExport</literal> créé effectivement la clé primaire d'un <literal>&lt;set&gt;</literal> pour vous, vous devez déclarer toutes les colonnes avec <literal>not-null="true"</literal>).
ja_jp: すべてのインデックス付きコレクション（map、list、配列）は <literal>&lt;key&gt;</literal> と <literal>&lt;index&gt;</literal> カラムからなる主キーを持っています。この場合は コレクションの更新は非常に効率的です。主キーは有用なインデックスになり、Hibernateが 特定の行を更新または削除するときに、その行を効率的に見つけることができます。

source: Bags are the worst case. Since a bag permits duplicate element values and has no index column, no primary key may be defined. Hibernate has no way of distinguishing between duplicate rows. Hibernate resolves this problem by completely removing (in a single <literal>DELETE</literal>) and recreating the collection whenever it changes. This might be very inefficient.
fr_fr: Le mapping à l'aide d'<literal>&lt;idbag&gt;</literal> définit une clé de substitution ce qui leur permet d'être très efficaces lors de la mise à jour. En fait il s'agit du meilleur cas de mise à jour d'une collection
ja_jp: setは <literal>&lt;key&gt;</literal> からなる主キーと要素のカラムを持っています。 これはコレクション要素のいくつかの型については効率的ではないかもしれません。 特に複合要素、大きなテキスト、バイナリフィールドでは非効率です。データベースは 複合主キーに効率的にインデックスを付けることができないからです。一方、1対多や多対多関連において、 特に人工識別子の場合は同じぐらい効率的です。（余談： <literal>SchemaExport</literal> で実際に <literal>&lt;set&gt;</literal> の主キーを作りたいなら、すべてのカラムで <literal>not-null="true"</literal> を宣言しなければなりません。）

source: Note that for a one-to-many association, the "primary key" may not be the physical primary key of the database table - but even in this case, the above classification is still useful. (It still reflects how Hibernate "locates" individual rows of the collection.)
fr_fr: Le pire cas intervient pour les Bags. Dans la mesure où un bag permet la duplications des éléments et n'a pas de colonne d'index, aucune clé primaire ne peut être définie. Hibernate n'a aucun moyen de distinguer des enregistrements dupliqués. Hibernate résout ce problème en supprimant complètement les enregistrements (via un simple <literal>DELETE</literal>), puis en recréant la collection chaque fois qu'elle change. Ce qui peut être très inefficace.
ja_jp: <literal>&lt;idbag&gt;</literal> マッピングは代理キーを定義します。そのため 更新は常に非常に効率的です。事実上、これは最善のケースです。

source: Lists, maps, idbags and sets are the most efficient collections to update
fr_fr: Notez que pour une relation un-vers-plusieurs, la "clé primaire" peut ne pas être la clé primaire de la table en base de données - mais même dans ce cas, la classification ci-dessus reste utile (Elle explique comment Hibernate "localise" chaque enregistrement de la collection).
ja_jp: bagは最悪のケースです。bagは要素の値の重複が可能で、インデックスカラムを持たないため、 主キーは定義されないかもしれません。Hibernateには重複した行を区別する方法がありません。 Hibernateはこの問題の解決のために、変更があったときには常に完全な削除 （一つの <literal>DELETE</literal> による）を行い、コレクションの再作成を行います。 これは非常に非効率的かもしれません。

source: From the discussion above, it should be clear that indexed collections and (usually) sets allow the most efficient operation in terms of adding, removing and updating elements.
fr_fr: Les lists, les maps, les idbags et les sets sont les collections les plus efficaces pour la mise à jour
ja_jp: 1対多関連では、「主キー」はデータベースのテーブルの物理的な 主キーではないかもしれないことに注意してください。しかしこの場合でさえ、上記の分類はまだ有用です。 （Hibernateがコレクションの個々の行をどうやって「見つけるか」を表しています。）

source: There is, arguably, one more advantage that indexed collections have over sets for many to many associations or collections of values. Because of the structure of a <literal>Set</literal>, Hibernate doesn't ever <literal>UPDATE</literal> a row when an element is "changed". Changes to a <literal>Set</literal> always work via <literal>INSERT</literal> and <literal>DELETE</literal> (of individual rows). Once again, this consideration does not apply to one to many associations.
fr_fr: La discussion précédente montre clairement que les collections indexées et (la plupart du temps) les sets, permettent de réaliser le plus efficacement les opérations d'ajout, de suppression ou de modification d'éléments.
ja_jp: 更新にもっとも効率的なコレクション list、map、idbag、set

source: After observing that arrays cannot be lazy, we would conclude that lists, maps and idbags are the most performant (non-inverse) collection types, with sets not far behind. Sets are expected to be the most common kind of collection in Hibernate applications. This is because the "set" semantics are most natural in the relational model.
fr_fr: Il existe un autre avantage qu'ont les collections indexées sur les Sets dans le cadre d'une association plusieurs vers plusieurs ou d'une collection de valeurs. A cause de la structure inhérente d'un <literal>Set</literal>, Hibernate n'effectue jamais d'<literal>UPDATE</literal> quand un enregistrement est modifié. Les modifications apportées à un <literal>Set</literal> se font via un <literal>INSERT</literal> et <literal>DELETE</literal> (de chaque enregistrement). Une fois de plus, ce cas ne s'applique pas aux associations un vers plusieurs.
ja_jp: 上での議論から、インデックス付きコレクションと（普通の）setは要素の追加、削除、 更新でもっとも効率的な操作が出来ることは明らかです。

source: However, in well-designed Hibernate domain models, we usually see that most collections are in fact one-to-many associations with <literal>inverse="true"</literal>. For these associations, the update is handled by the many-to-one end of the association, and so considerations of collection update performance simply do not apply.
fr_fr: Après s'être rappelé que les tableaux ne peuvent pas être chargés tardivement, nous pouvons conclure que les lists, les maps et les idbags sont les types de collections (non inversées) les plus performants, avec les sets pas loin derrières. Les sets son le type de collection le plus courant dans les applications Hibernate. Cela est du au fait que la sémantique des "set" est la plus naturelle dans le modèle relationnel.
ja_jp: ほぼ間違いなく、多対多関連や値のコレクションにおいて、インデックス付きコレクションが setよりも優れている点が一つ以上あります。 <literal>Set</literal> はその 構造のために、Hibernateは要素が「変更」されたときに行を決して <literal>UPDATE</literal> しません。 <literal>Set</literal> への変更は常に（個々の行の）<literal>INSERT</literal> と <literal>DELETE</literal> によって行います。繰り返しますが、これは一対多関連には 当てはまりません。

source: Bags and lists are the most efficient inverse collections
fr_fr: Cependant, dans des modèles objet bien conçus avec Hibernate, on voit souvent que la plupart des collections sont en fait des associations "un-vers-plusieurs" avec <literal>inverse="true"</literal>. Pour ces associations, les mises à jour sont gérées au niveau de l'association "plusieurs-vers-un" et les considérations de performance de mise à jour des collections ne s'appliquent tout simplement pas dans ces cas là.
ja_jp: 配列は遅延処理ができないという決まりなので、結論として、list、map、idbagがもっとも パフォーマンスの良い（inverseではない）コレクションタイプとなります。setも それほど違いはありません。Hibernateのアプリケーションでは、setはコレクションのもっとも 共通の種類として期待されます。setの表現は関連モデルではもっとも自然だからです。

source: Just before you ditch bags forever, there is a particular case in which bags (and also lists) are much more performant than sets. For a collection with <literal>inverse="true"</literal> (the standard bidirectional one-to-many relationship idiom, for example) we can add elements to a bag or list without needing to initialize (fetch) the bag elements! This is because <literal>Collection.add()</literal> or <literal>Collection.addAll()</literal> must always return true for a bag or <literal>List</literal> (unlike a <literal>Set</literal>). This can make the following common code much faster.
fr_fr: Les Bags et les lists sont les plus efficaces pour les collections inverse
ja_jp: しかし、よくデザインされたHibernateのドメインモデルでは、通常もっとも多いコレクションは 事実上 <literal>inverse="true"</literal> を指定した1対多関連です。これらの関連では、 更新は多対一の関連端で扱われ、コレクションの更新パフォーマンスの問題は当てはまりません。

source: <![CDATA[Parent p = (Parent) sess.load(Parent.class, id); Child c = new Child(); c.setParent(p); p.getChildren().add(c); //no need to fetch the collection! sess.flush();]]>
fr_fr: Avant que vous n'oubliez les bags pour toujours, il y a un cas précis où les bags (et les lists) sont bien plus performants que les sets. Pour une collection marquée comme <literal>inverse="true"</literal> (le choix le plus courant pour un relation un vers plusieurs bidirectionnelle), nous pouvons ajouter des éléments à un bag ou une list sans avoir besoin de l'initialiser (fetch) les éléments du sac! Ceci parce que <literal>Collection.add()</literal> ou <literal>Collection.addAll()</literal> doit toujours retourner vrai pour un bag ou une <literal>List</literal> (contrairement au <literal>Set</literal>). Cela peut rendre le code suivant beaucoup plus rapide.
ja_jp: inverseコレクションにもっとも最適なbagとlist

source: One shot delete
fr_fr: <![CDATA[Parent p = (Parent) sess.load(Parent.class, id); Child c = new Child(); c.setParent(p); p.getChildren().add(c); //pas besoin de charger la collection ! sess.flush();]]>
ja_jp: bagを見放してしまう前に、bag（そしてlistも）がsetよりもずっとパフォーマンスが良い特別なケースを 紹介します。 <literal>inverse="true"</literal> のコレクション（一般的な1対多関連の使い方など）で、 bagの要素を初期化（フェッチ）する必要なくbagやlistに要素を追加できます！ これは <literal>Collection.add()</literal> や <literal>Collection.addAll()</literal> はbagや <literal>List</literal> では常にtrueを返さなければならないからです （ <literal>Set</literal> とは異なります）。 これは以下の共通処理をより速くすることができます。

source: Occasionally, deleting collection elements one by one can be extremely inefficient. Hibernate isn't completely stupid, so it knows not to do that in the case of an newly-empty collection (if you called <literal>list.clear()</literal>, for example). In this case, Hibernate will issue a single <literal>DELETE</literal> and we are done!
fr_fr: Suppression en un coup
ja_jp: <![CDATA[Parent p = (Parent) sess.load(Parent.class, id); Child c = new Child(); c.setParent(p); p.getChildren().add(c); //no need to fetch the collection! sess.flush();]]>
