Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/performance.po
Languages: fr_fr, ja_jp

source: If one lazy collection or single-valued proxy has to be fetched, Hibernate loads all of them, re-running the original query in a subselect. This works in the same way as batch-fetching, without the piecemeal loading.
fr_fr: Si une collection ou un proxy vers un objet doit être chargé, Hibernate va tous les charger en ré-exécutant la requête orignial dans un sous select. Cela fonctionne de la même manière que le chargement par lot sans la possibilité de fragmenter le chargement.
ja_jp: 一つの遅延コレクションや単一値プロキシがフェッチされなければいけないとき、Hibernateは それらすべてをロードし、サブセレクトのオリジナルクエリが再度実行されます。これは バッチフェッチと同じ方法で動き、少しずつのロードは行いません。

source: Using lazy property fetching
fr_fr: Utiliser le chargement tardif des propriétés
ja_jp: 遅延プロパティフェッチの使用

source: Hibernate3 supports the lazy fetching of individual properties. This optimization technique is also known as <emphasis>fetch groups</emphasis>. Please note that this is mostly a marketing feature, as in practice, optimizing row reads is much more important than optimization of column reads. However, only loading some properties of a class might be useful in extreme cases, when legacy tables have hundreds of columns and the data model can not be improved.
fr_fr: Hibernate3 supporte le chargement tardif de propriétés individuelles. La technique d'optimisation est également connue sous le nom de <emphasis>fetch groups</emphasis> (groupes de chargement). Il faut noter qu'il s'agit principalement d'une fonctionnalité marketing car en pratique l'optimisation de la lecture d'un enregistrement est beaucoup plus importante que l'optimisation de la lecture d'une colonne. Cependant, la restriction du chargement à certaines colonnes peut être pratique dans des cas extrèmes, lorsque des tables "legacy" possèdent des centaines de colonnes et que le modèle de données ne peut pas être amélioré.
ja_jp: Hibernate3はプロパティごとの遅延フェッチをサポートしています。この最適化手法は <emphasis>グループのフェッチ</emphasis> としても知られています。これはほとんど 要望から出た機能であることに注意してください。実際には列読み込みの最適化よりも、 行読み込みの最適化が非常に重要です。 しかし、クラスのいくつかのプロパティだけを読み込むことは、既存のテーブルが何百もの列を持ち、 データモデルを改善できないなどの極端な場合には有用です。

source: To enable lazy property loading, set the <literal>lazy</literal> attribute on your particular property mappings:
fr_fr: Pour activer le chargement tardif d'une propriété, il faut mettre l'attribut <literal>lazy</literal> sur une propriété particulière du mapping :
ja_jp: 遅延プロパティ読み込みを有効にするには、対象のプロパティのマッピングで <literal>lazy</literal> 属性をセットしてください。

source: Lazy property loading requires buildtime bytecode instrumentation! If your persistent classes are not enhanced, Hibernate will silently ignore lazy property settings and fall back to immediate fetching.
fr_fr: Le chargement tardif des propriétés requiert une instrumentation du bytecode lors de la compilation ! Si les classes persistantes ne sont pas instrumentées, Hibernate ignorera de manière silencieuse le mode tardif et retombera dans le mode de chargement immédiat.
ja_jp: 遅延プロパティ読み込みはビルド時のバイトコード組み込みを必要とします！もし 永続クラスに組み込みがされていないなら、Hibernateは黙って遅延プロパティの設定を無視して、 即時フェッチに戻します。

source: For bytecode instrumentation, use the following Ant task:
fr_fr: Pour l'instrumentation du bytecode vous pouvez utiliser la tâche Ant suivante :
ja_jp: バイトコード組み込みは以下のAntタスクを使ってください。

source: A different (better?) way to avoid unnecessary column reads, at least for read-only transactions is to use the projection features of HQL or Criteria queries. This avoids the need for buildtime bytecode processing and is certainly a prefered solution.
fr_fr: Une autre façon (meilleure ?) pour éviter de lire plus de colonnes que nécessaire au moins pour des transactions en lecture seule est d'utiliser les fonctionnalités de projection des requêtes HQL ou Criteria. Cela évite de devoir instrumenter le bytecode à la compilation et est certainement une solution préférable.
ja_jp: 不要な列を読み込まないための、別の（よりよい？）方法は、少なくとも 読み込みのみのトランザクションにおいては、HQLやCriteriaクエリの射影 機能を使うことです。この方法はビルド時のバイトコード組み込みが不要になり、 より良い解決方法です。

source: You may force the usual eager fetching of properties using <literal>fetch all properties</literal> in HQL.
fr_fr: Vous pouvez forcer le mode de chargement agressif des propriétés en utilisant <literal>fetch all properties</literal> dans les requêts HQL.
ja_jp: HQLで <literal>fetch all properties</literal> を使うことで、普通どおりの プロパティの即時フェッチングを強制することが出来ます。

source: The Second Level Cache
fr_fr: Le cache de second niveau
ja_jp: 第2レベルキャッシュ

source: A Hibernate <literal>Session</literal> is a transaction-level cache of persistent data. It is possible to configure a cluster or JVM-level (<literal>SessionFactory</literal>-level) cache on a class-by-class and collection-by-collection basis. You may even plug in a clustered cache. Be careful. Caches are never aware of changes made to the persistent store by another application (though they may be configured to regularly expire cached data).
fr_fr: Une <literal>Session</literal> Hibernate est un cache de niveau transactionnel des données persistantes. Il est possible de configurer un cache de cluster ou de JVM (de niveau <literal>SessionFactory</literal> pour être exact) défini classe par classe et collection par collection. Vous pouvez même utiliser votr choix de cache en implémentant le pourvoyeur (provider) associé. Faites attention, les caches ne sont jamais avertis des modifications faites dans la base de données par d'autres applications (ils peuvent cependant être configurés pour régulièrement expirer les données en cache).
ja_jp: Hibernateの <literal>Session</literal> は永続データのトランザクションレベルのキャッシュです。 class-by-classとcollection-by-collectionごとの、クラスタレベルやJVMレベル （ <literal>SessionFactory</literal> レベル）のキャッシュを設定することが出来ます。 クラスタ化されたキャッシュにつなぐことさえ出来ます。しかし注意してください。 キャッシュは他のアプリケーションによる永続層の変更を 考慮しません（キャッシュデータを定期的に期限切れにする設定は出来ます）。

source: You have the option to tell Hibernate which caching implementation to use by specifying the name of a class that implements <literal>org.hibernate.cache.CacheProvider</literal> using the property <literal>hibernate.cache.provider_class</literal>. Hibernate comes bundled with a number of built-in integrations with open-source cache providers (listed below); additionally, you could implement your own and plug it in as outlined above. Note that versions prior to 3.2 defaulted to use EhCache as the default cache provider; that is no longer the case as of 3.2.
fr_fr: Par défaut, Hibernate utilise EHCache comme cache de niveau JVM (le support de JCS est désormais déprécié et sera enlevé des futures versions d'Hibernate). Vous pouvez choisir une autre implémentation en spécifiant le nom de la classe qui implémente <literal>org.hibernate.cache.CacheProvider</literal> en utilisant la propriété <literal>hibernate.cache.provider_class</literal>.
ja_jp: Hibernateが使用するキャッシュ実装は、<literal>hibernate.cache.provider_class</literal> プロパティに <literal>org.hibernate.cache.CacheProvider</literal> を実装したクラス名を指定することで変更できます。 Hibernateは多くのオープンソースのキャッシュプロバイダをビルトイン実装で持っています（後にリストがあります）。 加えて、前に説明したように、あなた自身が独自の実装をして、それを組み込むことも出来ます。 バージョン3.2より前ではEhCacheがデフォルトのキャッシュプロバイダであることに注意してください。 バージョン3.2ではこれは当てはまりません。

source: Cache Providers
fr_fr: Fournisseur de cache
ja_jp: キャッシュプロバイダ

source: Provider class
fr_fr: Classe pourvoyeuse
ja_jp: プロバイダクラス

source: Cluster Safe
fr_fr: Support en Cluster
ja_jp: クラスタセーフ

source: Query Cache Supported
fr_fr: Cache de requêtes supporté
ja_jp: クエリキャッシュのサポート

source: Hashtable (not intended for production use)
fr_fr: Hashtable (ne pas utiliser en production)
ja_jp: Hashtable（製品用として意図していません）

source: memory
fr_fr: mémoire
ja_jp: <entry>メモリ</entry>

source: <entry>yes</entry>
fr_fr: <entry>oui</entry>

source: memory, disk
fr_fr: mémoire, disque
ja_jp: メモリ、ディスク

source: SwarmCache
fr_fr: <entry>oui</entry>
ja_jp: <entry>yes</entry>

source: org.hibernate.cache.SwarmCacheProvider
fr_fr: SwarmCache
ja_jp: SwarmCache

source: clustered (ip multicast)
fr_fr: org.hibernate.cache.SwarmCacheProvider
ja_jp: org.hibernate.cache.SwarmCacheProvider

source: yes (clustered invalidation)
fr_fr: en cluster (multicast ip)
ja_jp: クラスタ（ipマルチキャスト）

source: JBoss TreeCache
fr_fr: oui (invalidation de cluster)
ja_jp: yes（クラスタ無効化）

source: org.hibernate.cache.TreeCacheProvider
fr_fr: JBoss TreeCache
ja_jp: JBoss TreeCache

source: clustered (ip multicast), transactional
fr_fr: org.hibernate.cache.TreeCacheProvider
ja_jp: org.hibernate.cache.TreeCacheProvider

source: yes (replication)
fr_fr: en cluster (multicast ip), transactionnel
ja_jp: クラスタ（ipマルチキャスト）、トランザクショナル

source: yes (clock sync req.)
fr_fr: oui (replication)
ja_jp: yes（複製）

source: Cache mappings
fr_fr: oui (horloge sync. nécessaire)
ja_jp: yes（時刻同期が必要）

source: The <literal>&lt;cache&gt;</literal> element of a class or collection mapping has the following form:
fr_fr: Mapping de Cache
ja_jp: キャッシュのマッピング

source: <![CDATA[<cache usage="transactional|read-write|nonstrict-read-write|read-only" region="RegionName" include="all|non-lazy" />]]>
fr_fr: L'élément <literal>&lt;cache&gt;</literal> d'une classe ou d'une collection à la forme suivante :
ja_jp: クラスやコレクションのマッピングの <literal>&lt;cache&gt;</literal> 要素は以下の形式です。

source: <literal>usage</literal> (required) specifies the caching strategy: <literal>transactional</literal>, <literal>read-write</literal>, <literal>nonstrict-read-write</literal> or <literal>read-only</literal>
fr_fr: <![CDATA[<cache usage="transactional|read-write|nonstrict-read-write|read-only" region="RegionName" include="all|non-lazy" />]]>
ja_jp: <![CDATA[<cache usage="transactional|read-write|nonstrict-read-write|read-only" region="RegionName" include="all|non-lazy" />]]>

source: <literal>region</literal> (optional, defaults to the class or collection role name) specifies the name of the second level cache region
fr_fr: <literal>usage</literal> (requis) spécifie la stratégie de cache : <literal>transactionel</literal>, <literal>lecture-écriture</literal>, <literal>lecture-écriture non stricte</literal> ou <literal>lecture seule</literal>
ja_jp: <literal>usage</literal> (required) specifies the caching strategy: <literal>transactional</literal>, <literal>read-write</literal>, <literal>nonstrict-read-write</literal> or <literal>read-only</literal>

source: <literal>include</literal> (optional, defaults to <literal>all</literal>) <literal>non-lazy</literal> specifies that properties of the entity mapped with <literal>lazy="true"</literal> may not be cached when attribute-level lazy fetching is enabled
fr_fr: <literal>region</literal> (optionnel, par défaut il s'agit du nom de la classe ou du nom de role de la collection) spécifie le nom de la région du cache de second niveau
ja_jp: <literal>region</literal> (optional, defaults to the class or collection role name) specifies the name of the second level cache region

source: Alternatively (preferrably?), you may specify <literal>&lt;class-cache&gt;</literal> and <literal>&lt;collection-cache&gt;</literal> elements in <literal>hibernate.cfg.xml</literal>.
fr_fr: <literal>include</literal> (optionnel, par défaut <literal>all</literal>) <literal>non-lazy</literal> spécifie que les propriétés des entités mappées avec <literal>lazy="true"</literal> ne doivent pas être mises en cache lorsque le chargement tardif des attributs est activé.
ja_jp: <literal>include</literal> (optional, defaults to <literal>all</literal>) <literal>non-lazy</literal> specifies that properties of the entity mapped with <literal>lazy="true"</literal> may not be cached when attribute-level lazy fetching is enabled

source: The <literal>usage</literal> attribute specifies a <emphasis>cache concurrency strategy</emphasis>.
fr_fr: Alternativement (voir préférentiellement), vous pouvez spécifier les éléments <literal>&lt;class-cache&gt;</literal> et <literal>&lt;collection-cache&gt;</literal> dans <literal>hibernate.cfg.xml</literal>.
ja_jp: または（よりよい方法として？）、 <literal>hibernate.cfg.xml</literal> に <literal>&lt;class-cache&gt;</literal> と <literal>&lt;collection-cache&gt;</literal> 要素を指定することも出来ます。

source: Strategy: read only
fr_fr: L'attribut <literal>usage</literal> spécifie une <emphasis>stratégie de concurrence d'accès au cache</emphasis>.
ja_jp: <literal>usage</literal> 属性は <emphasis>キャッシュの並列性戦略</emphasis> を指定します。

source: If your application needs to read but never modify instances of a persistent class, a <literal>read-only</literal> cache may be used. This is the simplest and best performing strategy. It's even perfectly safe for use in a cluster.
fr_fr: Strategie : lecture seule
ja_jp: read only戦略

source: <![CDATA[<class name="eg.Immutable" mutable="false"> <cache usage="read-only"/> .... </class>]]>
fr_fr: Si votre application a besoin de lire mais ne modifie jamais les instances d'une classe, un cache <literal>read-only</literal> peut être utilisé. C'est la stratégie la plus simple et la plus performante. Elle est même parfaitement sûre dans un cluster.
ja_jp: もしアプリケーションが読み込みのみ必要で、永続クラスのインスタンスを変更しないなら、 <literal>read-only</literal> キャッシュを使うことが出来ます。これはもっとも単純で もっともパフォーマンスの良い戦略です。クラスタでの使用も完全に安全です。

source: Strategy: read/write
fr_fr: <![CDATA[<class name="eg.Immutable" mutable="false"> <cache usage="read-only"/> .... </class>]]>
ja_jp: <![CDATA[<class name="eg.Immutable" mutable="false"> <cache usage="read-only"/> .... </class>]]>

source: If the application needs to update data, a <literal>read-write</literal> cache might be appropriate. This cache strategy should never be used if serializable transaction isolation level is required. If the cache is used in a JTA environment, you must specify the property <literal>hibernate.transaction.manager_lookup_class</literal>, naming a strategy for obtaining the JTA <literal>TransactionManager</literal>. In other environments, you should ensure that the transaction is completed when <literal>Session.close()</literal> or <literal>Session.disconnect()</literal> is called. If you wish to use this strategy in a cluster, you should ensure that the underlying cache implementation supports locking. The built-in cache providers do <emphasis>not</emphasis>.
fr_fr: Stratégie : lecture/écriture
ja_jp: read/write戦略

source: <![CDATA[<class name="eg.Cat" .... > <cache usage="read-write"/> .... <set name="kittens" ... > <cache usage="read-write"/> .... </set> </class>]]>
fr_fr: Si l'application a besoin de mettre à jour des données, un cache <literal>read-write</literal> peut être approprié. Cette stratégie ne devrait jamais être utilisée si votre application nécessite un niveau d'isolation transactionnelle sérialisable. Si le cache est utilisé dans un environnement JTA, vous devez spécifier <literal>hibernate.transaction.manager_lookup_class</literal>, fournissant une stratégie pour obtenir le <literal>TransactionManager</literal> JTA. Dans d'autres environnements, vous devriez vous assurer que la transation est terminée à l'appel de <literal>Session.close()</literal> ou <literal>Session.disconnect()</literal>. Si vous souhaitez utiliser cette stratégie dans un cluster, vous devriez vous assurer que l'implémentation de cache utilisée supporte le vérrouillage. Ce que ne font <emphasis>pas</emphasis> les pourvoyeurs caches fournis.
ja_jp: アプリケーションがデータを更新する必要があるなら、 <literal>read-write</literal> キャッシュが適当かも しれません。このキャッシュ戦略は、シリアライザブルなトランザクション分離レベルが要求されるなら、 決して使うべきではありません。もしキャッシュがJTA環境で使われるなら、JTA <literal>TransactionManager</literal> を取得するための方法を示す <literal>hibernate.transaction.manager_lookup_class</literal> プロパティを指定しなければなりません。他の環境では、 <literal>Session.close()</literal> や <literal>Session.disconnect()</literal> が呼ばれたときに、確実にトランザクションが完了 していなければなりません。 もしクラスタでこの戦略を使いたいなら、基となるキャッシュの実装がロックをサポート していることを保証しなければなりません。 組み込みのキャッシュプロバイダは <emphasis>サポートしていません</emphasis> 。

source: Strategy: nonstrict read/write
fr_fr: <![CDATA[<class name="eg.Cat" .... > <cache usage="read-write"/> .... <set name="kittens" ... > <cache usage="read-write"/> .... </set> </class>]]>
ja_jp: <![CDATA[<class name="eg.Cat" .... > <cache usage="read-write"/> .... <set name="kittens" ... > <cache usage="read-write"/> .... </set> </class>]]>

source: If the application only occasionally needs to update data (ie. if it is extremely unlikely that two transactions would try to update the same item simultaneously) and strict transaction isolation is not required, a <literal>nonstrict-read-write</literal> cache might be appropriate. If the cache is used in a JTA environment, you must specify <literal>hibernate.transaction.manager_lookup_class</literal>. In other environments, you should ensure that the transaction is completed when <literal>Session.close()</literal> or <literal>Session.disconnect()</literal> is called.
fr_fr: Stratégie : lecture/écriture non stricte
ja_jp: 厳密ではないread/write戦略

source: Strategy: transactional
fr_fr: Si l'application besoin de mettre à jour les données de manière occasionnelle (qu'il est très peu probable que deux transactions essaient de mettre à jour le même élément simultanément) et qu'une isolation transactionnelle stricte n'est pas nécessaire, un cache <literal>nonstrict-read-write</literal> peut être approprié. Si le cache est utilisé dans un environnement JTA, vous devez spécifier <literal>hibernate.transaction.manager_lookup_class</literal>. Dans d'autres environnements, vous devriez vous assurer que la transation est terminée à l'appel de <literal>Session.close()</literal> ou <literal>Session.disconnect()</literal>
ja_jp: アプリケーションがたまにしかデータを更新する必要はなく（すなわち二つのトランザクションが 同時に同じアイテムを更新しようとすることはほとんど起こらない）、厳密なトランザクション分離が 要求されないなら、 <literal>nonstrict-read-write</literal> キャッシュが適当かもしれません。 もしキャッシュがJTA環境で使われるなら、 <literal>hibernate.transaction.manager_lookup_class</literal> を指定しなければなりません。他の環境では、 <literal>Session.close()</literal> や <literal>Session.disconnect()</literal> が呼ばれたときに、確実にトランザクションが完了 していなければなりません。

source: The <literal>transactional</literal> cache strategy provides support for fully transactional cache providers such as JBoss TreeCache. Such a cache may only be used in a JTA environment and you must specify <literal>hibernate.transaction.manager_lookup_class</literal>.
fr_fr: Stratégie : transactionelle
ja_jp: transactional戦略

source: None of the cache providers support all of the cache concurrency strategies. The following table shows which providers are compatible with which concurrency strategies.
fr_fr: La stratégie de cache <literal>transactional</literal> supporte un cache complètement transactionnel comme, par exemple, JBoss TreeCache. Un tel cache ne peut être utilisé que dans un environnement JTA et vous devez spécifier <literal>hibernate.transaction.manager_lookup_class</literal>.
ja_jp: <literal>transactional</literal> キャッシュ戦略はJBoss TreeCacheのような完全なトランザクショナル キャッシュプロバイダのサポートを提供します。 このようなキャッシュはJTA環境でのみ使用可能で、 <literal>hibernate.transaction.manager_lookup_class</literal> を指定しなければなりません。

source: Cache Concurrency Strategy Support
fr_fr: Aucun des caches livrés ne supporte toutes les stratégies de concurrence. Le tableau suivant montre quels caches sont compatibles avec quelles stratégies de concurrence.
ja_jp: すべての同時並行性キャッシュ戦略をサポートしているキャッシュプロバイダはありません。 以下の表はどのプロバイダがどの同時並列性戦略に対応するかを表しています。

source: read-only
fr_fr: Cache
ja_jp: キャッシュ

source: nonstrict-read-write
fr_fr: read-only (lecture seule)
ja_jp: read-only

source: read-write
fr_fr: nonstrict-read-write (lecture-écriture non stricte)
ja_jp: 厳密ではないread-write

source: transactional
fr_fr: read-write (lecture-ériture)
ja_jp: read-write

source: Managing the caches
fr_fr: <entry>oui</entry>
ja_jp: <entry>yes</entry>

source: Whenever you pass an object to <literal>save()</literal>, <literal>update()</literal> or <literal>saveOrUpdate()</literal> and whenever you retrieve an object using <literal>load()</literal>, <literal>get()</literal>, <literal>list()</literal>, <literal>iterate()</literal> or <literal>scroll()</literal>, that object is added to the internal cache of the <literal>Session</literal>.
fr_fr: Gérer les caches
ja_jp: キャッシュの管理

source: When <literal>flush()</literal> is subsequently called, the state of that object will be synchronized with the database. If you do not want this synchronization to occur or if you are processing a huge number of objects and need to manage memory efficiently, the <literal>evict()</literal> method may be used to remove the object and its collections from the first-level cache.
fr_fr: A chaque fois que vous passez un objet à la méthode <literal>save()</literal>, <literal>update()</literal> ou <literal>saveOrUpdate()</literal> et à chaque fois que vous récupérez un objet avec <literal>load()</literal>, <literal>get()</literal>, <literal>list()</literal>, <literal>iterate()</literal> or <literal>scroll()</literal>, cet objet est ajouté au cache interne de la <literal>Session</literal>.
ja_jp: オブジェクトを <literal>save()</literal> 、 <literal>update()</literal> 、 <literal>saveOrUpdate()</literal> に渡すとき、そして <literal>load()</literal> 、 <literal>get()</literal> 、 <literal>list()</literal> 、 <literal>iterate()</literal> 、 <literal>scroll()</literal> を使ってオブジェクトを復元するときには常に、 そのオブジェクトは <literal>Session</literal> の内部キャッシュに追加されます。

source: <![CDATA[ScrollableResult cats = sess.createQuery("from Cat as cat").scroll(); //a huge result set while ( cats.next() ) { Cat cat = (Cat) cats.get(0); doSomethingWithACat(cat); sess.evict(cat); }]]>
fr_fr: Lorsqu'il y a un appel à la méthode <literal>flush()</literal>, l'état de cet objet va être synchronisé avec la base de données. Si vous ne voulez pas que cette synchronisation ait lieu ou si vous traitez un grand nombre d'objets et que vous avez besoin de gérer la mémoire de manière efficace, vous pouvez utiliser la méthode <literal>evict()</literal> pour supprimer l'objet et ses collections dépendantes du cache de la session
ja_jp: 次に <literal>flush()</literal> が呼ばれると、オブジェクトの状態はデータベースと同期化されます。 もしこの同期が起こることを望まないときや、膨大な数のオブジェクトを処理していてメモリを効率的に 扱う必要があるときは、 <literal>evict()</literal> メソッドを使って一次キャッシュから オブジェクトやコレクションを削除することが出来ます。

source: The <literal>Session</literal> also provides a <literal>contains()</literal> method to determine if an instance belongs to the session cache.
fr_fr: <![CDATA[ScrollableResult cats = sess.createQuery("from Cat as cat").scroll(); //a huge result set while ( cats.next() ) { Cat cat = (Cat) cats.get(0); doSomethingWithACat(cat); sess.evict(cat); }]]>
ja_jp: <![CDATA[ScrollableResult cats = sess.createQuery("from Cat as cat").scroll(); //a huge result set while ( cats.next() ) { Cat cat = (Cat) cats.get(0); doSomethingWithACat(cat); sess.evict(cat); }]]>

source: To completely evict all objects from the session cache, call <literal>Session.clear()</literal>
fr_fr: La <literal>Session</literal> dispose aussi de la méthode <literal>contains()</literal> pour déterminer si une instance appartient au cache de la session.
ja_jp: <literal>Session</literal> はインスタンスがセッションキャッシュに含まれるかどうかを判断するための <literal>contains()</literal> メソッドも提供します。

source: For the second-level cache, there are methods defined on <literal>SessionFactory</literal> for evicting the cached state of an instance, entire class, collection instance or entire collection role.
fr_fr: Pour retirer tous les objets du cache session, appelez <literal>Session.clear()</literal>
ja_jp: すべてのオブジェクトをセッションキャッシュから完全に取り除くには、<literal>Session.clear()</literal> を呼び出してください。

source: <![CDATA[sessionFactory.evict(Cat.class, catId); //evict a particular Cat sessionFactory.evict(Cat.class); //evict all Cats sessionFactory.evictCollection("Cat.kittens", catId); //evict a particular collection of kittens sessionFactory.evictCollection("Cat.kittens"); //evict all kitten collections]]>
fr_fr: Pour le cache de second niveau, il existe des méthodes définies dans <literal>SessionFactory</literal> pour retirer des instances du cache, la classe entière, une instance de collection ou le rôle entier d'une collection.
ja_jp: 二次キャッシュのために、 <literal>SessionFactory</literal> には インスタンス、クラス全体、コレクションのインスタンス、コレクション全体をキャッシュから 削除するためのメソッドがそれぞれ定義されています。
