Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/performance.po
Languages: fr_fr, ja_jp

source: Improving performance
fr_fr: Améliorer les performances
ja_jp: パフォーマンスの改善

source: Fetching strategies
fr_fr: Stratégies de chargement
ja_jp: フェッチ戦略

source: A <emphasis>fetching strategy</emphasis> is the strategy Hibernate will use for retrieving associated objects if the application needs to navigate the association. Fetch strategies may be declared in the O/R mapping metadata, or over-ridden by a particular HQL or <literal>Criteria</literal> query.
fr_fr: Une <emphasis>stratégie de chargement</emphasis> est une stratégie qu'Hibernate va utiliser pour récupérer des objets associés si l'application à besoin de naviguer à travers une association. Les stratégies de chargement peuvent être déclarées dans les méta-données de l'outil de mapping objet relationnel ou surchargées par une requête de type HQL ou <literal>Criteria</literal> particulière.
ja_jp: <emphasis>フェッチ戦略</emphasis> は、アプリケーションが関連をナビゲートする必要がある ときに、Hibernateが関連オブジェクトを復元するために使用する戦略です。フェッチ戦略はO/Rマッピングの メタデータに宣言するか、特定のHQL、 <literal>Criteria</literal> クエリでオーバーライドします。

source: Hibernate3 defines the following fetching strategies:
fr_fr: Hibernate3 définit les stratégies de chargement suivantes :
ja_jp: Hibernate3は次に示すフェッチ戦略を定義しています。

source: <emphasis>Join fetching</emphasis> - Hibernate retrieves the associated instance or collection in the same <literal>SELECT</literal>, using an <literal>OUTER JOIN</literal>.
fr_fr: <emphasis>Chargement par jointure</emphasis> - Hibernate récupère l'instance associée ou la collection dans un même <literal>SELECT</literal>, en utilisant un <literal>OUTER JOIN</literal>.
ja_jp: <emphasis>結合フェッチ</emphasis> - Hibernateは <literal>OUTER JOIN</literal> を使って、 関連するインスタンスやコレクションを１つの <literal>SELECT</literal> で復元します。

source: <emphasis>Select fetching</emphasis> - a second <literal>SELECT</literal> is used to retrieve the associated entity or collection. Unless you explicitly disable lazy fetching by specifying <literal>lazy="false"</literal>, this second select will only be executed when you actually access the association.
fr_fr: <emphasis>Chargement par select</emphasis> - Un second <literal>SELECT</literal> est utilisé pour récupérer l'instance associée ou la collection. A moins que vous ne désactiviez explicitement le chargement tardif en spécifiant <literal>lazy="false"</literal>, ce second select ne sera exécuté que lorsque vous accéderez réellement à l'association.
ja_jp: <emphasis>セレクトフェッチ</emphasis> - 2回目の <literal>SELECT</literal> で関連するエンティティやコレクションを復元します。 <literal>lazy="false"</literal> で明示的に遅延フェッチを無効にしなければ、この2回目のselectは実際に 関連にアクセスしたときのみ実行されるでしょう。

source: <emphasis>Subselect fetching</emphasis> - a second <literal>SELECT</literal> is used to retrieve the associated collections for all entities retrieved in a previous query or fetch. Unless you explicitly disable lazy fetching by specifying <literal>lazy="false"</literal>, this second select will only be executed when you actually access the association.
fr_fr: <emphasis>Chargement par sous-select</emphasis> - Un second <literal>SELECT</literal> est utilisé pour récupérer les associations pour toutes les entités récupérées dans une requête ou un chargement préalable. A moins que vous ne désactiviez explicitement le chargement tardif en spécifiant <literal>lazy="false"</literal>, ce second select ne sera exécuté que lorsque vous accéderez réellement à l'association.
ja_jp: <emphasis>サブセレクトフェッチ</emphasis> - 2回目の <literal>SELECT</literal> で、直前のクエリやフェッチで復元したすべての要素に関連するコレクションを 復元します。 <literal>lazy="false"</literal> で明示的に遅延フェッチを無効にしなければ、この2回目のselectは実際に 関連にアクセスしたときのみ実行されるでしょう。

source: <emphasis>Batch fetching</emphasis> - an optimization strategy for select fetching - Hibernate retrieves a batch of entity instances or collections in a single <literal>SELECT</literal>, by specifying a list of primary keys or foreign keys.
fr_fr: <emphasis>Chargement par lot</emphasis> - Il s'agit d'une stratégie d'optimisation pour le chargement par select - Hibernate récupère un lot d'instances ou de collections en un seul <literal>SELECT</literal> en spécifiant une liste de clé primaire ou de clé étrangère.
ja_jp: <emphasis>バッチフェッチ</emphasis> - セレクトフェッチのための最適化された戦略 - Hibernateはエンティティのインスタンスやコレクションの一群を1回の <literal>SELECT</literal> で復元します。これは主キーや外部キーのリストを指定することに により行います。

source: Hibernate also distinguishes between:
fr_fr: Hibernate fait également la distinction entre :
ja_jp: Hibernateは次に示す戦略とも区別をします。

source: <emphasis>Immediate fetching</emphasis> - an association, collection or attribute is fetched immediately, when the owner is loaded.
fr_fr: <emphasis>Chargement immédiat</emphasis> - Une association, une collection ou un attribut est chargé immédiatement lorsque l'objet auquel appartient cet élément est chargé.
ja_jp: <emphasis>即時フェッチ</emphasis> - 所有者のオブジェクトがロードされたときに、 関連、コレクションは即時にフェッチされます。

source: <emphasis>Lazy collection fetching</emphasis> - a collection is fetched when the application invokes an operation upon that collection. (This is the default for collections.)
fr_fr: <emphasis>Chargement tardif d'une collection</emphasis> - Une collection est chargée lorque l'application invoque une méthode sur cette collection (il s'agit du mode de chargement par défaut pour les collections).
ja_jp: <emphasis>遅延コレクションフェッチ</emphasis> - アプリケーションがコレクションに 対して操作を行ったときにコレクションをフェッチします。 (これはコレクションに対するデフォルトの動作です)

source: <emphasis>"Extra-lazy" collection fetching</emphasis> - individual elements of the collection are accessed from the database as needed. Hibernate tries not to fetch the whole collection into memory unless absolutely needed (suitable for very large collections)
fr_fr: <emphasis>Chargement "super tardif" d'une collection</emphasis> - les éléments de la collection sont récupérés individuellement depuis la base de données lorsque nécessaire. Hibernate essaie de ne pas charger toute la collection en mémoire sauf si cela est absolument nécessaire (bien adapté aux très grandes collections).
ja_jp: <emphasis>"特別な遅延"コレクションフェッチ</emphasis> - コレクションの要素 １つ１つが独立して、必要なときにデータベースから取得されます。 Hibernateは必要ないならば、コレクション全体をメモリにフェッチすることは 避けます（とても大きなコレクションに適しています）。

source: <emphasis>Proxy fetching</emphasis> - a single-valued association is fetched when a method other than the identifier getter is invoked upon the associated object.
fr_fr: <emphasis>Chargement par proxy</emphasis> - une association vers un seul objet est chargée lorsqu'une méthode autre que le getter sur l'identifiant est appelée sur l'objet associé.
ja_jp: <emphasis>プロキシフェッチ</emphasis> - 単一値関連は、識別子のgetter以外の メソッドが関連オブジェクトで呼び出されるときにフェッチされます。

source: <emphasis>"No-proxy" fetching</emphasis> - a single-valued association is fetched when the instance variable is accessed. Compared to proxy fetching, this approach is less lazy (the association is fetched even when only the identifier is accessed) but more transparent, since no proxy is visible to the application. This approach requires buildtime bytecode instrumentation and is rarely necessary.
fr_fr: <emphasis>Chargement "sans proxy"</emphasis> - une association vers un seul objet est chargée lorsque l'on accède à cet objet. Par rapport au chargement par proxy, cette approche est moins tardif (l'association est quand même chargée même si on n'accède qu'à l'identifiant) mais plus transparente car il n'y a pas de proxy visible dans l'application. Cette approche requiert une instrumentation du bytecode à la compilation et est rarement nécessaire.
ja_jp: <emphasis>"プロキシなし"フェッチ</emphasis> - 単一値関連は、インスタンス変数に アクセスされたときにフェッチされます。プロキシフェッチと比較すると、この方法は 遅延の度合いが少ない（関連は識別子にアクセスしただけでもフェッチされます） ですが、より透過的で、アプリケーションにプロキシが存在しないように見せます。 この方法はビルド時のバイトコード組み込みが必要になり、使う場面はまれです。

source: <emphasis>Lazy attribute fetching</emphasis> - an attribute or single valued association is fetched when the instance variable is accessed. This approach requires buildtime bytecode instrumentation and is rarely necessary.
fr_fr: <emphasis>Chargement tardif des attributs</emphasis> - Un attribut ou un objet associé seul est chargé lorsque l'on y accède. Cette approche requiert une instrumentation du bytecode à la compilation et est rarement nécessaire.
ja_jp: <emphasis>遅延属性フェッチ</emphasis> - 属性や単一値関連は、インスタンス変数にアクセスした ときにフェッチされます。この方法はビルド時のバイトコード組み込みが必要になり、 使う場面はまれです。

source: We have two orthogonal notions here: <emphasis>when</emphasis> is the association fetched, and <emphasis>how</emphasis> is it fetched (what SQL is used). Don't confuse them! We use <literal>fetch</literal> to tune performance. We may use <literal>lazy</literal> to define a contract for what data is always available in any detached instance of a particular class.
fr_fr: Nous avons ici deux notions orthogonales : <emphasis>quand</emphasis> l'association est chargée et <emphasis>comment</emphasis> (quelle requête SQL est utilisée). Il ne faut pas confondre les deux. Le mode de chargement est utilisé pour améliorer les performances. On peut utiliser le mode tardif pour définir un contrat sur quelles données sont toujours accessibles sur une instance détachée d'une classe particulière.
ja_jp: 二つの直行する概念があります: <emphasis>いつ</emphasis> 関連をフェッチするか、 そして、 <emphasis>どうやって</emphasis> フェッチするか（どんなSQLを使って）。 これらを混同しないでください！ <literal>fetch</literal> はパフォーマンスチューニングに使います。 <literal>lazy</literal> はあるクラスの分離されたインスタンスのうち、どのデータを常に 使用可能にするかの取り決めを定義します。

source: Working with lazy associations
fr_fr: Travailler avec des associations chargées tardivement
ja_jp: 遅延関連の働き

source: By default, Hibernate3 uses lazy select fetching for collections and lazy proxy fetching for single-valued associations. These defaults make sense for almost all associations in almost all applications.
fr_fr: Par défaut, Hibernate3 utilise le chargement tardif par select pour les collections et le chargement tardif par proxy pour les associations vers un seul objet. Ces valeurs par défaut sont valables pour la plupart des associations dans la plupart des applications.
ja_jp: デフォルトでは、Hibernate3はコレクションに対しては遅延セレクトフェッチを使い、 単一値関連には遅延プロキシフェッチを使います。これらのデフォルト動作はほぼすべての アプリケーションのほぼすべての関連で意味があります。

source: <emphasis>Note:</emphasis> if you set <literal>hibernate.default_batch_fetch_size</literal>, Hibernate will use the batch fetch optimization for lazy fetching (this optimization may also be enabled at a more granular level).
fr_fr: <emphasis>Note :</emphasis> si vous définissez <literal>hibernate.default_batch_fetch_size</literal>, Hibernate va utiliser l'optimisation du chargement par lot pour le chargement tardif (cette optimisation peut aussi être activée à un niveau de granularité plus fin).
ja_jp: <emphasis>注:</emphasis> <literal>hibernate.default_batch_fetch_size</literal> をセットしたときは、Hibernateは 遅延フェッチのためのバッチフェッチ最適化を使うでしょう （この最適化はより細かいレベルで有効にすることも出来ます）。

source: However, lazy fetching poses one problem that you must be aware of. Access to a lazy association outside of the context of an open Hibernate session will result in an exception. For example:
fr_fr: Cependant, le chargement tardif pose un problème qu'il faut connaitre. L'accès à une association définie comme "tardive", hors du contexte d'une session hibernate ouverte, va conduire à une exception. Par exemple :
ja_jp: しかし、遅延フェッチは知っておかなければならない一つの問題があります。 Hibernateのsessionをオープンしているコンテキストの外から遅延関連にアクセスすると、 例外が発生します。例：

source: Since the permissions collection was not initialized when the <literal>Session</literal> was closed, the collection will not be able to load its state. <emphasis>Hibernate does not support lazy initialization for detached objects</emphasis>. The fix is to move the code that reads from the collection to just before the transaction is committed.
fr_fr: Etant donné que la collection des permissions n'a pas été initialisée avant que la <literal>Session</literal> soit fermée, la collection n'est pas capable de se charger. <emphasis>Hibernate ne supporte pas le chargement tardif pour des objets détachés</emphasis>. La solution à ce problème est de déplacer le code qui lit la collection avant le "commit" de la transaction.
ja_jp: <literal>Session</literal> がクローズされたとき、permissionsコレクションは 初期化されていないため、このコレクションは自身の状態をロードできません。 <emphasis>Hibernateは切り離されたオブジェクトの遅延初期化はサポート していません</emphasis> 。修正方法として、コレクションから読み込みを行うコードを トランザクションをコミットする直前に移動させます。

source: Alternatively, we could use a non-lazy collection or association, by specifying <literal>lazy="false"</literal> for the association mapping. However, it is intended that lazy initialization be used for almost all collections and associations. If you define too many non-lazy associations in your object model, Hibernate will end up needing to fetch the entire database into memory in every transaction!
fr_fr: Une autre alternative est d'utiliser une collection ou une association non "tardive" en spécifiant <literal>lazy="false"</literal> dans le mapping de l'association. Cependant il est prévu que le chargement tardif soit utilisé pour quasiment toutes les collections ou associations. Si vous définissez trop d'associtions non "tardives" dans votre modèle objet, Hibernate va finir par devoir charger toute la base de données en mémoire à chaque transaction !
ja_jp: 一方で、 <literal>lazy="false"</literal> を関連マッピングに指定することで、 遅延処理をしないコレクションや関連を使うことが出来ます。 しかしながら、遅延初期化はほぼすべてのコレクションや関連で使われることを 意図しています。もしあなたのオブジェクトモデルの中に遅延処理をしない関連を 多く定義してしまうと、Hibernateは最終的にはトランザクション毎に ほぼ完全なデータベースをメモリの中にフェッチすることになるでしょう！

source: On the other hand, we often want to choose join fetching (which is non-lazy by nature) instead of select fetching in a particular transaction. We'll now see how to customize the fetching strategy. In Hibernate3, the mechanisms for choosing a fetch strategy are identical for single-valued associations and collections.
fr_fr: D'un autre côté, on veut souvent choisir un chargement par jointure (qui est par défaut non tardif) à la place du chargement par select dans une transaction particulière. Nous allons maintenant voir comment adapter les stratégies de chargement. Dans Hibernate3 les mécanismes pour choisir une stratégie de chargement sont identiques que l'on ait une association vers un objet simple ou vers une collection.
ja_jp: 他方では、特定のトランザクションにおいてセレクトフェッチの代わりに 結合フェッチ（当然これは遅延処理ではなくなります）を選択したいことが 時々あります。これからフェッチ戦略をカスタマイズする方法をお見せします。 Hibernate3では、フェッチ戦略を選択する仕組みは単一値関連とコレクションで 変わりはありません。

source: Tuning fetch strategies
fr_fr: Personnalisation des stratégies de chargement
ja_jp: フェッチ戦略のチューニング

source: Select fetching (the default) is extremely vulnerable to N+1 selects problems, so we might want to enable join fetching in the mapping document:
fr_fr: Le chargement par select (mode par défaut) est très vulnérable au problème du N+1 selects, du coup vous pouvez avoir envie d'activer le chargement par jointure dans les fichiers de mapping :
ja_jp: セレクトフェッチ（デフォルト）はN+1セレクト問題という大きな弱点があるため、 マッピング定義で結合フェッチを有効にすることができます。

source: The <literal>fetch</literal> strategy defined in the mapping document affects:
fr_fr: La stratégie de chargement définie à l'aide du mot <literal>fetch</literal> dans les fichiers de mapping affecte :
ja_jp: マッピング定義で定義した <literal>フェッチ</literal> 戦略は次のものに影響します。

source: retrieval via <literal>get()</literal> or <literal>load()</literal>
fr_fr: La récupération via <literal>get()</literal> ou <literal>load()</literal>
ja_jp: <literal>get()</literal> や <literal>load()</literal> による復元

source: retrieval that happens implicitly when an association is navigated
fr_fr: La récupération implicite lorsque l'on navigue à travers une association
ja_jp: 関連にナビゲートしたときに発生する暗黙的な復元

source: <literal>Criteria</literal> queries
fr_fr: Les requêtes de type <literal>Criteria</literal>
ja_jp: <literal>Criteria</literal> クエリ

source: HQL queries if <literal>subselect</literal> fetching is used
fr_fr: Les requêtes HQL si l'on utilise le chargement par <literal>subselect</literal>
ja_jp: <literal>サブセレクト</literal> フェッチを使うHQLクエリ

source: No matter what fetching strategy you use, the defined non-lazy graph is guaranteed to be loaded into memory. Note that this might result in several immediate selects being used to execute a particular HQL query.
fr_fr: Quelle que soit la stratégie de chargement que vous utilisez, la partie du graphe d'objets qui est définie comme non "tardive" sera chargée en mémoire. Cela peut mener à l'exécution de plusieurs selects successifs pour une seule requête HQL.
ja_jp: たとえどんなフェッチ戦略を使ったとしても、遅延ではないグラフはメモリに読み込まれることが 保証されます。つまり、特定のHQLクエリを実行するためにいくつかのSELECT文が即時実行される ことがあるので注意してください。

source: Usually, we don't use the mapping document to customize fetching. Instead, we keep the default behavior, and override it for a particular transaction, using <literal>left join fetch</literal> in HQL. This tells Hibernate to fetch the association eagerly in the first select, using an outer join. In the <literal>Criteria</literal> query API, you would use <literal>setFetchMode(FetchMode.JOIN)</literal>.
fr_fr: On n'utilise pas souvent les documents de mapping pour adapter le chargement. Au lieu de cela, on conserve le comportement par défaut et on le surcharge pour une transaction particulière en utilisant <literal>left join fetch</literal> dans les requêtes HQL. Cela indique à hibernate à Hibernate de charger l'association de manière agressive lors du premier select en utilisant une jointure externe. Dans l'API Criteria vous pouvez utiliser la méthode <literal>setFetchMode(FetchMode.JOIN)</literal>
ja_jp: 通常は、マッピング定義でフェッチのカスタマイズは行いません。 代わりに、デフォルトの動作のままにしておいて、HQLで <literal>left join fetch</literal> を 指定することで特定のトランザクションで動作をオーバーライドします。 これはHibernateに初回のセレクトで外部結合を使って関連を先にフェッチするように指定しています。 <literal>Criteria</literal> クエリのAPIでは、 <literal>setFetchMode(FetchMode.JOIN)</literal> を使うことが出来ます。

source: If you ever feel like you wish you could change the fetching strategy used by <literal>get()</literal> or <literal>load()</literal>, simply use a <literal>Criteria</literal> query, for example:
fr_fr: Si vous ne vous sentez pas prêt à modifier la stratégie de chargement utilisé par <literal>get()</literal> ou <literal>load()</literal>, vous pouvez juste utiliser une requête de type <literal>Criteria</literal> comme par exemple :
ja_jp: もし <literal>get()</literal> や <literal>load()</literal> で使われる フェッチ戦略を変えたいと感じたときには、単純に <literal>Criteria</literal> クエリを使ってください。例：

source: (This is Hibernate's equivalent of what some ORM solutions call a "fetch plan".)
fr_fr: (Il s'agit de l'équivalent pour Hibernate de ce que d'autres outils de mapping appellent un "fetch plan" ou "plan de chargement")
ja_jp: （これはいくつかのORMソリューションが"fetch plan"と呼んでいるものと同じです。）

source: A completely different way to avoid problems with N+1 selects is to use the second-level cache.
fr_fr: Une autre manière complètement différente d'éviter le problème des N+1 selects est d'utiliser le cache de second niveau.
ja_jp: N+1セレクト問題を避けるためのまったく違う方法は、第2レベルキャッシュを使うことです。

source: Single-ended association proxies
fr_fr: Proxys pour des associations vers un seul objet
ja_jp: 単一端関連プロキシ

source: Lazy fetching for collections is implemented using Hibernate's own implementation of persistent collections. However, a different mechanism is needed for lazy behavior in single-ended associations. The target entity of the association must be proxied. Hibernate implements lazy initializing proxies for persistent objects using runtime bytecode enhancement (via the excellent CGLIB library).
fr_fr: Le chargement tardif des collections est implémenté par Hibernate en utilisant ses propres implémentations pour des collections persistantes. Si l'on veut un chargement tardif pour des associations vers un seul objet métier il faut utiliser un autre mécanisme. L'entité qui est pointée par l'association doit être masquée derrière un proxy. Hibernate implémente l'initialisation tardive des proxys sur des objets persistents via une mise à jour à chaud du bytecode (à l'aide de l'excellente librairie CGLIB).
ja_jp: コレクションの遅延フェッチは、Hibernate自身の実装による永続コレクションを使って 実現しています。しかし、単一端関連における遅延処理では、違う仕組みが 必要です。対象の関連エンティティはプロキシでなければなりません。Hibernateは （すばらしいCGLIBライブラリによる）実行時のバイトコード拡張を 使って永続オブジェクトの遅延初期化プロキシを実現しています。

source: By default, Hibernate3 generates proxies (at startup) for all persistent classes and uses them to enable lazy fetching of <literal>many-to-one</literal> and <literal>one-to-one</literal> associations.
fr_fr: Par défaut, Hibernate génère des proxys (au démarrage) pour toutes les classes persistantes et les utilise pour activer le chargement tardif des associations <literal>many-to-one</literal> et <literal>one-to-one</literal>.
ja_jp: デフォルトでは、Hibernate3は（開始時に）すべての永続クラスのプロキシを生成し、 それらを使って、 <literal>many-to-one</literal> や <literal>one-to-one</literal> 関連の 遅延フェッチを可能にしています。

source: The mapping file may declare an interface to use as the proxy interface for that class, with the <literal>proxy</literal> attribute. By default, Hibernate uses a subclass of the class. <emphasis>Note that the proxied class must implement a default constructor with at least package visibility. We recommend this constructor for all persistent classes!</emphasis>
fr_fr: Le fichier de mapping peut déclarer une interface qui sera utilisée par le proxy d'interfaçage pour cette classe à l'aide de l'attribut <literal>proxy</literal>. Par défaut Hibernate utilises une sous classe de la classe persistante. <emphasis>Il faut que les classes pour lesquelles on ajoute un proxy implémentent un constructeur par défaut de visibilité au moins package. Ce constructeur est recommandé pour toutes les classes persistantes !</emphasis>
ja_jp: マッピングファイルで <literal>proxy</literal> 属性によって、クラスのプロキシインターフェイスとして 使うインターフェイスを宣言できます。デフォルトでは、Hibernateはそのクラスのサブクラスを使います。 <emphasis>プロキシクラスは少なくともパッケージ可視でデフォルトコンストラクタを実装しなければ ならないことに注意してください。すべての永続クラスにこのコンストラクタを推奨します！</emphasis>

source: There are some gotchas to be aware of when extending this approach to polymorphic classes, eg.
fr_fr: Il y a quelques précautions à prendre lorsque l'on étend cette approche à des classes polymorphiques, exemple :
ja_jp: ポリモーフィズムのクラスに対してこの方法を適用するときにいくつか考慮することがあります。 例：

source: <![CDATA[<class name="Cat" proxy="Cat"> ...... <subclass name="DomesticCat"> ..... </subclass> </class>]]>
fr_fr: <![CDATA[<class name="Cat" proxy="Cat"> ...... <subclass name="DomesticCat" proxy="DomesticCat"> ..... </subclass> </class>]]>

source: Firstly, instances of <literal>Cat</literal> will never be castable to <literal>DomesticCat</literal>, even if the underlying instance is an instance of <literal>DomesticCat</literal>:
fr_fr: Tout d'abord, les instances de <literal>Cat</literal> ne pourront jamais être "castées" en <literal>DomesticCat</literal>, même si l'instance sous jacente est une instance de <literal>DomesticCat</literal> :
ja_jp: 第一に、 <literal>Cat</literal> のインスタンスは <literal>DomesticCat</literal> にキャストできません。たとえ基となるインスタンスが <literal>DomesticCat</literal> であったとしてもです。

source: <![CDATA[Cat cat = (Cat) session.load(Cat.class, id); // instantiate a proxy (does not hit the db) if ( cat.isDomesticCat() ) { // hit the db to initialize the proxy DomesticCat dc = (DomesticCat) cat; // Error! .... }]]>
fr_fr: <![CDATA[Cat cat = (Cat) session.load(Cat.class, id); // instancie un proxy (n'interroge pas la base de données) if ( cat.isDomesticCat() ) { // interroge la base de données pour initialiser le proxy DomesticCat dc = (DomesticCat) cat; // Erreur ! .... }]]>

source: Secondly, it is possible to break proxy <literal>==</literal>.
fr_fr: Deuxièmement, il est possible de casser la notion d'<literal>==</literal> des proxy.
ja_jp: 第二に、プロキシの <literal>==</literal> は成立しないことがあります。

source: <![CDATA[Cat cat = (Cat) session.load(Cat.class, id); // instantiate a Cat proxy DomesticCat dc = (DomesticCat) session.load(DomesticCat.class, id); // acquire new DomesticCat proxy! System.out.println(cat==dc); // false]]>
fr_fr: <![CDATA[Cat cat = (Cat) session.load(Cat.class, id); // instancie un proxy Cat DomesticCat dc = (DomesticCat) session.load(DomesticCat.class, id); // acquiert un nouveau proxy DomesticCat System.out.println(cat==dc); // faux]]>
