Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/preface.po
Languages: es_es, ja_jp

source: Preface
es_es: Prefacio
ja_jp: <title>前書き</title>

source: Working with object-oriented software and a relational database can be cumbersome and time consuming in today's enterprise environments. Hibernate is an object/relational mapping tool for Java environments. The term object/relational mapping (ORM) refers to the technique of mapping a data representation from an object model to a relational data model with a SQL-based schema.
es_es: Trabajar con software orientado a objetos y una base de datos relacional puede ser incómodo y consumir tiempo en los entornos de empresa de hoy. Hibernate es una herramienta de mapeo objeto/relacional para entornos Java. El término mapeo objeto/relacional (MOR) hace referencia a la técnica de mapear una representación de datos desde un modelo de objetos a un modelo de datos relacional con un esquema basado en SQL.
ja_jp: 今日の企業環境において、オブジェクト指向ソフトウェアとリレーショナルデータベースに関わる作業は 煩雑で膨大な時間を必要とします。 HibernateはJava環境のオブジェクト/リレーショナルマッピングツールです。 オブジェクト/リレーショナルマッピング（ORM）とは、 オブジェクトモデルからSQLベーススキーマのリレーショナルデータモデルへと、 データ表現をマッピングする（対応付ける）技術のことです。

source: Hibernate not only takes care of the mapping from Java classes to database tables (and from Java data types to SQL data types), but also provides data query and retrieval facilities and can significantly reduce development time otherwise spent with manual data handling in SQL and JDBC.
es_es: Hibernate no sólo se encarga de mapear de clases Java a tablas de base de datos (y de tipos de datos de Java a tipos de datos SQL), sino que también provee facilidades de consulta y recuperación de datos y puede reducir significativamente el tiempo de desarrollo que de otra forma se gasta en el manejo de los datos en SQL y JDBC.
ja_jp: HibernateはJavaクラスからデータベーステーブルへ（そしてJavaデータ型からSQLデータ型へ） のマッピングを処理するだけではなく、データのクエリと復元の仕組みも提供します。 このおかげでSQLとJDBCを使った手作業でのデータ処理に費やされていた開発時間を大幅に削減できます。

source: Hibernates goal is to relieve the developer from 95 percent of common data persistence related programming tasks. Hibernate may not be the best solution for data-centric applications that only use stored-procedures to implement the business logic in the database, it is most useful with object-oriented domain models and business logic in the Java-based middle-tier. However, Hibernate can certainly help you to remove or encapsulate vendor-specific SQL code and will help with the common task of result set translation from a tabular representation to a graph of objects.
es_es: La meta de Hibernate es relevar al desarrollador del 95 por ciento de las tareas comunes relacionadas a la programación de la persistencia de los datos. Hibernate puede no ser la mejor solución para aplicaciones que usan solamente procedimientos almacenados para implementar la lógica de negocio en la base de datos, es mas útil con modelos de dominio orientados a objetos y lógica de negocio en middle-tier basada en Java. Sin embargo, Hibernate ciertamente puede ayudarte a quitar o encapsular código SQL específico de vendedor y ayudará con la tarea común de traducción de resultados desde una representación tabular a un grafo de objetos.
ja_jp: Hibernateの最終目標は、データの永続化に関わる一般的なプログラミング作業の95％から開発者を解放することです。 Hibernateはビジネスロジックの実装にストアドプロシージャを使う データ中心アプリケーションに対してのベストソリューションであるに留まりません。 オブジェクト指向ドメインモデルとJavaベースの中間層でのビジネスロジックに対して最も役に立ちます。 しかしHibernateはベンダ固有のSQLコードを削減またはカプセル化したり、 表形式からオブジェクトのグラフへとリザルトセットを変換するなどの、 一般的なタスクにも役立つでしょう。

source: If you are new to Hibernate and Object/Relational Mapping or even Java, please follow these steps:
es_es: Si eres nuevo en Hibernate y lo del Mapeo Objeto/Relacional o incluso en Java, sigue por favor estos pasos:
ja_jp: Hibernateやオブジェクト/リレーショナルマッピング、 さらにはJavaが初めての方は、以下のステップに従ってください：

source: Read <xref linkend="tutorial"/> for a tutorial with step-by-step instructions. The source code for the tutorial is included in the distribution in the <literal>doc/reference/tutorial/</literal> directory.
es_es: Lee <xref linkend="quickstart"/> para un tutorial de 30 minutos, usando Tomcat.
ja_jp: を読んでください。 段階的に解説していきます。 チュートリアルのソースコードはディストリビューションの <literal>doc/reference/tutorial</literal> ディレクトリに含まれています。

source: Read <xref linkend="architecture"/> to understand the environments where Hibernate can be used.
es_es: Lee <xref linkend="architecture"/> para entender los entornos en los que puede ser usado Hibernate.
ja_jp: を読んで、Hibernateが利用可能な環境を理解してください。

source: Have a look at the <literal>eg/</literal> directory in the Hibernate distribution, it contains a simple standalone application. Copy your JDBC driver to the <literal>lib/</literal> directory and edit <literal>etc/hibernate.properties</literal>, specifying correct values for your database. From a command prompt in the distribution directory, type <literal>ant eg</literal> (using Ant), or under Windows, type <literal>build eg</literal>.
es_es: Dale una mirada al directorio <literal>eg/</literal> en la distribución de Hibernate, contiene una aplicación independiente simple. Copia tu driver JDBC al directorio <literal>lib/</literal> y edita <literal>etc/hibernate.properties</literal>, especificando los valores correctos para tu base de datos. Desde línea de comandos en el directorio de la distribución, tipea <literal>ant eg</literal> (usando Ant), o bajo Windows, tipea <literal>build eg</literal>.
ja_jp: Hibernateディストリビューションの <literal>eg/</literal> ディレクトリを見てください。 簡単なスタンドアローンのアプリケーションがあります。 JDBCドライバを <literal>lib/</literal> ディレクトリにコピーして、 自分のデータベースに合う正しい値を指定するように <literal>etc/hibernate.properties</literal> を編集してください。 ディストリビューションディレクトリから、コマンドプロンプトで <literal>ant eg</literal> とタイプしてください（Antを使います）。 またWindows環境では <literal>build eg</literal> とタイプしてください。

source: Use this reference documentation as your primary source of information. Consider reading <emphasis>Java Persistence with Hibernate</emphasis> (http://www.manning.com/bauer2) if you need more help with application design or if you prefer a step-by-step tutorial. Also visit http://caveatemptor.hibernate.org and download the example application for Java Persistence with Hibernate.
es_es: Usa esta documentación de referencia como tu fuente de información primaria. Ten en consideración leer <emphasis>Java Persistence with Hibernate</emphasis> (http://www.manning.com/bauer2) si necesitas mas ayuda con el diseño de aplicaciones o si prefieres un tutorial paso a paso. Visita también http://caveatemptor.hibernate.org y descarga la aplicación de ejemplo para Java Persistence with Hibernate.
ja_jp: このリファレンスドキュメントを第一の情報源として利用してください。 アプリケーション設計についてのさらなる情報や段階的なチュートリアルを探しているなら、 <emphasis>Java Persistence with Hibernate</emphasis>（http://www.manning.com/bauer2） をおすすめします。 またhttp://caveatemptor.hibernate.orgから Java Persistence with Hibernateの例題のアプリケーションをダウンロードできます。

source: FAQs are answered on the Hibernate website.
es_es: Los FAQs son respondidos en el sitio web de Hibernate.
ja_jp: FAQはHibernateウェブサイトにあります。

source: Third party demos, examples, and tutorials are linked on the Hibernate website.
es_es: En el sitio web de Hibernate hay enlaces a demos de terceros, ejemplos y tutoriales.
ja_jp: サードパーティのデモ、例、チュートリアルはHibernateウェブサイトにリンクがあります。

source: The Community Area on the Hibernate website is a good resource for design patterns and various integration solutions (Tomcat, JBoss AS, Struts, EJB, etc.).
es_es: El Area de Comunidad en el sitio web de Hibernate es una buena fuente de patrones de diseño y varias soluciones de integración (Tomcat, JBoss, Struts, EJB, etc.).
ja_jp: Hibernateウェブサイトのコミュニティエリアは、デザインパターンやさまざまな統合ソリューション （Tomcat, JBoss AS, Struts, EJB, 等）についてのよい情報源です。

source: If you have questions, use the user forum linked on the Hibernate website. We also provide a JIRA issue trackings system for bug reports and feature requests. If you are interested in the development of Hibernate, join the developer mailing list. If you are interested in translating this documentation into your language, contact us on the developer mailing list.
es_es: Si tienes preguntas, usa el foro de usuarios enlazado en el sitio web de Hibernate. También proveemos un sistema de seguimiento JIRA para reportes de defectos y peticiones de nuevas características. Si estas interesado en el desarrollo de Hibernate, únete a la lista de correo de desarrolladores. Si estas interesado en traducir esta documentación a tu lenguaje, contáctanos en la lista de correo de desarrolladores.
ja_jp: 質問があればHibernateウェブサイトのユーザフォーラムを活用してください。 またバグレポートとフィーチャリクエストのためJIRA課題追跡システムを用意しています。 Hibernateの開発に興味があれば、開発者メーリングリストに参加してください。 このドキュメントをあなたの国の言葉に翻訳したい場合は、 開発者メーリングリストで私たちにコンタクトを取ってください。

source: Commercial development support, production support, and training for Hibernate is available through JBoss Inc. (see http://www.hibernate.org/SupportTraining/). Hibernate is a Professional Open Source project and a critical component of the JBoss Enterprise Middleware System (JEMS) suite of products.
es_es: A través de JBoss Inc. (see http://www.hibernate.org/SupportTraining/) hay disponibilidad de soporte comercial de desarrollo, soporte de producción y entrenamiento en Hibernate. Hibernate es un proyecto de la suite de productos de código abierto JBoss Professional.
ja_jp: 商用開発のサポート、製品のサポート、HibernateのトレーニングはJBoss Inc.が提供しています （http://www.hibernate.org/SupportTraining/を見てください）。 HibernateはProfessional Open Sourceプロジェクト、 そしてJBoss Enterprise Middleware System（JEMS）プロダクトスイートのクリティカルコンポーネントです。

source: ROLES_OF_TRANSLATORS
ja_jp: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
ja_jp: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
