Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/query_hql.po
Languages: fr_fr, ja_jp

source: HQL: The Hibernate Query Language
fr_fr: HQL: Langage de requêtage d'Hibernate

source: Hibernate is equipped with an extremely powerful query language that (quite intentionally) looks very much like SQL. But don't be fooled by the syntax; HQL is fully object-oriented, understanding notions like inheritence, polymorphism and association.
fr_fr: Hibernate fourni un langage d'interrogation extrêmement puissant qui ressemble (et c'est voulu) au SQL. Mais ne soyez pas distraits par la syntaxe ; HQL est totalement orienté objet, comprenant des notions d'héritage, de polymorphisme et d'association.
ja_jp: HibernateはSQLに非常によく似た(意図的に似せた)強力な問い合わせ言語を備えています。 しかしSQLに似た構文に惑わされないでください。HQLは完全にオブジェクト指向であり、 継承、ポリモーフィズム、関連といった概念を理解します。

source: Case Sensitivity
fr_fr: Sensibilité à la casse
ja_jp: 大文字と小文字の区別

source: Queries are case-insensitive, except for names of Java classes and properties. So <literal>SeLeCT</literal> is the same as <literal>sELEct</literal> is the same as <literal>SELECT</literal> but <literal>org.hibernate.eg.FOO</literal> is not <literal>org.hibernate.eg.Foo</literal> and <literal>foo.barSet</literal> is not <literal>foo.BARSET</literal>.
fr_fr: Les requêtes sont insensibles à la casse, à l'exception des noms des classes Java et des propriétés. Ainsi, <literal>SeLeCT</literal> est identique à <literal>sELEct</literal> et à <literal>SELECT</literal> mais <literal>net.sf.hibernate.eg.FOO</literal> n'est pas identique <literal>net.sf.hibernate.eg.Foo</literal> et <literal>foo.barSet</literal> n'est pas identique à <literal>foo.BARSET</literal>.
ja_jp: クエリはJavaのクラス名とプロパティ名を除いて大文字、小文字を区別しません。 従って <literal>SeLeCT</literal> は <literal>sELEct</literal> と同じで、かつ <literal>SELECT</literal> とも同じですが <literal>net.sf.hibernate.eg.FOO</literal> は <literal>net.sf.hibernate.eg.Foo</literal> とは違い、かつ <literal>foo.barSet</literal> は <literal>foo.BARSET</literal> とも違います。

source: This manual uses lowercase HQL keywords. Some users find queries with uppercase keywords more readable, but we find this convention ugly when embedded in Java code.
fr_fr: Ce guide utilise les mots clés HQL en minuscule. Certains utilisateurs trouvent les requêtes écrites avec les mots clés en majuscule plus lisibles, mais nous trouvons cette convention pénible lorsqu'elle est lue dans du code Java.
ja_jp: このマニュアルでは小文字のHQLキーワードを使用します。 大文字のキーワードのクエリの方が読みやすいと感じるユーザーもいると思います。 ですが、Javaコード内に埋め込まれたときには見づらいと思います。

source: The from clause
fr_fr: La clause from
ja_jp: from節

source: The simplest possible Hibernate query is of the form:
fr_fr: La requête Hibernate la plus simple est de la forme :
ja_jp: もっとも単純なHibernateクエリは次の形式です。

source: which simply returns all instances of the class <literal>eg.Cat</literal>. We don't usually need to qualify the class name, since <literal>auto-import</literal> is the default. So we almost always just write:
fr_fr: qui retourne simplement toutes les instances de la classe <literal>eg.Cat</literal>. Nous n'avons pas besoin d'habitude de qualifier le nom de la classe, puisque <literal>auto-import</literal> est la valeur par défaut. Donc nous écrivons presque toujours :
ja_jp: これは単純に <literal>eg.Cat</literal> クラスのインスタンスをすべて返します。 必ずしもクラス名を修飾する（クラスにパッケージ名を付ける）必要はありません。 というのも、<literal>auto-import</literal> がデフォルトになっているからです。 そのためほとんどの場合、このように書くだけで十分です。

source: Most of the time, you will need to assign an <emphasis>alias</emphasis>, since you will want to refer to the <literal>Cat</literal> in other parts of the query.
fr_fr: La plupart du temps, vous devrez assigner un <emphasis>alias</emphasis> puisque vous voudrez faire référence à <literal>Cat</literal> dans d'autres parties de la requête.
ja_jp: ほとんどの場合クエリのほかの部分で <literal>Cat</literal> を参照するので、別名を割り当てる必要があるでしょう。

source: This query assigns the alias <literal>cat</literal> to <literal>Cat</literal> instances, so we could use that alias later in the query. The <literal>as</literal> keyword is optional; we could also write:
fr_fr: Cette requête assigne l'alias <literal>cat</literal> à l'instance <literal>Cat</literal>, nous pouvons donc utiliser cet alias ailleurs dans la requête. Le mot clé <literal>as</literal> est optionnel ; nous aurions pu écrire :
ja_jp: このクエリでは <literal>Cat</literal> インスタンスに <literal>cat</literal> という別名を付けています。 そのため、後でこのクエリ内で、この別名を使うことができます。 <literal>as</literal> キーワードはオプションです。つまりこのように書くこともできます：

source: Multiple classes may appear, resulting in a cartesian product or "cross" join.
fr_fr: Plusieurs classes peuvent apparaître, ce qui conduira à un produit cartésien (encore appelé jointures croisées).
ja_jp: 直積、あるいはクロス結合によって多数のクラスが出現することもあります。

source: It is considered good practice to name query aliases using an initial lowercase, consistent with Java naming standards for local variables (eg. <literal>domesticCat</literal>).
fr_fr: C'est une bonne pratique que de nommer les alias dans les requêtes en utilisant l'initiale en miniscule, ce qui a le mérite d'être en phase avec les standards de nommage Java pour les variables locales (<literal>domesticCat</literal>).
ja_jp: ローカル変数のJavaのネーミング基準と一致した、 頭文字に小文字を使ったクエリの別名を付けることはいい習慣です(例えば <literal>domesticCat</literal> )。

source: Associations and joins
fr_fr: Associations et jointures
ja_jp: 関連と結合

source: We may also assign aliases to associated entities, or even to elements of a collection of values, using a <literal>join</literal>.
fr_fr: On peut aussi assigner des alias à des entités associées, ou même aux éléments d'une collection de valeurs, en utilisant un <literal>join</literal> (jointure).
ja_jp: 関連するエンティティあるいは値コレクションの要素にも、<literal>結合</literal> を使って別名を割り当てることが出来ます。

source: The supported join types are borrowed from ANSI SQL
fr_fr: Les types de jointures supportées sont celles de ANSI SQL
ja_jp: サポートしている結合のタイプはANSI SQLと同じです。

source: inner join
fr_fr: <literal>inner join</literal> (jointure fermée)

source: left outer join
fr_fr: <literal>left outer join</literal> (jointure ouverte par la gauche)

source: right outer join
fr_fr: <literal>right outer join</literal> (jointure ouverte par la droite)

source: <literal>full join</literal> (not usually useful)
fr_fr: <literal>full join</literal> (jointure ouverte totalement - généralement inutile)
ja_jp: <literal>full join</literal> (たいていの場合使いづらい)

source: The <literal>inner join</literal>, <literal>left outer join</literal> and <literal>right outer join</literal> constructs may be abbreviated.
fr_fr: Les constructions des jointures <literal>inner join</literal>, <literal>left outer join</literal> et <literal>right outer join</literal> peuvent être abbrégées.
ja_jp: <literal>inner join</literal>、<literal>left outer join</literal>、<literal>right outer join</literal>には省略形を使うこともできます。

source: You may supply extra join conditions using the HQL <literal>with</literal> keyword.
fr_fr: Nous pouvons soumettre des conditions de jointure supplémentaires en utilisant le mot-clef HQL <literal>with</literal>.
ja_jp: HQLの <literal>with</literal> キーワードを使うと、結合条件を付け加えることができます。

source: In addition, a "fetch" join allows associations or collections of values to be initialized along with their parent objects, using a single select. This is particularly useful in the case of a collection. It effectively overrides the outer join and lazy declarations of the mapping file for associations and collections. See <xref linkend="performance-fetching"/> for more information.
fr_fr: Par ailleurs, une jointure "fetchée" (rapportée) permet d'initialiser les associations ou collections de valeurs en même temps que leur objet parent, le tout n'utilisant qu'un seul Select. Ceci est particulièrement utile dans le cas des collections. Ce système permet de surcharger les déclarations "lazy" et "outer-join" des fichiers de mapping pour les associations et collections. Voir <xref linkend="performance-fetching"/> pour plus d'informations.
ja_jp: 加えて、「フェッチ」結合は関連や値のコレクションを親オブジェクトと一緒に1度のselect句で初期化します。 これは特にコレクションの場合に有用です。これは実質上、関連とコレクションに対するマッピング定義ファイルの外部結合とlazy初期化の定義を上書きすることになります。 <xref linkend="performance-fetching"/> により多くの情報があります。

source: A fetch join does not usually need to assign an alias, because the associated objects should not be used in the <literal>where</literal> clause (or any other clause). Also, the associated objects are not returned directly in the query results. Instead, they may be accessed via the parent object. The only reason we might need an alias is if we are recursively join fetching a further collection:
fr_fr: Une jointure "fetchée" (rapportée) n'a généralement pas besoin de se voir assigner un alias puisque les objets associés n'ont pas à être utilisés dans les autres clauses. Notez aussi que les objets associés ne sont pas retournés directement dans le résultat de la requête mais l'on peut y accéder via l'objet parent. La seule raison pour laquelle nous pourrions avoir besoin d'un alias est si nous récupérions récursivement une collection supplémentaire :
ja_jp: 結合によるフェッチは関連するオブジェクトが <literal>where</literal> 節(または他のどんな節でも) で使われてはならないので、通常別名を割り当てる必要がありません。また関連オブジェクトは問い合わせ結果として 直接返されません。代わりに親オブジェクトを通してアクセスできます。 コレクションを再帰的に結合フェッチする場合のみ、別名が必要になります。

source: Note that the <literal>fetch</literal> construct may not be used in queries called using <literal>iterate()</literal> (though <literal>scroll()</literal> can be used). Nor should <literal>fetch</literal> be used together with <literal>setMaxResults()</literal> or <literal>setFirstResult()</literal> as these operations are based on the result rows, which usually contain duplicates for eager collection fetching, hence, the number of rows is not what you'd expect. Nor may <literal>fetch</literal> be used together with an ad hoc <literal>with</literal> condition. It is possible to create a cartesian product by join fetching more than one collection in a query, so take care in this case. Join fetching multiple collection roles also sometimes gives unexpected results for bag mappings, so be careful about how you formulate your queries in this case. Finally, note that <literal>full join fetch</literal> and <literal>right join fetch</literal> are not meaningful.
fr_fr: Notez que la construction de <literal>fetch</literal> ne peut pas être utilisée dans les requêtes appelées par <literal>scroll()</literal> ou <literal>iterate()</literal>. <literal>fetch</literal> ne devrait pas non plus être utilisé avec <literal>setMaxResults()</literal> ou <literal>setFirstResult()</literal>. <literal>fetch</literal> ne peut pas non plus être utilisé avec une condition <literal>with</literal> ad hoc. Il est possible de créer un produit cartésien par jointure en récupérant plus d'une collection dans une requête, donc faites attention dans ce cas. Récupérer par jointure de multiples collections donne aussi parfois des résultats inattendus pour des mappings de bag, donc soyez prudent lorsque vous formulez vos requêtes dans de tels cas. Finalement, notez que <literal>full join fetch</literal> et <literal>right join fetch</literal> ne sont pas utiles en général.
ja_jp: <literal>fetch</literal> 構文は <literal>iterate()</literal> を使ったクエリ呼び出しで使用できないことに注意してください （一方で <literal>scroll()</literal> は使用できます）。 また、これらの操作は結果の行に基づいているため、 <literal>fetch</literal> は <literal>setMaxResults()</literal> や <literal>setFirstResult()</literal> と一緒に使用すべきではありません。 通常eagerなコレクションフェッチをすると重複が出てしまうため、あなたが期待するような行数にはならないのです。 そしてまた <literal>fetch</literal> は、アドホックな <literal>with</literal> 条件を 一緒に使うこともできません。 一つのクエリで複数のコレクションを結合フェッチすることにより直積を作成できるので、この場合注意してください。 また、複数のコレクションに対する結合フェッチはbagマッピングに対して予期せぬ結果をもたらすことがあるので、 この場合のクエリの作成には注意してください。 最後に <literal>全外部結合によるフェッチ</literal> と <literal>右外部結合によるフェッチ</literal> は有用ではないことに注意してください。

source: If you are using property-level lazy fetching (with bytecode instrumentation), it is possible to force Hibernate to fetch the lazy properties immediately (in the first query) using <literal>fetch all properties</literal>.
fr_fr: Si vous utilisez un chargement retardé pour les propriétés (avec une instrumentation par bytecode), il est possible de forcer Hibernate à récupérer les propriétés non encore chargées immédiatement (dans la première requête) en utilisant <literal>fetch all properties</literal>.
ja_jp: もしプロパティレベルの遅延フェッチを使う場合（内部的にバイトコード処理をする場合）、 <literal>fetch all properties</literal> を使うことで Hibernateに遅延プロパティを速やかに（最初のクエリで）フェッチさせることができます。

source: Forms of join syntax
fr_fr: Formes de syntaxes pour les jointures
ja_jp: 結合構文の形式

source: HQL supports two forms of association joining: <literal>implicit</literal> and <literal>explicit</literal>.
fr_fr: HQL supporte deux formes pour joindre les associations: <literal>implicite</literal> et <literal>explicite</literal>.
ja_jp: HQLは２つの関連結合形式をサポートします：<literal>暗黙的</literal> と <literal>明示的</literal>。

source: The queries shown in the previous section all use the <literal>explicit</literal> form where the join keyword is explicitly used in the from clause. This is the recommended form.
fr_fr: Les requêtes présentes dans la section précédente utilisent la forme <literal>explicite</literal> où le mode clé join est explicitement utilisé dans la clause from. C'est la forme recommandée.
ja_jp: これまでのセクションでお見せした使い方はすべて <literal>明示的な</literal> 形式で、 from節で明示的にjoinキーワードを使っています。 この形式をおすすめします。

source: The <literal>implicit</literal> form does not use the join keyword. Instead, the associations are "dereferenced" using dot-notation. <literal>implicit</literal> joins can appear in any of the HQL clauses. <literal>implicit</literal> join result in inner joins in the resulting SQL statement.
fr_fr: La forme <literal>implicite</literal> n'utilise pas le mot clé join. A la place, les associations sont "déréférencées" en utilisant le notation '.'. Ces jointures peuvent apparaitre dans toutes les clauses. Les jointures <literal>implicites</literal> résultent en des inner join dans le SQL généré.
ja_jp: <literal>暗黙的</literal> フォームは、joinキーワードを使いません。代わりに、参照する関連に ドット表記を使います。<literal>暗黙的</literal> 結合は、さまざまなHQLに出てきます。 <literal>暗黙的</literal> 結合の結果は、SQLステートメントの内部結合結果です。

source: Refering to identifier property
fr_fr: La clause select
ja_jp: Select節

source: There are, generally speaking, 2 ways to refer to an entity's identifier property:
fr_fr: La clause <literal>select</literal> sélectionne les objets et propriétés qui doivent être retournés dans le résultat de la requête. Soit :
ja_jp: <literal>select</literal> 節は以下のようにどのオブジェクトと属性をクエリリザルトセットに返すかを選択します。:

source: The special property (lowercase) <literal>id</literal> may be used to reference the identifier property of an entity <emphasis>provided that entity does not define a non-identifier property named id</emphasis>.
fr_fr: <![CDATA[select mate from Cat as cat inner join cat.mate as mate]]>
ja_jp: <![CDATA[select mate from Cat as cat inner join cat.mate as mate]]>

source: If the entity defines a named identifier property, you may use that property name.
fr_fr: La requête recherchera les <literal>mate</literal>s liés aux <literal>Cat</literal>s. Vous pouvez explimer la requête d'une manière plus compacte :
ja_jp: 上記のクエリは他の <literal>Cat</literal> の <literal>mate</literal> を選択します。 実際には次のように、より簡潔に表現できます。:

source: References to composite identifier properties follow the same naming rules. If the entity has a non-identifier property named id, the composite identifier property can only be referenced by its defined named; otherwise, the special <literal>id</literal> property can be used to rerference the identifier property.
fr_fr: <![CDATA[select cat.mate from Cat cat]]>
ja_jp: <![CDATA[select cat.mate from Cat cat]]>

source: Note: this has changed significantly starting in version 3.2.2. In previous versions, <literal>id</literal> <emphasis>always</emphasis> referred to the identifier property no matter what its actual name. A ramification of that decision was that non-identifier properties named <literal>id</literal> could never be referenced in Hibernate queries.
fr_fr: Les requêtes peuvent retourner des propriétés de n'importe quel type, même celles de type composant (component) :
ja_jp: クエリはコンポーネント型のプロパティを含む、あらゆる値型のプロパティも返せます。:

source: The select clause
fr_fr: <![CDATA[select cat.name from DomesticCat cat where cat.name like 'fri%']]>
ja_jp: <![CDATA[select cat.name from DomesticCat cat where cat.name like 'fri%']]>

source: The <literal>select</literal> clause picks which objects and properties to return in the query result set. Consider:
fr_fr: <![CDATA[select cust.name.firstName from Customer as cust]]>
ja_jp: <![CDATA[select cust.name.firstName from Customer as cust]]>

source: <![CDATA[select mate from Cat as cat inner join cat.mate as mate]]>
fr_fr: Les requêtes peuvent retourner plusieurs objets et/ou propriétés sous la forme d'un tableau du type <literal>Object[]</literal>,
ja_jp: クエリは複数のオブジェクトと(または)プロパティを <literal>Object[]</literal> 型の配列として返せます。

source: The query will select <literal>mate</literal>s of other <literal>Cat</literal>s. Actually, you may express this query more compactly as:
fr_fr: <![CDATA[select mother, offspr, mate.name from DomesticCat as mother inner join mother.mate as mate left outer join mother.kittens as offspr]]>
ja_jp: <![CDATA[select mother, offspr, mate.name from DomesticCat as mother inner join mother.mate as mate left outer join mother.kittens as offspr]]>

source: <![CDATA[select cat.mate from Cat cat]]>
fr_fr: ou sous la forme d'une <literal>List</literal>,
ja_jp: もしくは <literal>List</literal> として、

source: Queries may return properties of any value type including properties of component type:
fr_fr: <![CDATA[select new list(mother, offspr, mate.name) from DomesticCat as mother inner join mother.mate as mate left outer join mother.kittens as offspr]]>
ja_jp: <![CDATA[select new list(mother, offspr, mate.name) from DomesticCat as mother inner join mother.mate as mate left outer join mother.kittens as offspr]]>

source: <![CDATA[select cat.name from DomesticCat cat where cat.name like 'fri%']]>
fr_fr: ou sous la forme d'un objet Java typé,
ja_jp: または、タイプセーフなJavaオブジェクトを返せます。

source: <![CDATA[select cust.name.firstName from Customer as cust]]>
fr_fr: <![CDATA[select new Family(mother, mate, offspr) from DomesticCat as mother join mother.mate as mate left join mother.kittens as offspr]]>
ja_jp: <![CDATA[select new Family(mother, mate, offspr) from DomesticCat as mother join mother.mate as mate left join mother.kittens as offspr]]>

source: Queries may return multiple objects and/or properties as an array of type <literal>Object[]</literal>,
fr_fr: à condition que la classe <literal>Family</literal> possède le constructeur approprié.
ja_jp: あるいは <literal>Family</literal> クラスが適切なコンストラクタを持っているとするならば、

source: <![CDATA[select mother, offspr, mate.name from DomesticCat as mother inner join mother.mate as mate left outer join mother.kittens as offspr]]>
fr_fr: Vous pouvez assigner des alias aux expressions sélectionnées en utilisant <literal>as</literal> :
ja_jp: select節に <literal>as</literal> を使って別名をつけることもできます。

source: or as a <literal>List</literal>,
fr_fr: <![CDATA[select max(bodyWeight) as max, min(bodyWeight) as min, count(*) as n from Cat cat]]>
ja_jp: <![CDATA[select max(bodyWeight) as max, min(bodyWeight) as min, count(*) as n from Cat cat]]>

source: <![CDATA[select new list(mother, offspr, mate.name) from DomesticCat as mother inner join mother.mate as mate left outer join mother.kittens as offspr]]>
fr_fr: C'est surtout utile lorsque c'est utilisé avec <literal>select new map</literal> :
ja_jp: <literal>select new map</literal> と一緒に使うときに最も役立ちます：

source: or as an actual typesafe Java object,
fr_fr: <![CDATA[select new map( max(bodyWeight) as max, min(bodyWeight) as min, count(*) as n ) from Cat cat]]>
ja_jp: <![CDATA[select new map( max(bodyWeight) as max, min(bodyWeight) as min, count(*) as n ) from Cat cat]]>

source: <![CDATA[select new Family(mother, mate, offspr) from DomesticCat as mother join mother.mate as mate left join mother.kittens as offspr]]>
fr_fr: Cette requête retourne une <literal>Map</literal> à partir des alias vers les valeurs sélectionnées.
ja_jp: このクエリは別名からselectした値へ <literal>Map</literal> を返します。

source: assuming that the class <literal>Family</literal> has an appropriate constructor.
fr_fr: Fonctions d'aggrégation
ja_jp: 集約関数

source: You may assign aliases to selected expressions using <literal>as</literal>:
fr_fr: Les requêtes HQL peuvent aussi retourner le résultat de fonctions d'aggrégation sur les propriétés :
ja_jp: HQLのクエリはプロパティの集約関数の結果も返せます：

source: <![CDATA[select max(bodyWeight) as max, min(bodyWeight) as min, count(*) as n from Cat cat]]>
fr_fr: <![CDATA[select avg(cat.weight), sum(cat.weight), max(cat.weight), count(cat) from Cat cat]]>
ja_jp: <![CDATA[select avg(cat.weight), sum(cat.weight), max(cat.weight), count(cat) from Cat cat]]>

source: This is most useful when used together with <literal>select new map</literal>:
fr_fr: Les fonctions supportées sont
ja_jp: サポートしている集約関数は以下のものです。

source: <![CDATA[select new map( max(bodyWeight) as max, min(bodyWeight) as min, count(*) as n ) from Cat cat]]>
fr_fr: avg(...), sum(...), min(...), max(...)
ja_jp: avg(...), sum(...), min(...), max(...)

source: This query returns a <literal>Map</literal> from aliases to selected values.
fr_fr: count(*)
ja_jp: count(*)

source: Aggregate functions
fr_fr: count(...), count(distinct ...), count(all...)
ja_jp: count(...), count(distinct ...), count(all...)

source: HQL queries may even return the results of aggregate functions on properties:
fr_fr: Vous pouvez utiliser des opérateurs arithmétiques, la concaténation, et des fonctions SQL reconnues dans la clause select :
ja_jp: select節において算術操作、連結と承認されたSQL関数を使うことができます。

source: <![CDATA[select avg(cat.weight), sum(cat.weight), max(cat.weight), count(cat) from Cat cat]]>
fr_fr: <![CDATA[select cat.weight + sum(kitten.weight) from Cat cat join cat.kittens kitten group by cat.id, cat.weight]]>
ja_jp: <![CDATA[select cat.weight + sum(kitten.weight) from Cat cat join cat.kittens kitten group by cat.id, cat.weight]]>

source: The supported aggregate functions are
fr_fr: <![CDATA[select firstName||' '||initial||' '||upper(lastName) from Person]]>
ja_jp: <![CDATA[select firstName||' '||initial||' '||upper(lastName) from Person]]>

source: avg(...), sum(...), min(...), max(...)
fr_fr: Les mots clé <literal>distinct</literal> et <literal>all</literal> peuvent être utilisés et ont la même signification qu'en SQL.
ja_jp: SQLと同じ意味を持つ <literal>distinct</literal> と <literal>all</literal> キーワードを使うことができます。

source: count(*)
fr_fr: <![CDATA[select distinct cat.name from Cat cat select count(distinct cat.name), count(cat) from Cat cat]]>
ja_jp: <![CDATA[select distinct cat.name from Cat cat select count(distinct cat.name), count(cat) from Cat cat]]>

source: count(...), count(distinct ...), count(all...)
fr_fr: Requêtes polymorphiques
ja_jp: ポリモーフィックなクエリ

source: You may use arithmetic operators, concatenation, and recognized SQL functions in the select clause:
fr_fr: Une requête comme:
ja_jp: 次のようなクエリ：

source: <![CDATA[select cat.weight + sum(kitten.weight) from Cat cat join cat.kittens kitten group by cat.id, cat.weight]]>
fr_fr: <![CDATA[from Cat as cat]]>
ja_jp: <![CDATA[from Cat as cat]]>

source: <![CDATA[select firstName||' '||initial||' '||upper(lastName) from Person]]>
fr_fr: retourne non seuleument les instances de <literal>Cat</literal>, mais aussi celles des sous classes comme <literal>DomesticCat</literal>. Les requêtes Hibernate peuvent nommer n'importe quelle classe ou interface Java dans la clause <literal>from</literal>. La requête retournera les instances de toutes les classes persistantes qui étendent cette classe ou implémente cette interface. La requête suivante retournera tous les objets persistants :
ja_jp: <literal>Cat</literal> インスタンスだけではなく、<literal>DomesticCat</literal> のようなサブクラスも返されます。Hibernateクエリは <emphasis>どんな</emphasis> Javaクラスやインターフェイスも <literal>from</literal> 節に入れることができます。 クエリはそのクラスを拡張した、もしくはインターフェイスを実装した全ての永続クラスを返します。 次のクエリは永続オブジェクトをすべて返します:
