Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/query_hql.po
Languages: fr_fr, ja_jp

source: <![CDATA[select order.id, sum(price.amount), count(item) from Order as order join order.lineItems as item join item.product as product, Catalog as catalog join catalog.prices as price where order.paid = false and order.customer = :customer and price.product = product and catalog = :currentCatalog group by order having sum(price.amount) > :minAmount order by sum(price.amount) desc]]>
fr_fr: Quel monstre ! En principe, nous ne sommes pas très fan des sous-requêtes, la requête ressemblait donc plutôt à cela :
ja_jp: 何て巨大なクエリなのでしょう! 普段私は副問い合わせをあまり使いません。したがって私のクエリは実際には以下のようになります。:

source: The next query counts the number of payments in each status, excluding all payments in the <literal>AWAITING_APPROVAL</literal> status where the most recent status change was made by the current user. It translates to an SQL query with two inner joins and a correlated subselect against the <literal>PAYMENT</literal>, <literal>PAYMENT_STATUS</literal> and <literal>PAYMENT_STATUS_CHANGE</literal> tables.
fr_fr: <![CDATA[select order.id, sum(price.amount), count(item) from Order as order join order.lineItems as item join item.product as product, Catalog as catalog join catalog.prices as price where order.paid = false and order.customer = :customer and price.product = product and catalog = :currentCatalog group by order having sum(price.amount) > :minAmount order by sum(price.amount) desc]]>
ja_jp: <![CDATA[select order.id, sum(price.amount), count(item) from Order as order join order.lineItems as item join item.product as product, Catalog as catalog join catalog.prices as price where order.paid = false and order.customer = :customer and price.product = product and catalog = :currentCatalog group by order having sum(price.amount) > :minAmount order by sum(price.amount) desc]]>

source: <![CDATA[select count(payment), status.name from Payment as payment join payment.currentStatus as status join payment.statusChanges as statusChange where payment.status.name <> PaymentStatus.AWAITING_APPROVAL or ( statusChange.timeStamp = ( select max(change.timeStamp) from PaymentStatusChange change where change.payment = payment ) and statusChange.user <> :currentUser ) group by status.name, status.sortOrder order by status.sortOrder]]>
fr_fr: La requête suivante compte le nombre de paiements (payments) pour chaque status, en excluant les paiements dans le status <literal>AWAITING_APPROVAL</literal> où le changement de status le plus récent à été fait par l'utilisateur courant. En SQL, cette requête effectue deux jointures internes et des sous requêtes corrélées sur les tables <literal>PAYMENT</literal>, <literal>PAYMENT_STATUS</literal> et <literal>PAYMENT_STATUS_CHANGE</literal>.
ja_jp: 次のクエリは各ステータスの支払い数を数えます。ただしすべての支払いが現在の利用者による 最新のステータス変更である <literal>AWAITING_APPROVAL</literal> である場合を除きます。 このクエリは2つの内部結合と <literal>PAYMENT</literal>, <literal>PAYMENT_STATUS</literal> および <literal>PAYMENT_STATUS_CHANGE</literal> テーブルに対する関連副問い合わせを備えたSQLクエリに変換されます。

source: If I would have mapped the <literal>statusChanges</literal> collection as a list, instead of a set, the query would have been much simpler to write.
fr_fr: <![CDATA[select count(payment), status.name from Payment as payment join payment.currentStatus as status join payment.statusChanges as statusChange where payment.status.name <> PaymentStatus.AWAITING_APPROVAL or ( statusChange.timeStamp = ( select max(change.timeStamp) from PaymentStatusChange change where change.payment = payment ) and statusChange.user <> :currentUser ) group by status.name, status.sortOrder order by status.sortOrder]]>
ja_jp: <![CDATA[select count(payment), status.name from Payment as payment join payment.currentStatus as status join payment.statusChanges as statusChange where payment.status.name <> PaymentStatus.AWAITING_APPROVAL or ( statusChange.timeStamp = ( select max(change.timeStamp) from PaymentStatusChange change where change.payment = payment ) and statusChange.user <> :currentUser ) group by status.name, status.sortOrder order by status.sortOrder]]>

source: <![CDATA[select count(payment), status.name from Payment as payment join payment.currentStatus as status where payment.status.name <> PaymentStatus.AWAITING_APPROVAL or payment.statusChanges[ maxIndex(payment.statusChanges) ].user <> :currentUser group by status.name, status.sortOrder order by status.sortOrder]]>
fr_fr: Si nous avions mappé la collection <literal>statusChanges</literal> comme une liste, au lieu d'un ensemble, la requête aurait été plus facile à écrire.
ja_jp: もし私がsetの代わりにlistとして <literal>statusChanges</literal> コレクションを マッピングしたならば、はるかに簡単にクエリを記述できるでしょう。

source: The next query uses the MS SQL Server <literal>isNull()</literal> function to return all the accounts and unpaid payments for the organization to which the current user belongs. It translates to an SQL query with three inner joins, an outer join and a subselect against the <literal>ACCOUNT</literal>, <literal>PAYMENT</literal>, <literal>PAYMENT_STATUS</literal>, <literal>ACCOUNT_TYPE</literal>, <literal>ORGANIZATION</literal> and <literal>ORG_USER</literal> tables.
fr_fr: <![CDATA[select count(payment), status.name from Payment as payment join payment.currentStatus as status where payment.status.name <> PaymentStatus.AWAITING_APPROVAL or payment.statusChanges[ maxIndex(payment.statusChanges) ].user <> :currentUser group by status.name, status.sortOrder order by status.sortOrder]]>
ja_jp: <![CDATA[select count(payment), status.name from Payment as payment join payment.currentStatus as status where payment.status.name <> PaymentStatus.AWAITING_APPROVAL or payment.statusChanges[ maxIndex(payment.statusChanges) ].user <> :currentUser group by status.name, status.sortOrder order by status.sortOrder]]>

source: <![CDATA[select account, payment from Account as account left outer join account.payments as payment where :currentUser in elements(account.holder.users) and PaymentStatus.UNPAID = isNull(payment.currentStatus.name, PaymentStatus.UNPAID) order by account.type.sortOrder, account.accountNumber, payment.dueDate]]>
fr_fr: La requête qui suit utilise la fonction de MS SQL <literal>isNull()</literal> pour retourner tous les comptes (accounts) et paiements (payments) impayés pour l'organisation à laquelle l'uilisateur (user) courant appartient. Elle est traduite en SQL par trois jointures internes, une jointure externe ainsi qu'une sous requête sur les tables <literal>ACCOUNT</literal>, <literal>PAYMENT</literal>, <literal>PAYMENT_STATUS</literal>, <literal>ACCOUNT_TYPE</literal>, <literal>ORGANIZATION</literal> et <literal>ORG_USER</literal>.
ja_jp: 次のクエリは現在のユーザが所属する組織に対するアカウントおよび未払いの支払いを すべて返すMS SQL Server の <literal>isNull()</literal> 関数を使用しています。 このクエリは3つの内部結合と1つの外部結合 、 そして <literal>ACCOUNT</literal>, <literal>PAYMENT</literal>, <literal>PAYMENT_STATUS</literal>, <literal>ACCOUNT_TYPE</literal>, <literal>ORGANIZATION</literal> および <literal>ORG_USER</literal> テーブルに対する副問い合わせ持ったSQLに変換されます。

source: For some databases, we would need to do away with the (correlated) subselect.
fr_fr: <![CDATA[select account, payment from Account as account left outer join account.payments as payment where :currentUser in elements(account.holder.users) and PaymentStatus.UNPAID = isNull(payment.currentStatus.name, PaymentStatus.UNPAID) order by account.type.sortOrder, account.accountNumber, payment.dueDate]]>
ja_jp: <![CDATA[select account, payment from Account as account left outer join account.payments as payment where :currentUser in elements(account.holder.users) and PaymentStatus.UNPAID = isNull(payment.currentStatus.name, PaymentStatus.UNPAID) order by account.type.sortOrder, account.accountNumber, payment.dueDate]]>

source: <![CDATA[select account, payment from Account as account join account.holder.users as user left outer join account.payments as payment where :currentUser = user and PaymentStatus.UNPAID = isNull(payment.currentStatus.name, PaymentStatus.UNPAID) order by account.type.sortOrder, account.accountNumber, payment.dueDate]]>
fr_fr: Pour d'autres base de données, nous aurions dû faire sans la sous-requête (corrélée).
ja_jp: いくつかのデータベースについては、(関連させられた)副問い合わせの使用を避ける必要があるでしょう。

source: Bulk update and delete
fr_fr: <![CDATA[select account, payment from Account as account join account.holder.users as user left outer join account.payments as payment where :currentUser = user and PaymentStatus.UNPAID = isNull(payment.currentStatus.name, PaymentStatus.UNPAID) order by account.type.sortOrder, account.accountNumber, payment.dueDate]]>
ja_jp: <![CDATA[select account, payment from Account as account join account.holder.users as user left outer join account.payments as payment where :currentUser = user and PaymentStatus.UNPAID = isNull(payment.currentStatus.name, PaymentStatus.UNPAID) order by account.type.sortOrder, account.accountNumber, payment.dueDate]]>

source: HQL now supports <literal>update</literal>, <literal>delete</literal> and <literal>insert ... select ...</literal> statements. See <xref linkend="batch-direct"/> for details.
fr_fr: Mise à jour et suppression
ja_jp: 大量のUPDATEとDELETE

source: Tips &amp; Tricks
fr_fr: HQL supporte maintenant les expressions <literal>update</literal>, <literal>delete</literal> et <literal>insert ... select ...</literal>. Voir <xref linkend="batch-direct"/> pour les détails.
ja_jp: HQLは今は <literal>update</literal> と <literal>delete</literal>、<literal>insert ... select ...</literal> ステートメントをHQLに入れることをサポートしています。 <xref linkend="batch-direct"/> に詳細があります。

source: You can count the number of query results without actually returning them:
fr_fr: Trucs &amp; Astuces
ja_jp: Tips &amp; Tricks

source: <![CDATA[( (Integer) session.createQuery("select count(*) from ....").iterate().next() ).intValue()]]>
fr_fr: Vous pouvez compter le nombre de résultats d'une requête sans les retourner :
ja_jp: 実際に結果を返さなくてもクエリの結果数を数えることができます。:

source: To order a result by the size of a collection, use the following query:
fr_fr: <![CDATA[( (Integer) session.createQuery("select count(*) from ....").iterate().next() ).intValue()]]>
ja_jp: <![CDATA[( (Integer) session.createQuery("select count(*) from ....").iterate().next() ).intValue()]]>

source: <![CDATA[select usr.id, usr.name from User as usr left join usr.messages as msg group by usr.id, usr.name order by count(msg)]]>
fr_fr: Pour trier les résultats par la taille d'une collection, utilisez la requête suivante :
ja_jp: コレクションのサイズにより結果を並べ替えるためには以下のクエリを使用します。:

source: If your database supports subselects, you can place a condition upon selection size in the where clause of your query:
fr_fr: <![CDATA[select usr.id, usr.name from User as usr left join usr.messages as msg group by usr.id, usr.name order by count(msg)]]>
ja_jp: <![CDATA[select usr.id, usr.name from User as usr left join usr.messages as msg group by usr.id, usr.name order by count(msg)]]>

source: <![CDATA[from User usr where size(usr.messages) >= 1]]>
fr_fr: Si votre base de données supporte les sous-requêtes, vous pouvez placer des conditions sur la taille de la sélection dans la clause where de votre requête:
ja_jp: 使用しているデータベースがサブセレクトをサポートする場合、クエリのwhere節でサイズによる選択条件を設定できます:

source: If your database doesn't support subselects, use the following query:
fr_fr: <![CDATA[from User usr where size(usr.messages) >= 1]]>
ja_jp: <![CDATA[from User usr where size(usr.messages) >= 1]]>

source: <![CDATA[select usr.id, usr.name from User usr.name join usr.messages msg group by usr.id, usr.name having count(msg) >= 1]]>
fr_fr: Si votre base de données ne supporte pas les sous-requêtes, utilisez la requête suivante :
ja_jp: 使用しているデータベースがサブセレクトをサポートしない場合は、次のクエリを使用してください:

source: As this solution can't return a <literal>User</literal> with zero messages because of the inner join, the following form is also useful:
fr_fr: <![CDATA[select usr.id, usr.name from User usr.name join usr.messages msg group by usr.id, usr.name having count(msg) >= 1]]>
ja_jp: <![CDATA[select usr.id, usr.name from User usr.name join usr.messages msg group by usr.id, usr.name having count(msg) >= 1]]>

source: <![CDATA[select usr.id, usr.name from User as usr left join usr.messages as msg group by usr.id, usr.name having count(msg) = 0]]>
fr_fr: Cette solution ne peut pas retourner un <literal>User</literal> avec zéro message à cause de la jointure interne, la forme suivante peut donc être utile :
ja_jp: 内部結合をしているせいで上の解決法がmessageの件数が ゼロの <literal>User</literal> を返すことができないならば、以下の形式が使えます。

source: Properties of a JavaBean can be bound to named query parameters:
fr_fr: <![CDATA[select usr.id, usr.name from User as usr left join usr.messages as msg group by usr.id, usr.name having count(msg) = 0]]>
ja_jp: <![CDATA[select usr.id, usr.name from User as usr left join usr.messages as msg group by usr.id, usr.name having count(msg) = 0]]>

source: <![CDATA[Query q = s.createQuery("from foo Foo as foo where foo.name=:name and foo.size=:size"); q.setProperties(fooBean); // fooBean has getName() and getSize() List foos = q.list();]]>
fr_fr: Les propriétés d'un JavaBean peuvent être injectées dans les paramètres nommés d'un requête :
ja_jp: JavaBeanのプロパティは、名前付きのクエリパラメータに結びつけることが出来ます。：

source: Collections are pageable by using the <literal>Query</literal> interface with a filter:
fr_fr: <![CDATA[Query q = s.createQuery("from foo Foo as foo where foo.name=:name and foo.size=:size"); q.setProperties(fooBean); // fooBean has getName() and getSize() List foos = q.list();]]>
ja_jp: <![CDATA[Query q = s.createQuery("from foo Foo as foo where foo.name=:name and foo.size=:size"); q.setProperties(fooBean); // fooBean has getName() and getSize() List foos = q.list();]]>

source: <![CDATA[Query q = s.createFilter( collection, "" ); // the trivial filter q.setMaxResults(PAGE_SIZE); q.setFirstResult(PAGE_SIZE * pageNumber); List page = q.list();]]>
fr_fr: Les collections sont paginables via l'utilisation de l'interface <literal>Query</literal> avec un filtre :
ja_jp: コレクションはフィルタ付き <literal>Query</literal> インターフェイスを使用することでページをつけることができます。:

source: Collection elements may be ordered or grouped using a query filter:
fr_fr: <![CDATA[Query q = s.createFilter( collection, "" ); // the trivial filter q.setMaxResults(PAGE_SIZE); q.setFirstResult(PAGE_SIZE * pageNumber); List page = q.list();]]>
ja_jp: <![CDATA[Query q = s.createFilter( collection, "" ); // the trivial filter q.setMaxResults(PAGE_SIZE); q.setFirstResult(PAGE_SIZE * pageNumber); List page = q.list();]]>

source: <![CDATA[Collection orderedCollection = s.filter( collection, "order by this.amount" ); Collection counts = s.filter( collection, "select this.type, count(this) group by this.type" );]]>
fr_fr: Les éléments d'une collection peuvent être triés ou groupés en utilisant un filtre de requête :
ja_jp: コレクションの要素はクエリフィルタを使って、並べ替えやグループ分けが出来ます。:

source: You can find the size of a collection without initializing it:
fr_fr: <![CDATA[Collection orderedCollection = s.filter( collection, "order by this.amount" ); Collection counts = s.filter( collection, "select this.type, count(this) group by this.type" );]]>
ja_jp: <![CDATA[Collection orderedCollection = s.filter( collection, "order by this.amount" ); Collection counts = s.filter( collection, "select this.type, count(this) group by this.type" );]]>

source: <![CDATA[( (Integer) session.createQuery("select count(*) from ....").iterate().next() ).intValue();]]>
fr_fr: Vous pouvez récupérer la taille d'une collection sans l'initialiser :
ja_jp: コレクションを初期化せずにコレクションのサイズを得ることができます。:

source: Components
fr_fr: <![CDATA[( (Integer) session.createQuery("select count(*) from ....").iterate().next() ).intValue();]]>
ja_jp: <![CDATA[( (Integer) session.createQuery("select count(*) from ....").iterate().next() ).intValue();]]>

source: ROLES_OF_TRANSLATORS
fr_fr: <!--TRANS:ROLES_OF_TRANSLATORS-->
ja_jp: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
fr_fr: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
ja_jp: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
