Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/query_criteria.po
Languages: fr_fr, ja_jp

source: Criteria Queries
fr_fr: Requêtes par critères
ja_jp: Criteriaクエリ

source: Hibernate features an intuitive, extensible criteria query API.
fr_fr: Hibernate offre une API d'interrogation par critères intuitive et extensible.
ja_jp: Hibernateには、直感的で拡張可能なcriteriaクエリAPIが用意されています。

source: Creating a <literal>Criteria</literal> instance
fr_fr: Créer une instance de <literal>Criteria</literal>
ja_jp: <literal>Criteria</literal> インスタンスの作成

source: The interface <literal>org.hibernate.Criteria</literal> represents a query against a particular persistent class. The <literal>Session</literal> is a factory for <literal>Criteria</literal> instances.
fr_fr: L'interface <literal>net.sf.hibernate.Criteria</literal> représente une requête sur une classe persistente donnée. La <literal>Session</literal> fournit les instances de <literal>Criteria</literal>.
ja_jp: <literal>org.hibernate.Criteria</literal> インターフェイスは特定の永続性クラスに対するクエリを表現します。 <literal>Session</literal> は <literal>Criteria</literal> インスタンスのファクトリです。

source: Narrowing the result set
fr_fr: Restriction du résultat
ja_jp: リザルトセットの絞込み

source: An individual query criterion is an instance of the interface <literal>org.hibernate.criterion.Criterion</literal>. The class <literal>org.hibernate.criterion.Restrictions</literal> defines factory methods for obtaining certain built-in <literal>Criterion</literal> types.
fr_fr: Un criterion (critère de recherche) est une instance de l'interface <literal>org.hibernate.criterion.Criterion</literal>. La classe <literal>org.hibernate.criterion.Restrictions</literal> définit des méthodes pour obtenir des types de <literal>Criterion</literal> pré-définis.
ja_jp: <literal>org.hibernate.criterion.Criterion</literal> インターフェイスのインスタンスは、 個別のクエリクライテリオン（問い合わせの判定基準）を表します。 <literal>org.hibernate.criterion.Restrictions</literal> クラスは、ある組み込みの <literal>Criterion</literal> 型を取得するためのファクトリメソッドを持っています。

source: Restrictions may be grouped logically.
fr_fr: Les restrictions peuvent être goupées de manière logique.
ja_jp: Restriction（限定）は、論理的にグループ化できます。

source: There are quite a range of built-in criterion types (<literal>Restrictions</literal> subclasses), but one that is especially useful lets you specify SQL directly.
fr_fr: Il y a plusieurs types de criterion pré-définis (sous classes de <literal>Restriction</literal>), mais l'une d'entre elle particulièrement utile vous permet de spécifier directement du SQL.
ja_jp: 元々あるCriterion型（<literal>Restrictions</literal> のサブクラス） はかなりの範囲に及びますが、特に有用なのはSQLを直接指定できるものです。

source: <![CDATA[List cats = sess.createCriteria(Cat.class) .add( Restrictions.sqlRestriction("lower({alias}.name) like lower(?)", "Fritz%", Hibernate.STRING) ) .list();]]>
fr_fr: <![CDATA[List cats = sess.createCriteria(Cat.class) .add( Restrictions.sql("lower({alias}.name) like lower(?)", "Fritz%", Hibernate.STRING) ) .list();]]>

source: The <literal>{alias}</literal> placeholder with be replaced by the row alias of the queried entity.
fr_fr: La zone <literal>{alias}</literal> sera remplacée par l'alias de colonne de l'entité que l'on souhaite intérroger.
ja_jp: <literal>{alias}</literal> というプレースホルダは、 問い合わせを受けたエンティティの行の別名によって置き換えられます。

source: An alternative approach to obtaining a criterion is to get it from a <literal>Property</literal> instance. You can create a <literal>Property</literal> by calling <literal>Property.forName()</literal>.
fr_fr: Une autre approche pour obtenir un criterion est de le récupérer d'une instance de <literal>Property</literal>. Vous pouvez créer une <literal>Property</literal> en appelant <literal>Property.forName()</literal>.
ja_jp: criterionを得る別の手段は、 <literal>Property</literal> インスタンスから取得することです。 <literal>Property.forName()</literal> を呼び出して、 <literal>Property</literal> インスタンスを作成できます。

source: Ordering the results
fr_fr: Trier les résultats
ja_jp: 結果の整列

source: You may order the results using <literal>org.hibernate.criterion.Order</literal>.
fr_fr: Vous pouvez trier les résultats en utilisant <literal>org.hibernate.criterion.Order</literal>.
ja_jp: <literal>org.hibernate.criterion.Order</literal> を使って結果を並び替えることができます。

source: You may easily specify constraints upon related entities by navigating associations using <literal>createCriteria()</literal>.
fr_fr: Vous pouvez facilement spécifier des contraintes sur des entités liées, par des associations en utilisant <literal>createCriteria()</literal>.
ja_jp: <literal>createCriteria()</literal> を使い、関連をナビゲートすることで、 容易に関係するエンティティに制約を指定できます。

source: note that the second <literal>createCriteria()</literal> returns a new instance of <literal>Criteria</literal>, which refers to the elements of the <literal>kittens</literal> collection.
fr_fr: Notez que la seconde <literal>createCriteria()</literal> retourne une nouvelle instance de <literal>Criteria</literal>, qui se rapporte aux éléments de la collection <literal>kittens</literal>.
ja_jp: 2番目の <literal>createCriteria()</literal> は、<literal>kittens</literal> コレクションの要素を参照する新しい <literal>Criteria</literal> インスタンスを返すことに注意してください。

source: The following, alternate form is useful in certain circumstances.
fr_fr: La forme alternative suivante est utile dans certains cas.
ja_jp: 以下のような方法も、状況により有用です。

source: (<literal>createAlias()</literal> does not create a new instance of <literal>Criteria</literal>.)
fr_fr: (<literal>createAlias()</literal> ne crée pas de nouvelle instance de <literal>Criteria</literal>.)
ja_jp: （<literal>createAlias()</literal> は新しい <literal>Criteria</literal> インスタンスを作成しません。）

source: Note that the kittens collections held by the <literal>Cat</literal> instances returned by the previous two queries are <emphasis>not</emphasis> pre-filtered by the criteria! If you wish to retrieve just the kittens that match the criteria, you must use a <literal>ResultTransformer</literal>.
fr_fr: Notez que les collections kittens contenues dans les instances de <literal>Cat</literal> retournées par les deux précédentes requêtes ne sont <emphasis>pas</emphasis> pré-filtrées par les critères ! Si vous souhaitez récupérer uniquement les kittens qui correspondent à la criteria, vous devez utiliser <literal>ResultTransformer</literal>.
ja_jp: 前の2つのクエリによって返される <literal>Cat</literal> インスタンスによって保持されるkittensコレクションは、 criteriaによって事前にフィルタリング <emphasis>されない</emphasis> ことに注意してください。 もしcriteriaに適合するkittenを取得したいなら、 <literal>ResultTransformer</literal> を使わなければなりません。

source: Dynamic association fetching
fr_fr: Peuplement d'associations de manière dynamique
ja_jp: 関連の動的フェッチ

source: You may specify association fetching semantics at runtime using <literal>setFetchMode()</literal>.
fr_fr: Vous pouvez spéficier au moment de l'exécution le peuplement d'une association en utilisant <literal>setFetchMode()</literal> (c'est-à-dire le chargement de celle-ci). Cela permet de surcharger les valeurs "lazy" et "outer-join" du mapping.
ja_jp: <literal>setFetchMode()</literal> を使い、 実行時に関連の復元方法を指定してもよいです。

source: This query will fetch both <literal>mate</literal> and <literal>kittens</literal> by outer join. See <xref linkend="performance-fetching"/> for more information.
fr_fr: Cette requête recherchera <literal>mate</literal> et <literal>kittens</literal> via les jointures externes. Voir <xref linkend="performance-fetching"/> pour plus d'informations.
ja_jp: このクエリは外部結合により <literal>mate</literal> と <literal>kittens</literal> の両方をフェッチします。 より多くの情報は <xref linkend="performance-fetching"/> を参照してください。

source: Example queries
fr_fr: Requêtes par l'exemple
ja_jp: クエリの例

source: The class <literal>org.hibernate.criterion.Example</literal> allows you to construct a query criterion from a given instance.
fr_fr: La classe <literal>org.hibernate.criterion.Example</literal> vous permet de construire un critère suivant une instance d'objet donnée.
ja_jp: <literal>org.hibernate.criterion.Example</literal> クラスは、 与えられたインスタンスからクエリクライテリオンを構築できます。

source: Version properties, identifiers and associations are ignored. By default, null valued properties are excluded.
fr_fr: Les propriétés de type version, identifiant et association sont ignorées. Par défaut, les valeurs null sont exclues.
ja_jp: バージョンプロパティ、識別子、関連は無視されます。 デフォルトではnull値のプロパティは除外されます。

source: You can adjust how the <literal>Example</literal> is applied.
fr_fr: Vous pouvez ajuster la stratégie d'utilisation de valeurs de l'<literal>Exemple</literal>.
ja_jp: どのように <literal>Example</literal> を適用するか 調整することができます。

source: You can even use examples to place criteria upon associated objects.
fr_fr: Vous pouvez utiliser les "exemples" pour des critères sur les objets associés.
ja_jp: 関連オブジェクトにcriteriaを指定するために、Exampleを使うことも可能です。

source: Projections, aggregation and grouping
fr_fr: Projections, agrégation et regroupement
ja_jp: 射影、集約、グループ化

source: The class <literal>org.hibernate.criterion.Projections</literal> is a factory for <literal>Projection</literal> instances. We apply a projection to a query by calling <literal>setProjection()</literal>.
fr_fr: La classe <literal>org.hibernate.criterion.Projections</literal> est une fabrique d'instances de <literal>Projection</literal>. Nous appliquons une projection sur une requête en appelant <literal>setProjection()</literal>.
ja_jp: <literal>org.hibernate.criterion.Projections</literal> クラスは <literal>Projection</literal> インスタンスのファクトリです。 <literal>setProjection()</literal> を呼び出すことで、 クエリに射影を適用します。

source: There is no explicit "group by" necessary in a criteria query. Certain projection types are defined to be <emphasis>grouping projections</emphasis>, which also appear in the SQL <literal>group by</literal> clause.
fr_fr: Il n'y a pas besoin de "group by" explicite dans une requête par critère. Certains types de projection sont définis pour être des <emphasis>projections de regroupement</emphasis>, lesquels apparaissent aussi dans la clause <literal>group by</literal> SQL.
ja_jp: 必要であっても、criteriaクエリに「group by」を明示する必要はありません。 ある種のProjection型は <emphasis>グループ化射影</emphasis> として定義され、 SQLの <literal>group by</literal> 節にも現れます。

source: An alias may optionally be assigned to a projection, so that the projected value may be referred to in restrictions or orderings. Here are two different ways to do this:
fr_fr: Un alias peut optionnellement être assigné à une projection, ainsi la valeur projetée peut être référencée dans des restrictions ou des tris. Voici deux façons différentes de faire ça :
ja_jp: 任意で射影に別名を付けられるため、射影される値はrestrictionやordering内から参照できます。 別名をつける２つの異なる方法を示します。

source: The <literal>alias()</literal> and <literal>as()</literal> methods simply wrap a projection instance in another, aliased, instance of <literal>Projection</literal>. As a shortcut, you can assign an alias when you add the projection to a projection list:
fr_fr: Les méthodes <literal>alias()</literal> et <literal>as()</literal> enveloppe simplement une instance de projection dans une autre instance (aliasée) de <literal>Projection</literal>. Comme un raccourci, vous pouvez assignez un alias lorsque vous ajoutez la projection à la liste de projections :
ja_jp: <literal>alias()</literal> と <literal>as()</literal> メソッドは、 Projectionインスタンスを別の名前の <literal>Projection</literal> インスタンスで ラップするだけです。 ショートカットとして、射影を射影リストに追加する際に、別名をつけられます。

source: You can also use <literal>Property.forName()</literal> to express projections:
fr_fr: Vous pouvez aussi utiliser <literal>Property.forName()</literal> pour formuler des projections :
ja_jp: 射影の式に <literal>Property.forName()</literal> も使用できます。

source: Detached queries and subqueries
fr_fr: Requêtes et sous-requêtes détachées
ja_jp: クエリおよびサブクエリの分離

source: The <literal>DetachedCriteria</literal> class lets you create a query outside the scope of a session, and then later execute it using some arbitrary <literal>Session</literal>.
fr_fr: La classe <literal>DetachedCriteria</literal> vous laisse créer une requête en dehors de la portée de la session, et puis l'exécuter plus tard en utilisant n'importe quelle <literal>Session</literal> arbitraire.
ja_jp: <literal>DetachedCriteria</literal> クラスにより、 セッションスコープ外にクエリを作成できます。 後で、任意の <literal>Session</literal> を使って、実行できます。

source: A <literal>DetachedCriteria</literal> may also be used to express a subquery. Criterion instances involving subqueries may be obtained via <literal>Subqueries</literal> or <literal>Property</literal>.
fr_fr: Une <literal>DetachedCriteria</literal> peut aussi être utilisée pour exprimer une sous-requête. Des instances de criterion impliquant des sous-requêtes peuvent être obtenues via <literal>Subqueries</literal> ou <literal>Property</literal>.
ja_jp: <literal>DetachedCriteria</literal> は、サブクエリを表現するためにも使えます。 サブクエリを伴うCriterionインスタンスは、 <literal>Subqueries</literal> もしくは <literal>Property</literal> から得られます。

source: Even correlated subqueries are possible:
fr_fr: Même des requêtes corrélées sont possibles :
ja_jp: 相互関係があるサブクエリでさえも可能です。

source: Queries by natural identifier
fr_fr: Requêtes par identifiant naturel
ja_jp: 自然識別子によるクエリ

source: For most queries, including criteria queries, the query cache is not very efficient, because query cache invalidation occurs too frequently. However, there is one special kind of query where we can optimize the cache invalidation algorithm: lookups by a constant natural key. In some applications, this kind of query occurs frequently. The criteria API provides special provision for this use case.
fr_fr: Pour la plupart des requêtes, incluant les requêtes par critère, le cache de requêtes n'est pas très efficace, parce que l'invalidation du cache de requêtes arrive trop souvent. Cependant, il y a une sorte spéciale de requête où nous pouvons optimiser l'algorithme d'invalidation du cache : les recherches sur une clef naturelle constante. Dans certaines applications, cette sorte de requête se produit fréquemment. L'API de critère fournit une provision spéciale pour ce cas d'utilisation.
ja_jp: criteriaクエリを含むたいていのクエリにとって、 クエリキャッシュはあまり効率がよくないです。 なぜなら、クエリキャッシュが頻繁に無効になるためです。 しかしながら、キャッシュを無効にするアルゴリズムを最適化できる 特別なクエリの種類が１つあります。 更新されない自然キーによる検索です。 いくつかのアプリケーションでは、この種類のクエリが頻繁に現れます。 このような使われ方のために、criteria APIは特別な対策を提供します。

source: First, you should map the natural key of your entity using <literal>&lt;natural-id&gt;</literal>, and enable use of the second-level cache.
fr_fr: D'abord vous devriez mapper la clef naturelle de votre entité en utilisant <literal>&lt;natural-id&gt;</literal>, et activer l'utilisation du cache de second niveau.
ja_jp: 最初に、<literal>&lt;natural-id&gt;</literal> を使って、 エンティティの自然キーをマップしてください。 そして、二次キャッシュを有効にします。

source: Note that this functionality is not intended for use with entities with <emphasis>mutable</emphasis> natural keys.
fr_fr: Notez que cette fonctionnalité n'est pas prévue pour l'utilisation avec des entités avec des clefs naturelles <emphasis>mutables</emphasis>.
ja_jp: 注意： <emphasis>変更される</emphasis> 自然キーを持つエンティティに この機能を使うのは、意図されていない使い方です。

source: Next, enable the Hibernate query cache.
fr_fr: Ensuite, activez le cache de requête d'Hibernate.
ja_jp: 次に、Hibernateクエリキャッシュを有効にします。

source: Now, <literal>Restrictions.naturalId()</literal> allows us to make use of the more efficient cache algorithm.
fr_fr: Maintenant <literal>Restrictions.naturalId()</literal> nous permet de rendre l'utilisation de l'algorithme de cache plus efficace.
ja_jp: これで、<literal>Restrictions.naturalId()</literal> により、 より効率的なキャッシュアルゴリズムを使用できます。

source: ROLES_OF_TRANSLATORS
fr_fr: <!--TRANS:ROLES_OF_TRANSLATORS-->
ja_jp: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
fr_fr: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
ja_jp: <!--TRANS:CREDIT_FOR_TRANSLATORS-->

source: Associations
ja_jp: <title>関連</title>
