Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/query_sql.po
Languages: fr_fr

source: Named SQL queries may be defined in the mapping document and called in exactly the same way as a named HQL query. In this case, we do <emphasis>not</emphasis> need to call <literal>addEntity()</literal>.
fr_fr: &lt;class name="Person"&gt; &lt;id name="id"&gt; &lt;generator class="increment"/&gt; &lt;/id&gt; &lt;property name="name" not-null="true"/&gt; &lt;sql-insert callable="true"&gt;{call createPerson (?, ?)}&lt;/sql-insert&gt; &lt;sql-delete callable="true"&gt;{? = call deletePerson (?)}&lt;/sql-delete&gt; &lt;sql-update callable="true"&gt;{? = call updatePerson (?, ?)}&lt;/sql-update&gt; &lt;/class&gt;

source: <![CDATA[<sql-query name="persons"> <return alias="person" class="eg.Person"/> SELECT person.NAME AS {person.name}, person.AGE AS {person.age}, person.SEX AS {person.sex} FROM PERSON person WHERE person.NAME LIKE :namePattern </sql-query>]]>
fr_fr: L'ordre des paramètres positionnels est actuellement vital, car ils doivent être dans la même séquence qu'Hibernate les attend.

source: <![CDATA[List people = sess.getNamedQuery("persons") .setString("namePattern", namePattern) .setMaxResults(50) .list();]]>
fr_fr: Vous pouvez voir l'ordre attendu en activant les journaux de debug pour le niveau <literal>org.hibernate.persister.entity</literal> level. Avec ce niveau activé, Hibernate imprimera le SQL statique qui est utilisé pour créer, mettre à jour, supprimer, etc. des entités. (Pour voir la séquence attendue, rappelez-vous de ne pas inclure votre SQL personnalisé dans les fichiers de mapping de manière à surcharger le SQL statique généré par Hibernate.)

source: The <literal>&lt;return-join&gt;</literal> and <literal>&lt;load-collection&gt;</literal> elements are used to join associations and define queries which initialize collections, respectively.
fr_fr: Les procédures stockées sont dans la plupart des cas (lire : il vaut mieux le faire) requises pour retourner le nombre de lignes insérées/mises à jour/supprimées, puisque Hibernate fait quelques vérifications de succès lors de l'exécution de l'expression. Hibernate inscrit toujours la première expression comme un paramètre de sortie numérique pour les opérations CUD :

source: <![CDATA[<sql-query name="personsWith"> <return alias="person" class="eg.Person"/> <return-join alias="address" property="person.mailingAddress"/> SELECT person.NAME AS {person.name}, person.AGE AS {person.age}, person.SEX AS {person.sex}, address.STREET AS {address.street}, address.CITY AS {address.city}, address.STATE AS {address.state}, address.ZIP AS {address.zip} FROM PERSON person JOIN ADDRESS address ON person.ID = address.PERSON_ID AND address.TYPE='MAILING' WHERE person.NAME LIKE :namePattern </sql-query>]]>
fr_fr: CREATE OR REPLACE FUNCTION updatePerson (uid IN NUMBER, uname IN VARCHAR2) RETURN NUMBER IS BEGIN update PERSON set NAME = uname, where ID = uid; return SQL%ROWCOUNT; END updatePerson;

source: A named SQL query may return a scalar value. You must declare the column alias and Hibernate type using the <literal>&lt;return-scalar&gt;</literal> element:
fr_fr: SQL personnalisé pour le chargement

source: <![CDATA[<sql-query name="mySqlQuery"> <return-scalar column="name" type="string"/> <return-scalar column="age" type="long"/> SELECT p.NAME AS name, p.AGE AS age, FROM PERSON p WHERE p.NAME LIKE 'Hiber%' </sql-query>]]>
fr_fr: Vous pouvez aussi déclarer vos propres requêtes SQL (ou HQL) pour le chargement d'entité :

source: You can externalize the resultset mapping informations in a <literal>&lt;resultset&gt;</literal> element to either reuse them accross several named queries or through the <literal>setResultSetMapping()</literal> API.
fr_fr: &lt;sql-query name="person"&gt; &lt;return alias="pers" class="Person" lock-mode="upgrade"/&gt; SELECT NAME AS {pers.name}, ID AS {pers.id} FROM PERSON WHERE ID=? FOR UPDATE &lt;/sql-query&gt;

source: <![CDATA[<resultset name="personAddress"> <return alias="person" class="eg.Person"/> <return-join alias="address" property="person.mailingAddress"/> </resultset> <sql-query name="personsWith" resultset-ref="personAddress"> SELECT person.NAME AS {person.name}, person.AGE AS {person.age}, person.SEX AS {person.sex}, address.STREET AS {address.street}, address.CITY AS {address.city}, address.STATE AS {address.state}, address.ZIP AS {address.zip} FROM PERSON person JOIN ADDRESS address ON person.ID = address.PERSON_ID AND address.TYPE='MAILING' WHERE person.NAME LIKE :namePattern </sql-query>]]>
fr_fr: Ceci est juste une déclaration de requête nommée, comme vu plus tôt. Vous pouvez référencer cette requête nommée dans un mapping de classe :

source: You can alternatively use the resultset mapping information in your hbm files directly in java code.
fr_fr: &lt;class name="Person"&gt; &lt;id name="id"&gt; &lt;generator class="increment"/&gt; &lt;/id&gt; &lt;property name="name" not-null="true"/&gt; &lt;loader query-ref="person"/&gt; &lt;/class&gt;

source: <![CDATA[List cats = sess.createSQLQuery( "select {cat.*}, {kitten.*} from cats cat, cats kitten where kitten.mother = cat.id" ) .setResultSetMapping("catAndKitten") .list();]]>
fr_fr: Ceci fonctionne même avec des procédures stockées.

source: Using return-property to explicitly specify column/alias names
fr_fr: Vous pouvez même définir une requête pour le chargement d'une collection :

source: With <literal>&lt;return-property&gt;</literal> you can explicitly tell Hibernate what column aliases to use, instead of using the <literal>{}</literal>-syntax to let Hibernate inject its own aliases.
fr_fr: &lt;set name="employments" inverse="true"&gt; &lt;key/&gt; &lt;one-to-many class="Employment"/&gt; &lt;loader query-ref="employments"/&gt; &lt;/set&gt;

source: <![CDATA[<sql-query name="mySqlQuery"> <return alias="person" class="eg.Person"> <return-property name="name" column="myName"/> <return-property name="age" column="myAge"/> <return-property name="sex" column="mySex"/> </return> SELECT person.NAME AS myName, person.AGE AS myAge, person.SEX AS mySex, FROM PERSON person WHERE person.NAME LIKE :name </sql-query> ]]>
fr_fr: &lt;sql-query name="employments"&gt; &lt;load-collection alias="emp" role="Person.employments"/&gt; SELECT {emp.*} FROM EMPLOYMENT emp WHERE EMPLOYER = :id ORDER BY STARTDATE ASC, EMPLOYEE ASC &lt;/sql-query&gt;

source: <literal>&lt;return-property&gt;</literal> also works with multiple columns. This solves a limitation with the <literal>{}</literal>-syntax which can not allow fine grained control of multi-column properties.
fr_fr: Vous pourriez même définir un chargeur d'entité qui charge une collection par jointure :

source: <![CDATA[<sql-query name="organizationCurrentEmployments"> <return alias="emp" class="Employment"> <return-property name="salary"> <return-column name="VALUE"/> <return-column name="CURRENCY"/> </return-property> <return-property name="endDate" column="myEndDate"/> </return> SELECT EMPLOYEE AS {emp.employee}, EMPLOYER AS {emp.employer}, STARTDATE AS {emp.startDate}, ENDDATE AS {emp.endDate}, REGIONCODE as {emp.regionCode}, EID AS {emp.id}, VALUE, CURRENCY FROM EMPLOYMENT WHERE EMPLOYER = :id AND ENDDATE IS NULL ORDER BY STARTDATE ASC </sql-query>]]>
fr_fr: &lt;sql-query name="person"&gt; &lt;return alias="pers" class="Person"/&gt; &lt;return-join alias="emp" property="pers.employments"/&gt; SELECT NAME AS {pers.*}, {emp.*} FROM PERSON pers LEFT OUTER JOIN EMPLOYMENT emp ON pers.ID = emp.PERSON_ID WHERE ID=? &lt;/sql-query&gt;

source: ROLES_OF_TRANSLATORS
fr_fr: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
fr_fr: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
