Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/query_hql.po
Languages: fr_fr, ja_jp

source: The <literal>distinct</literal> and <literal>all</literal> keywords may be used and have the same semantics as in SQL.
fr_fr: <![CDATA[from java.lang.Object o]]>
ja_jp: <![CDATA[from java.lang.Object o]]>

source: <![CDATA[select distinct cat.name from Cat cat select count(distinct cat.name), count(cat) from Cat cat]]>
fr_fr: L'interface <literal>Named</literal> peut être implémentée par plusieurs classes persistantes :
ja_jp: <literal>Named</literal> インターフェイスは様々な永続クラスによって実装されます。:

source: Polymorphic queries
fr_fr: <![CDATA[from Named n, Named m where n.name = m.name]]>
ja_jp: <![CDATA[from Named n, Named m where n.name = m.name]]>

source: A query like:
fr_fr: Notez que ces deux dernières requêtes nécessitent plus d'un <literal>SELECT</literal> SQL. Ce qui signifie que la clause <literal>order by</literal> ne trie pas correctement la totalité des résultats (cela signifie aussi que vous ne pouvez exécuter ces requêtes en appelant <literal>Query.scroll()</literal>).
ja_jp: 最後の二つのクエリは、二つ以上のSQL <literal>SELECT</literal> を要求していることに注意してください。 このことは <literal>order by</literal> 節がリザルトセット全体を正確には整列しないことを意味します (さらにそれは、<literal>Query.scroll()</literal> を使用してこれらのクエリを呼ぶことができないことを意味します。)。

source: returns instances not only of <literal>Cat</literal>, but also of subclasses like <literal>DomesticCat</literal>. Hibernate queries may name <emphasis>any</emphasis> Java class or interface in the <literal>from</literal> clause. The query will return instances of all persistent classes that extend that class or implement the interface. The following query would return all persistent objects:
fr_fr: La clause <literal>where</literal> vous permet de réduire la liste des instances retournées. Si aucun alias n'existe, vous pouvez vous référer aux propriétés par leur nom :
ja_jp: <literal>where</literal> 節は返されるインスタンスのリストを絞ることができます。 もし別名がない場合、名前でプロパティを参照します。

source: <![CDATA[from java.lang.Object o]]>
fr_fr: <![CDATA[from Cat where name='Fritz']]>
ja_jp: <![CDATA[from Cat where name='Fritz']]>

source: The interface <literal>Named</literal> might be implemented by various persistent classes:
fr_fr: S'il y a un alias, utilisez un nom de propriété qualifié :
ja_jp: もし別名がある場合、修飾名を使ってください。

source: <![CDATA[from Named n, Named m where n.name = m.name]]>
fr_fr: <![CDATA[from Cat as cat where cat.name='Fritz']]>
ja_jp: <![CDATA[from Cat as cat where cat.name='Fritz']]>

source: Note that these last two queries will require more than one SQL <literal>SELECT</literal>. This means that the <literal>order by</literal> clause does not correctly order the whole result set. (It also means you can't call these queries using <literal>Query.scroll()</literal>.)
fr_fr: retourne les instances de <literal>Cat</literal> dont name est égale à 'Fritz'.
ja_jp: 名前が'Fritz'という <literal>Cat</literal> のインスタンスを返します。

source: The where clause
fr_fr: <![CDATA[select foo from Foo foo, Bar bar where foo.startDate = bar.date]]>
ja_jp: <![CDATA[select foo from Foo foo, Bar bar where foo.startDate = bar.date]]>

source: The <literal>where</literal> clause allows you to narrow the list of instances returned. If no alias exists, you may refer to properties by name:
fr_fr: retournera les instances de <literal>Foo</literal> pour lesquelles il existe une instance de <literal>bar</literal> avec la propriété <literal>date</literal> est égale à la propriété <literal>startDate</literal> de <literal>Foo</literal>. Les expressions utilisant la navigation rendent la clause <literal>where</literal> extrêmement puissante. Soit :
ja_jp: 上のHQLは、<literal>Foo</literal> の <literal>startDate</literal> プロパティと等しい <literal>date</literal> プロパティを持った <literal>bar</literal> インスタンスが存在する、 すべての <literal>Foo</literal> インスタンスを返します。 コンパウンドパス式（例えば「cat.mate.name」）は <literal>where</literal> 節を非常に強力にします。注目：

source: <![CDATA[from Cat where name='Fritz']]>
fr_fr: <![CDATA[from Cat cat where cat.mate.name is not null]]>
ja_jp: <![CDATA[from Cat cat where cat.mate.name is not null]]>

source: If there is an alias, use a qualified property name:
fr_fr: Cette requête se traduit en SQL par une jointure interne à une table. Si vous souhaitez écrire quelque chose comme :
ja_jp: このクエリはテーブル結合（内部結合）を持つSQLクエリに変換されます。 その代わりに以下のように書くと、

source: <![CDATA[from Cat as cat where cat.name='Fritz']]>
fr_fr: <![CDATA[from Foo foo where foo.bar.baz.customer.address.city is not null]]>
ja_jp: <![CDATA[from Foo foo where foo.bar.baz.customer.address.city is not null]]>

source: returns instances of <literal>Cat</literal> named 'Fritz'.
fr_fr: vous finiriez avec une requête qui nécessiterait quatre jointures en SQL.
ja_jp: もし上のクエリを記述したらクエリ内に4つのテーブル結合を必要とするSQLクエリに変換されます。

source: <![CDATA[select foo from Foo foo, Bar bar where foo.startDate = bar.date]]>
fr_fr: L'opérateur <literal>=</literal> peut être utilisé pour comparer aussi bien des propriétés que des instances :
ja_jp: <literal>=</literal> 演算子は以下のように、プロパティだけでなくインスタンスを比較するためにも使われます。：

source: will return all instances of <literal>Foo</literal> for which there exists an instance of <literal>bar</literal> with a <literal>date</literal> property equal to the <literal>startDate</literal> property of the <literal>Foo</literal>. Compound path expressions make the <literal>where</literal> clause extremely powerful. Consider:
fr_fr: <![CDATA[from Cat cat, Cat rival where cat.mate = rival.mate]]>
ja_jp: <![CDATA[from Cat cat, Cat rival where cat.mate = rival.mate]]>

source: <![CDATA[from Cat cat where cat.mate.name is not null]]>
fr_fr: <![CDATA[select cat, mate from Cat cat, Cat mate where cat.mate = mate]]>
ja_jp: <![CDATA[select cat, mate from Cat cat, Cat mate where cat.mate = mate]]>

source: This query translates to an SQL query with a table (inner) join. If you were to write something like
fr_fr: La propriété spéciale (en minuscule) <literal>id</literal> peut être utilisée pour faire référence à l'identifiant d'un objet (vous pouvez aussi utiliser le nom de cette propriété).
ja_jp: <literal>id</literal> (小文字)は特別なプロパティであり、 オブジェクトのユニークな識別子を参照するために使用できます。(さらに、そのプロパティ名を使用できます。)

source: <![CDATA[from Foo foo where foo.bar.baz.customer.address.city is not null]]>
fr_fr: <![CDATA[from Cat as cat where cat.id = 123 from Cat as cat where cat.mate.id = 69]]>
ja_jp: <![CDATA[from Cat as cat where cat.id = 123 from Cat as cat where cat.mate.id = 69]]>

source: you would end up with a query that would require four table joins in SQL.
fr_fr: La seconde requête est particulièrement efficace. Aucune jointure n'est nécessaire !
ja_jp: 2番目のクエリは効率的です。テーブル結合が必要ありません！

source: The <literal>=</literal> operator may be used to compare not only properties, but also instances:
fr_fr: Les propriétés d'un identifiant composé peuvent aussi être utilisées. Supposez que <literal>Person</literal> ait un identifiant composé de <literal>country</literal> et <literal>medicareNumber</literal>.
ja_jp: また複合識別子のプロパティも使用できます。ここで <literal>Person</literal> が <literal>country</literal> と <literal>medicareNumber</literal> からなる複合識別子を持つと仮定します。

source: <![CDATA[from Cat cat, Cat rival where cat.mate = rival.mate]]>
fr_fr: <![CDATA[from bank.Person person where person.id.country = 'AU' and person.id.medicareNumber = 123456]]>
ja_jp: <![CDATA[from bank.Person person where person.id.country = 'AU' and person.id.medicareNumber = 123456]]>

source: <![CDATA[select cat, mate from Cat cat, Cat mate where cat.mate = mate]]>
fr_fr: <![CDATA[from bank.Account account where account.owner.id.country = 'AU' and account.owner.id.medicareNumber = 123456]]>
ja_jp: <![CDATA[from bank.Account account where account.owner.id.country = 'AU' and account.owner.id.medicareNumber = 123456]]>

source: The special property (lowercase) <literal>id</literal> may be used to reference the unique identifier of an object. See <xref linkend="queryhql-identifier-property"/> for more information.
fr_fr: Une fois de plus, la seconde requête ne nécessite pas de jointure.
ja_jp: もう一度言いますが、2番目のクエリにはテーブル結合が必要ありません。

source: <![CDATA[from Cat as cat where cat.id = 123 from Cat as cat where cat.mate.id = 69]]>
fr_fr: De même, la propriété spéciale <literal>class</literal> interroge la valeur discriminante d'une instance dans le cas d'une persistance polymorphique. Le nom d'une classe Java incorporée dans la clause where sera traduite par sa valeur discriminante.
ja_jp: 同様に <literal>class</literal> は特別なプロパティであり、 ポリモーフィックな永続化におけるインスタンスのdiscriminator値にアクセスします。 where節に埋め込まれたJavaのクラス名はそのdiscriminator値に変換されます。

source: The second query is efficient. No table join is required!
fr_fr: <![CDATA[from Cat cat where cat.class = DomesticCat]]>
ja_jp: <![CDATA[from Cat cat where cat.class = DomesticCat]]>

source: Properties of composite identifiers may also be used. Suppose <literal>Person</literal> has a composite identifier consisting of <literal>country</literal> and <literal>medicareNumber</literal>. Again, see <xref linkend="queryhql-identifier-property"/> for more information regarding referencing identifier properties.
fr_fr: Vous pouvez aussi spécifier les propriétés des composants ou types utilisateurs composés (components, composite user types etc). N'essayez jamais d'utiliser un expression de navigation qui se terminerait par une propriété de type composant (qui est différent d'une propriété d'un composant). Par exemple, si <literal>store.owner</literal> est une entité avec un composant <literal>address</literal>
ja_jp: またコンポーネントや複合ユーザ型(またそのコンポーネントのコンポーネントなど)のプロパティも指定できます。 しかし決して（コンポーネントのプロパティではなく）コンポーネント型のプロパティで終了するパス式を使わないでください。 例えばもし <literal>store.owner</literal> が <literal>address</literal> コンポーネントを持つエンティティならば以下のような結果となります。

source: <![CDATA[from bank.Person person where person.id.country = 'AU' and person.id.medicareNumber = 123456]]>
fr_fr: <![CDATA[store.owner.address.city // okay store.owner.address // error!]]>
ja_jp: <![CDATA[store.owner.address.city // okay store.owner.address // error!]]>

source: <![CDATA[from bank.Account account where account.owner.id.country = 'AU' and account.owner.id.medicareNumber = 123456]]>
fr_fr: Un type "any" possède les propriétés spéciales <literal>id</literal> et <literal>class</literal>, qui nous permettent d'exprimer une jointure de la manière suivante (où <literal>AuditLog.item</literal> est une propriété mappée avec <literal>&lt;any&gt;</literal>).
ja_jp: "any"型は特別なプロパティである <literal>id</literal> と <literal>class</literal> を持ち、 以下の方法で結合を表現することを可能にします(<literal>AuditLog.item</literal> は <literal>&lt;any&gt;</literal> でマッピングされたプロパティです)。

source: Once again, the second query requires no table join.
fr_fr: <![CDATA[from AuditLog log, Payment payment where log.item.class = 'Payment' and log.item.id = payment.id]]>
ja_jp: <![CDATA[from AuditLog log, Payment payment where log.item.class = 'Payment' and log.item.id = payment.id]]>

source: Likewise, the special property <literal>class</literal> accesses the discriminator value of an instance in the case of polymorphic persistence. A Java class name embedded in the where clause will be translated to its discriminator value.
fr_fr: Dans la requête précédente, notez que <literal>log.item.class</literal> et <literal>payment.class</literal> feraient référence à des valeurs de colonnes de la base de données complètement différentes.
ja_jp: <literal>log.item.class</literal> と <literal>payment.class</literal> が 上記のクエリ中で全く異なるデータベースカラムの値を参照するということに注意してください。

source: <![CDATA[from Cat cat where cat.class = DomesticCat]]>
fr_fr: Expressions
ja_jp: Expressions 式

source: You may also use components or composite user types, or properties of said component types. See <xref linkend="queryhql-coomponents"/> for more details.
fr_fr: Les expressions permises dans la clause <literal>where</literal> incluent la plupart des choses que vous pouvez utiliser en SQL :
ja_jp: SQLの <literal>where</literal> 節で記述することが出来る式のほとんどをHQLでも記述できます。:

source: An "any" type has the special properties <literal>id</literal> and <literal>class</literal>, allowing us to express a join in the following way (where <literal>AuditLog.item</literal> is a property mapped with <literal>&lt;any&gt;</literal>).
fr_fr: opérateurs mathématiques <literal>+, -, *, /</literal>
ja_jp: 算術演算子：<literal>+, -, *, /</literal>

source: <![CDATA[from AuditLog log, Payment payment where log.item.class = 'Payment' and log.item.id = payment.id]]>
fr_fr: opérateur de comparaison binaire <literal>=, &gt;=, &lt;=, &lt;&gt;, !=, like</literal>
ja_jp: 2項比較演算子：<literal>=, &gt;=, &lt;=, &lt;&gt;, !=, like</literal>

source: Notice that <literal>log.item.class</literal> and <literal>payment.class</literal> would refer to the values of completely different database columns in the above query.
fr_fr: opérateurs logiques <literal>and, or, not</literal>
ja_jp: 論理演算子：<literal>and, or, not</literal>

source: Expressions
fr_fr: Parenthèses <literal>( )</literal>, indiquant un regroupement
ja_jp: グループ分けを表す括弧：<literal>( )</literal>

source: Expressions allowed in the <literal>where</literal> clause include most of the kind of things you could write in SQL:
fr_fr: <literal>in</literal>, <literal>not in</literal>, <literal>between</literal>, <literal>is null</literal>, <literal>is not null</literal>, <literal>is empty</literal>, <literal>is not empty</literal>, <literal>member of</literal> and <literal>not member of</literal>
ja_jp: <literal>in</literal>, <literal>not in</literal>, <literal>between</literal>, <literal>is null</literal>, <literal>is not null</literal>, <literal>is empty</literal>, <literal>is not empty</literal>, <literal>member of</literal> and <literal>not member of</literal>

source: mathematical operators <literal>+, -, *, /</literal>
fr_fr: "Simple" case, <literal>case ... when ... then ... else ... end</literal>, and "searched" case, <literal>case when ... then ... else ... end</literal>
ja_jp: "シンプル"なcase <literal>case ... when ... then ... else ... end</literal>、 "探索的"なcase <literal>case when ... then ... else ... end</literal>

source: binary comparison operators <literal>=, &gt;=, &lt;=, &lt;&gt;, !=, like</literal>
fr_fr: concatenation de chaîne de caractères <literal>...||...</literal> ou <literal>concat(...,...)</literal>
ja_jp: ストリングの連結 <literal>...||...</literal> または <literal>concat(...,...)</literal>

source: logical operations <literal>and, or, not</literal>
fr_fr: <literal>current_date()</literal>, <literal>current_time()</literal>, <literal>current_timestamp()</literal>
ja_jp: <literal>current_date()</literal>, <literal>current_time()</literal>, <literal>current_timestamp()</literal>

source: Parentheses <literal>( )</literal>, indicating grouping
fr_fr: <literal>second(...)</literal>, <literal>minute(...)</literal>, <literal>hour(...)</literal>, <literal>day(...)</literal>, <literal>month(...)</literal>, <literal>year(...)</literal>,
ja_jp: <literal>second(...)</literal>, <literal>minute(...)</literal>, <literal>hour(...)</literal>, <literal>day(...)</literal>, <literal>month(...)</literal>, <literal>year(...)</literal>,

source: <literal>in</literal>, <literal>not in</literal>, <literal>between</literal>, <literal>is null</literal>, <literal>is not null</literal>, <literal>is empty</literal>, <literal>is not empty</literal>, <literal>member of</literal> and <literal>not member of</literal>
fr_fr: N'importe quel fonction ou opérateur défini par EJB-QL 3.0 : <literal>substring(), trim(), lower(), upper(), length(), locate(), abs(), sqrt(), bit_length(), mod()</literal>
ja_jp: EJB-QL 3.0で定義されている関数や演算子: <literal>substring(), trim(), lower(), upper(), length(), locate(), abs(), sqrt(), bit_length()</literal>

source: "Simple" case, <literal>case ... when ... then ... else ... end</literal>, and "searched" case, <literal>case when ... then ... else ... end</literal>
fr_fr: <literal>coalesce()</literal> et <literal>nullif()</literal>
ja_jp: <literal>coalesce()</literal> と <literal>nullif()</literal>

source: string concatenation <literal>...||...</literal> or <literal>concat(...,...)</literal>
fr_fr: <literal>str()</literal> pour convertir des valeurs numériques ou temporelles vers une chaîne de caractères lisible
ja_jp: 数字や時間の値をStringにコンバートする <literal>str()</literal>）

source: <literal>current_date()</literal>, <literal>current_time()</literal>, <literal>current_timestamp()</literal>
fr_fr: <literal>cast(... as ...)</literal>, où le second argument est le nom d'un type Hibernate, et <literal>extract(... from ...)</literal> si le <literal>cast()</literal> ANSI et <literal>extract()</literal> sont supportés par la base de données sous-jacente
ja_jp: 2番目の引数がHibernate型の名前である <literal>cast(... as ...)</literal> と <literal>extract(... from ...)</literal>。 ただし使用するデータベースがANSI <literal>cast()</literal> と <literal>extract()</literal> をサポートする場合に限ります。

source: <literal>second(...)</literal>, <literal>minute(...)</literal>, <literal>hour(...)</literal>, <literal>day(...)</literal>, <literal>month(...)</literal>, <literal>year(...)</literal>,
fr_fr: La fonction HQL <literal>index()</literal>, qui s'applique aux alias d'une collection indexée jointe
ja_jp: 結合したインデックス付きのコレクションの別名に適用されるHQLの <literal>index()</literal> 関数。

source: Any function or operator defined by EJB-QL 3.0: <literal>substring(), trim(), lower(), upper(), length(), locate(), abs(), sqrt(), bit_length(), mod()</literal>
fr_fr: Les fonctions HQL qui s'appliquent expressions représentant des collections : <literal>size(), minelement(), maxelement(), minindex(), maxindex()</literal>, ainsi que les fonctions spéciales <literal>elements()</literal> et <literal>indices</literal> qui peuvent être quantifiées en utilisant <literal>some, all, exists, any, in</literal>.
ja_jp: コレクション値のパス式を取るHQL関数： <literal>size(), minelement(), maxelement(), minindex(), maxindex()</literal> 。 <literal>some, all, exists, any, in</literal> を使って修飾することができる特別な <literal>elements()</literal> と <literal>indices</literal> 関数と一緒に使います。

source: <literal>coalesce()</literal> and <literal>nullif()</literal>
fr_fr: N'importe quelle fonction scalaire supportée par la base de données comme <literal>sign()</literal>, <literal>trunc()</literal>, <literal>rtrim()</literal>, <literal>sin()</literal>
ja_jp: <literal>sign()</literal>, <literal>trunc()</literal>, <literal>rtrim()</literal>, <literal>sin()</literal> のようなデータベースがサポートするSQLスカラ関数。

source: <literal>str()</literal> for converting numeric or temporal values to a readable string
fr_fr: Les paramètres positionnels de JDBC <literal>?</literal>
ja_jp: JDBCスタイルの位置パラメータ <literal>?</literal>

source: <literal>cast(... as ...)</literal>, where the second argument is the name of a Hibernate type, and <literal>extract(... from ...)</literal> if ANSI <literal>cast()</literal> and <literal>extract()</literal> is supported by the underlying database
fr_fr: paramètres nommés <literal>:name</literal>, <literal>:start_date</literal>, <literal>:x1</literal>
ja_jp: 名前付きパラメータ: <literal>:name</literal>, <literal>:start_date</literal>, <literal>:x1</literal>

source: the HQL <literal>index()</literal> function, that applies to aliases of a joined indexed collection
fr_fr: littéral SQL <literal>'foo'</literal>, <literal>69</literal>, <literal>'1970-01-01 10:00:01.0'</literal>
ja_jp: SQLリテラル：<literal>'foo'</literal>, <literal>69</literal>, <literal>6.66E+2</literal>, <literal>'1970-01-01 10:00:01.0'</literal>

source: HQL functions that take collection-valued path expressions: <literal>size(), minelement(), maxelement(), minindex(), maxindex()</literal>, along with the special <literal>elements()</literal> and <literal>indices</literal> functions which may be quantified using <literal>some, all, exists, any, in</literal>.
fr_fr: Constantes Java <literal>public static final</literal> <literal>eg.Color.TABBY</literal>
ja_jp: Javaの <literal>public static final</literal> 定数：<literal>eg.Color.TABBY</literal>

source: Any database-supported SQL scalar function like <literal>sign()</literal>, <literal>trunc()</literal>, <literal>rtrim()</literal>, <literal>sin()</literal>
fr_fr: <literal>in</literal> et <literal>between</literal> peuvent être utilisés comme suit :
ja_jp: <literal>in</literal> と <literal>between</literal> は以下のように使用できます。:

source: JDBC-style positional parameters <literal>?</literal>
fr_fr: <![CDATA[from DomesticCat cat where cat.name between 'A' and 'B']]>
ja_jp: <![CDATA[from DomesticCat cat where cat.name between 'A' and 'B']]>

source: named parameters <literal>:name</literal>, <literal>:start_date</literal>, <literal>:x1</literal>
fr_fr: <![CDATA[from DomesticCat cat where cat.name in ( 'Foo', 'Bar', 'Baz' )]]>
ja_jp: <![CDATA[from DomesticCat cat where cat.name in ( 'Foo', 'Bar', 'Baz' )]]>

source: SQL literals <literal>'foo'</literal>, <literal>69</literal>, <literal>6.66E+2</literal>, <literal>'1970-01-01 10:00:01.0'</literal>
fr_fr: et la forme négative peut être écrite
ja_jp: また、否定形で記述することもできます。

source: Java <literal>public static final</literal> constants <literal>eg.Color.TABBY</literal>
fr_fr: <![CDATA[from DomesticCat cat where cat.name not between 'A' and 'B']]>
ja_jp: <![CDATA[from DomesticCat cat where cat.name not between 'A' and 'B']]>

source: <literal>in</literal> and <literal>between</literal> may be used as follows:
fr_fr: <![CDATA[from DomesticCat cat where cat.name not in ( 'Foo', 'Bar', 'Baz' )]]>
ja_jp: <![CDATA[from DomesticCat cat where cat.name not in ( 'Foo', 'Bar', 'Baz' )]]>

source: <![CDATA[from DomesticCat cat where cat.name between 'A' and 'B']]>
fr_fr: De même, <literal>is null</literal> et <literal>is not null</literal> peuvent être utilisés pour tester les valeurs nulle.
ja_jp: 同様に <literal>is null</literal> や <literal>is not null</literal> はnull値をテストするために使用できます。

source: <![CDATA[from DomesticCat cat where cat.name in ( 'Foo', 'Bar', 'Baz' )]]>
fr_fr: Les booléens peuvent être facilement utilisés en déclarant les substitutions de requêtes dans la configuration Hibernate :
ja_jp: Hibernate設定ファイルでHQL query substitutionsを定義すれば、boolean値を式の中で簡単に使用できま。：

source: and the negated forms may be written
fr_fr: <![CDATA[<property name="hibernate.query.substitutions">true 1, false 0</property>]]>
ja_jp: <![CDATA[<property name="hibernate.query.substitutions">true 1, false 0</property>]]>

source: <![CDATA[from DomesticCat cat where cat.name not between 'A' and 'B']]>
fr_fr: Ce qui remplacera les mots clés <literal>true</literal> et <literal>false</literal> par <literal>1</literal> et <literal>0</literal> dans la traduction SQL du HQL suivant :
ja_jp: こうすることで下記のHQLをSQLに変換するときに <literal>true</literal> , <literal>false</literal> キーワードは <literal>1</literal> , <literal>0</literal> に置き換えられます。:

source: <![CDATA[from DomesticCat cat where cat.name not in ( 'Foo', 'Bar', 'Baz' )]]>
fr_fr: <![CDATA[from Cat cat where cat.alive = true]]>
ja_jp: <![CDATA[from Cat cat where cat.alive = true]]>

source: Likewise, <literal>is null</literal> and <literal>is not null</literal> may be used to test for null values.
fr_fr: Vous pouvez tester la taille d'une collection par la propriété spéciale <literal>size</literal>, ou la fonction spéciale <literal>size()</literal>.
ja_jp: 特別なプロパティ <literal>size</literal>、または特別な関数 <literal>size()</literal> を使ってコレクションのサイズをテストできます。:

source: Booleans may be easily used in expressions by declaring HQL query substitutions in Hibernate configuration:
fr_fr: <![CDATA[from Cat cat where cat.kittens.size > 0]]>
ja_jp: <![CDATA[from Cat cat where cat.kittens.size > 0]]>

source: <![CDATA[<property name="hibernate.query.substitutions">true 1, false 0</property>]]>
fr_fr: <![CDATA[from Cat cat where size(cat.kittens) > 0]]>
ja_jp: <![CDATA[from Cat cat where size(cat.kittens) > 0]]>
