Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/query_sql.po
Languages: fr_fr

source: Native SQL
fr_fr: SQL natif

source: You may also express queries in the native SQL dialect of your database. This is useful if you want to utilize database specific features such as query hints or the <literal>CONNECT</literal> keyword in Oracle. It also provides a clean migration path from a direct SQL/JDBC based application to Hibernate.
fr_fr: Vous pouvez aussi écrire vos requêtes dans le dialecte SQL natif de votre base de données. Ceci est utile si vous souhaitez utiliser les fonctionnalités spécifiques de votre base de données comme le mot clé <literal>CONNECT</literal> d'Oracle. Cette fonctionnalité offre par ailleurs un moyen de migration plus propre et doux d'une application basée sur SQL/JDBC vers une application Hibernate.

source: Hibernate3 allows you to specify handwritten SQL (including stored procedures) for all create, update, delete, and load operations.
fr_fr: Hibernate3 vous permet de spécifier du SQL écrit à la main (incluant les procédures stockées) pour toutes les opérations de création, mise à jour, suppression et chargement.

source: Using a <literal>SQLQuery</literal>
fr_fr: Utiliser une <literal>SQLQuery</literal>

source: Execution of native SQL queries is controlled via the <literal>SQLQuery</literal> interface, which is obtained by calling <literal>Session.createSQLQuery()</literal>. The following describes how to use this API for querying.
fr_fr: L'exécution des requêtes en SQL natif est contrôlée par l'interface <literal>SQLQuery</literal>, laquelle est obtenue en appelant <literal>Session.createSQLQuery()</literal>. Dans des cas extrêmement simples, nous pouvons utiliser la forme suivante :

source: Scalar queries
fr_fr: List cats = sess.createSQLQuery("select * from cats") .addEntity(Cat.class) .list();

source: The most basic SQL query is to get a list of scalars (values).
fr_fr: Cette requête a spécifié :

source: <![CDATA[sess.createSQLQuery("SELECT * FROM CATS").list(); sess.createSQLQuery("SELECT ID, NAME, BIRTHDATE FROM CATS").list(); ]]>
fr_fr: la requête SQL

source: These will both return a List of Object arrays (Object[]) with scalar values for each column in the CATS table. Hibernate will use ResultSetMetadata to deduce the actual order and types of the returned scalar values.
fr_fr: l'entité retournée par la requête

source: To avoid the overhead of using <literal>ResultSetMetadata</literal> or simply to be more explicit in what is returned one can use <literal>addScalar()</literal>.
fr_fr: Ici, les noms de colonne des résultats sont supposés être les mêmes que les noms de colonne spécifiés dans le document de mapping. Cela peut être problématique pour des requêtes SQL qui joignent de multiple tables, puisque les mêmes noms de colonne peuvent apparaître dans plus d'une table. La forme suivante n'est pas vulnérable à la duplication des noms de colonne :

source: <![CDATA[sess.createSQLQuery("SELECT * FROM CATS") .addScalar("ID", Hibernate.LONG) .addScalar("NAME", Hibernate.STRING) .addScalar("BIRTHDATE", Hibernate.DATE) ]]>
fr_fr: List cats = sess.createSQLQuery("select {cat.*} from cats cat") .addEntity("cat", Cat.class) .list();

source: This query specified:
fr_fr: Cette requête a spécifié :

source: the SQL query string
fr_fr: la requête SQL, avec un paramètre fictif pour Hibernate pour injecter les alias de colonne

source: the columns and types to return
fr_fr: l'entité retournée par la requête, et son alias de table SQL

source: This will still return Object arrays, but now it will not use <literal>ResultSetMetdata</literal> but will instead explicitly get the ID, NAME and BIRTHDATE column as respectively a Long, String and a Short from the underlying resultset. This also means that only these three columns will be returned, even though the query is using <literal>*</literal> and could return more than the three listed columns.
fr_fr: La méthode <literal>addEntity()</literal> associe l'alias de la table SQL avec la classe de l'entité retournée, et détermine la forme de l'ensemble des résultats de la requête.

source: It is possible to leave out the type information for all or some of the scalars.
fr_fr: La méthode <literal>addJoin()</literal> peut être utilisée pour charger des associations vers d'autres entités et collections.

source: <![CDATA[sess.createSQLQuery("SELECT * FROM CATS") .addScalar("ID", Hibernate.LONG) .addScalar("NAME") .addScalar("BIRTHDATE") ]]>
fr_fr: List cats = sess.createSQLQuery( "select {cat.*}, {kitten.*} from cats cat, cats kitten where kitten.mother = cat.id" ) .addEntity("cat", Cat.class) .addJoin("kitten", "cat.kittens") .list();

source: This is essentially the same query as before, but now <literal>ResultSetMetaData</literal> is used to decide the type of NAME and BIRTHDATE where as the type of ID is explicitly specified.
fr_fr: Une requête SQL native pourrait retourner une simple valeur scalaire ou une combinaison de scalaires et d'entités.

source: How the java.sql.Types returned from ResultSetMetaData is mapped to Hibernate types is controlled by the Dialect. If a specific type is not mapped or does not result in the expected type it is possible to customize it via calls to <literal>registerHibernateType</literal> in the Dialect.
fr_fr: Double max = (Double) sess.createSQLQuery("select max(cat.weight) as maxWeight from cats cat") .addScalar("maxWeight", Hibernate.DOUBLE); .uniqueResult();

source: Entity queries
fr_fr: Vous pouvez alternativement décrire les informations de mapping des résultats dans vos fichiers hbm et les utiliser pour vos requêtes.

source: The above queries were all about returning scalar values, basically returning the "raw" values from the resultset. The following shows how to get entity objects from a native sql query via <literal>addEntity()</literal>.
fr_fr: List cats = sess.createSQLQuery( "select {cat.*}, {kitten.*} from cats cat, cats kitten where kitten.mother = cat.id" ) .setResultSetMapping("catAndKitten") .list();

source: <![CDATA[sess.createSQLQuery("SELECT * FROM CATS").addEntity(Cat.class); sess.createSQLQuery("SELECT ID, NAME, BIRTHDATE FROM CATS").addEntity(Cat.class); ]]>
fr_fr: Alias et références de propriété

source: the entity returned by the query
fr_fr: String sql = "select cat.originalId as {cat.id}, " + "cat.mateid as {cat.mate}, cat.sex as {cat.sex}, " + "cat.weight*10 as {cat.weight}, cat.name as {cat.name} " + "from cat_log cat where {cat.mate} = :catId" List loggedCats = sess.createSQLQuery(sql) .addEntity("cat", Cat.class) .setLong("catId", catId) .list();

source: Assuming that Cat is mapped as a class with the columns ID, NAME and BIRTHDATE the above queries will both return a List where each element is a Cat entity.
fr_fr: <emphasis>À noter :</emphasis> si vous listez chaque propriété explicitement, vous devez inclure toutes les propriétés de la classe <emphasis>et ses sous-classes</emphasis> !

source: If the entity is mapped with a <literal>many-to-one</literal> to another entity it is required to also return this when performing the native query, otherwise a database specific "column not found" error will occur. The additional columns will automatically be returned when using the * notation, but we prefer to be explicit as in the following example for a <literal>many-to-one</literal> to a <literal>Dog</literal>:
fr_fr: La table suivante montre les différentes possibilités d'utilisation de l'injection d'alias. À noter : les noms des alias dans le résultat sont des exemples, chaque alias aura un nom unique et probablement différent lors de l'utilisation.

source: <![CDATA[sess.createSQLQuery("SELECT ID, NAME, BIRTHDATE, DOG_ID FROM CATS").addEntity(Cat.class); ]]>
fr_fr: Noms d'injection d'alias

source: This will allow cat.getDog() to function properly.
fr_fr: Description

source: Handling associations and collections
fr_fr: Syntaxe

source: It is possible to eagerly join in the <literal>Dog</literal> to avoid the possible extra roundtrip for initializing the proxy. This is done via the <literal>addJoin()</literal> method, which allows you to join in an association or collection.
fr_fr: Exemple

source: <![CDATA[sess.createSQLQuery("SELECT c.ID, NAME, BIRTHDATE, DOG_ID, D_ID, D_NAME FROM CATS c, DOGS d WHERE c.DOG_ID = d.D_ID") .addEntity("cat", Cat.class) .addJoin("cat.dog"); ]]>
fr_fr: Une simple propriété

source: In this example the returned <literal>Cat</literal>'s will have their <literal>dog</literal> property fully initialized without any extra roundtrip to the database. Notice that we added a alias name ("cat") to be able to specify the target property path of the join. It is possible to do the same eager joining for collections, e.g. if the <literal>Cat</literal> had a one-to-many to <literal>Dog</literal> instead.
fr_fr: {[aliasname].[propertyname]}

source: <![CDATA[sess.createSQLQuery("SELECT ID, NAME, BIRTHDATE, D_ID, D_NAME, CAT_ID FROM CATS c, DOGS d WHERE c.ID = d.CAT_ID") .addEntity("cat", Cat.class) .addJoin("cat.dogs"); ]]>
fr_fr: A_NAME as {item.name}

source: At this stage we are reaching the limits of what is possible with native queries without starting to enhance the sql queries to make them usable in Hibernate; the problems starts to arise when returning multiple entities of the same type or when the default alias/column names are not enough.
fr_fr: Une propriété composée

source: Returning multiple entities
fr_fr: {[aliasname].[componentname].[propertyname]}

source: Until now the result set column names are assumed to be the same as the column names specified in the mapping document. This can be problematic for SQL queries which join multiple tables, since the same column names may appear in more than one table.
fr_fr: CURRENCY as {item.amount.currency}, VALUE as {item.amount.value}

source: Column alias injection is needed in the following query (which most likely will fail):
fr_fr: Discriminant d'une entité

source: <![CDATA[sess.createSQLQuery("SELECT c.*, m.* FROM CATS c, CATS m WHERE c.MOTHER_ID = c.ID") .addEntity("cat", Cat.class) .addEntity("mother", Cat.class) ]]>
fr_fr: {[aliasname].class}

source: The intention for this query is to return two Cat instances per row, a cat and its mother. This will fail since there is a conflict of names since they are mapped to the same column names and on some databases the returned column aliases will most likely be on the form "c.ID", "c.NAME", etc. which are not equal to the columns specificed in the mappings ("ID" and "NAME").
fr_fr: DISC as {item.class}

source: The following form is not vulnerable to column name duplication:
fr_fr: Toutes les propriétés d'une entité

source: <![CDATA[sess.createSQLQuery("SELECT {cat.*}, {mother.*} FROM CATS c, CATS m WHERE c.MOTHER_ID = c.ID") .addEntity("cat", Cat.class) .addEntity("mother", Cat.class) ]]>
fr_fr: {[aliasname].*}

source: the SQL query string, with placeholders for Hibernate to inject column aliases
fr_fr: Une clef de collection

source: the entities returned by the query
fr_fr: {[aliasname].key}

source: The {cat.*} and {mother.*} notation used above is a shorthand for "all properties". Alternatively, you may list the columns explicity, but even in this case we let Hibernate inject the SQL column aliases for each property. The placeholder for a column alias is just the property name qualified by the table alias. In the following example, we retrieve Cats and their mothers from a different table (cat_log) to the one declared in the mapping metadata. Notice that we may even use the property aliases in the where clause if we like.
fr_fr: ORGID as {coll.key}

source: <![CDATA[String sql = "SELECT ID as {c.id}, NAME as {c.name}, " + "BIRTHDATE as {c.birthDate}, MOTHER_ID as {c.mother}, {mother.*} " + "FROM CAT_LOG c, CAT_LOG m WHERE {c.mother} = c.ID"; List loggedCats = sess.createSQLQuery(sql) .addEntity("cat", Cat.class) .addEntity("mother", Cat.class).list() ]]>
fr_fr: L'identifiant d'une collection

source: Alias and property references
fr_fr: {[aliasname].id}

source: For most cases the above alias injection is needed, but for queries relating to more complex mappings like composite properties, inheritance discriminators, collections etc. there are some specific aliases to use to allow Hibernate to inject the proper aliases.
fr_fr: EMPID as {coll.id}

source: The following table shows the different possibilities of using the alias injection. Note: the alias names in the result are examples, each alias will have a unique and probably different name when used.
fr_fr: L'élément d'une collection

source: Alias injection names
fr_fr: {[aliasname].element}

source: Description
fr_fr: XID as {coll.element}

source: Syntax
fr_fr: Propriété de l'élément dans la collection

source: Example
fr_fr: {[aliasname].element.[propertyname]}

source: A simple property
fr_fr: NAME as {coll.element.name}

source: {[aliasname].[propertyname]
fr_fr: Toutes les propriétés de l'élément dans la collection

source: A_NAME as {item.name}
fr_fr: {[aliasname].element.*}

source: A composite property
fr_fr: {coll.element.*}

source: {[aliasname].[componentname].[propertyname]}
fr_fr: Toutes les propriétés de la collection

source: CURRENCY as {item.amount.currency}, VALUE as {item.amount.value}
fr_fr: {[aliasname].*}

source: Discriminator of an entity
fr_fr: {coll.*}

source: {[aliasname].class}
fr_fr: Requêtes SQL nommées

source: DISC as {item.class}
fr_fr: Les requêtes SQL nommées peuvent être définies dans le document de mapping et appelées exactement de la même manière qu'un requête HQL nommée. Dans ce cas, nous <emphasis>n'avons pas besoin</emphasis> d'appeler <literal>addEntity()</literal>.

source: All properties of an entity
fr_fr: &lt;sql-query name="persons"&gt; &lt;return alias="person" class="eg.Person"/&gt; SELECT person.NAME AS {person.name}, person.AGE AS {person.age}, person.SEX AS {person.sex} FROM PERSON person WHERE person.NAME LIKE :namePattern &lt;/sql-query&gt;

source: {[aliasname].*}
fr_fr: List people = sess.getNamedQuery("persons") .setString("namePattern", namePattern) .setMaxResults(50) .list();

source: {item.*}
fr_fr: Les éléments <literal>&lt;return-join&gt;</literal> et <literal>&lt;load-collection&gt;</literal> sont respectivement utilisés pour lier des associations et définir des requêtes qui initialisent des collections.

source: A collection key
fr_fr: &lt;sql-query name="personsWith"&gt; &lt;return alias="person" class="eg.Person"/&gt; &lt;return-join alias="address" property="person.mailingAddress"/&gt; SELECT person.NAME AS {person.name}, person.AGE AS {person.age}, person.SEX AS {person.sex}, address.STREET AS {address.street}, address.CITY AS {address.city}, address.STATE AS {address.state}, address.ZIP AS {address.zip} FROM PERSON person JOIN ADDRESS address ON person.ID = address.PERSON_ID AND address.TYPE='MAILING' WHERE person.NAME LIKE :namePattern &lt;/sql-query&gt;

source: {[aliasname].key}
fr_fr: Une requête SQL nommée peut retourner une valeur scalaire. Vous devez spécifier l'alias de colonne et le type Hibernate utilisant l'élément <literal>&lt;return-scalar&gt;</literal> :

source: ORGID as {coll.key}
fr_fr: &lt;sql-query name="mySqlQuery"&gt; &lt;return-scalar column="name" type="string"/&gt; &lt;return-scalar column="age" type="long"/&gt; SELECT p.NAME AS name, p.AGE AS age, FROM PERSON p WHERE p.NAME LIKE 'Hiber%' &lt;/sql-query&gt;

source: The id of an collection
fr_fr: Vous pouvez externaliser les informations de mapping des résultats dans un élément <literal>&lt;resultset&gt;</literal> pour soit les réutiliser dans différentes requêtes nommées, soit à travers l'API <literal>setResultSetMapping()</literal>.

source: {[aliasname].id}
fr_fr: &lt;resultset name="personAddress"&gt; &lt;return alias="person" class="eg.Person"/&gt; &lt;return-join alias="address" property="person.mailingAddress"/&gt; &lt;/resultset&gt; &lt;sql-query name="personsWith" resultset-ref="personAddress"&gt; SELECT person.NAME AS {person.name}, person.AGE AS {person.age}, person.SEX AS {person.sex}, address.STREET AS {address.street}, address.CITY AS {address.city}, address.STATE AS {address.state}, address.ZIP AS {address.zip} FROM PERSON person JOIN ADDRESS address ON person.ID = address.PERSON_ID AND address.TYPE='MAILING' WHERE person.NAME LIKE :namePattern &lt;/sql-query&gt;

source: EMPID as {coll.id}
fr_fr: Utilisation de return-property pour spécifier explicitement les noms des colonnes/alias

source: The element of an collection
fr_fr: Avec <literal>&lt;return-property&gt;</literal> vous pouvez explicitement dire à Hibernate quels alias de colonne utiliser, plutot que d'employer la syntaxe <literal>{}</literal> pour laisser Hibernate injecter ses propres alias.

source: {[aliasname].element}
fr_fr: &lt;sql-query name="mySqlQuery"&gt; &lt;return alias="person" class="eg.Person"&gt; &lt;return-property name="name" column="myName"/&gt; &lt;return-property name="age" column="myAge"/&gt; &lt;return-property name="sex" column="mySex"/&gt; &lt;/return&gt; SELECT person.NAME AS myName, person.AGE AS myAge, person.SEX AS mySex, FROM PERSON person WHERE person.NAME LIKE :name &lt;/sql-query&gt;

source: XID as {coll.element}
fr_fr: <literal>&lt;return-property&gt;</literal> fonctionne aussi avec de multiple colonnes. Cela résout une limitation de la syntaxe <literal>{}</literal> qui ne peut pas permettre une bonne granularité des propriétés multi-colonnes.

source: roperty of the element in the collection
fr_fr: &lt;sql-query name="organizationCurrentEmployments"&gt; &lt;return alias="emp" class="Employment"&gt; &lt;return-property name="salary"&gt; &lt;return-column name="VALUE"/&gt; &lt;return-column name="CURRENCY"/&gt; &lt;/return-property&gt; &lt;return-property name="endDate" column="myEndDate"/&gt; &lt;/return&gt; SELECT EMPLOYEE AS {emp.employee}, EMPLOYER AS {emp.employer}, STARTDATE AS {emp.startDate}, ENDDATE AS {emp.endDate}, REGIONCODE as {emp.regionCode}, EID AS {emp.id}, VALUE, CURRENCY FROM EMPLOYMENT WHERE EMPLOYER = :id AND ENDDATE IS NULL ORDER BY STARTDATE ASC &lt;/sql-query&gt;

source: {[aliasname].element.[propertyname]}
fr_fr: Notez que dans cet exemple nous avons utilisé <literal>&lt;return-property&gt;</literal> en combinaison avec la syntaxe <literal>{}</literal> pour l'injection. Cela autorise les utilisateurs à choisir comment ils veulent référencer les colonnes et les propriétés.

source: NAME as {coll.element.name}
fr_fr: Si votre mapping a un discriminant vous devez utiliser <literal>&lt;return-discriminator&gt;</literal> pour spécifier la colonne discriminante.

source: All properties of the element in the collection
fr_fr: Utilisation de procédures stockées pour les requêtes

source: {[aliasname].element.*}
fr_fr: Hibernate 3 introduit le support des requêtes via procédures stockées et les fonctions. La documentation suivante est valable pour les deux. Les procédures stockées/fonctions doivent retourner l'ensemble de résultats en tant que premier paramètre sortant (NdT: "out-parameter") pour être capable de fonctionner avec Hibernate. Un exemple d'une telle procédure stockée en Oracle 9 et version supérieure :

source: {coll.element.*}
fr_fr: CREATE OR REPLACE FUNCTION selectAllEmployments RETURN SYS_REFCURSOR AS st_cursor SYS_REFCURSOR; BEGIN OPEN st_cursor FOR SELECT EMPLOYEE, EMPLOYER, STARTDATE, ENDDATE, REGIONCODE, EID, VALUE, CURRENCY FROM EMPLOYMENT; RETURN st_cursor; END;

source: All properties of the the collection
fr_fr: Pour utiliser cette requête dans Hibernate vous avez besoin de la mapper via une requête nommée.

source: {coll.*}
fr_fr: Notez que les procédures stockées retournent, pour le moment, seulement des scalaires et des entités. <literal>&lt;return-join&gt;</literal> et <literal>&lt;load-collection&gt;</literal> ne sont pas supportés.

source: Returning non-managed entities
fr_fr: Règles/limitations lors de l'utilisation des procédures stockées

source: It is possible to apply a ResultTransformer to native sql queries. Allowing it to e.g. return non-managed entities.
fr_fr: Pur utiliser des procédures stockées avec Hibernate, les procédures doivent suivre certaines règles. Si elles ne suivent pas ces règles, elles ne sont pas utilisables avec Hibernate. Si vous voulez encore utiliser ces procédures vous devez les exécuter via <literal>session.connection()</literal>. Les règles sont différentes pour chaque base de données, puisque les vendeurs de base de données ont des sémantiques/syntaxes différentes pour les procédures stockées.

source: <![CDATA[sess.createSQLQuery("SELECT NAME, BIRTHDATE FROM CATS") .setResultTransformer(Transformers.aliasToBean(CatDTO.class))]]>
fr_fr: Les requêtes de procédures stockées ne peuvent pas être paginées avec <literal>setFirstResult()/setMaxResults()</literal>.

source: a result transformer
fr_fr: Pour Sybase ou MS SQL server les règles suivantes s'appliquent :

source: The above query will return a list of <literal>CatDTO</literal> which has been instantiated and injected the values of NAME and BIRTHNAME into its corresponding properties or fields.
fr_fr: La procédure doit retourner un ensemble de résultats. Notez que comme ces serveurs peuvent retourner de multiples ensembles de résultats et mettre à jour des compteurs, Hibernate itérera les résultats et prendra le premier résultat qui est un ensemble de résultat comme valeur de retour. Tout le reste sera ignoré.

source: Handling inheritance
fr_fr: Si vous pouvez activer <literal>SET NOCOUNT ON</literal> dans votre procédure, elle sera probablement plus efficace, mais ce n'est pas une obligation.

source: Native sql queries which query for entities that is mapped as part of an inheritance must include all properties for the baseclass and all it subclasses.
fr_fr: SQL personnalisé pour créer, mettre à jour et effacer

source: Parameters
fr_fr: Hibernate3 peut utiliser des expression SQL personnalisées pour des opérations de création, de mise à jour, et de suppression. Les objets persistants les classes et les collections dans Hibernate contiennent déjà un ensemble de chaînes de caractères générées lors de la configuration (insertsql, deletesql, updatesql, etc). Les tages de mapping <literal>&lt;sql-insert&gt;</literal>, <literal>&lt;sql-delete&gt;</literal>, et <literal>&lt;sql-update&gt;</literal> surchargent ces chaînes de caractères :

source: Native sql queries support positional as well as named parameters:
fr_fr: &lt;class name="Person"&gt; &lt;id name="id"&gt; &lt;generator class="increment"/&gt; &lt;/id&gt; &lt;property name="name" not-null="true"/&gt; &lt;sql-insert&gt;INSERT INTO PERSON (NAME, ID) VALUES ( UPPER(?), ? )&lt;/sql-insert&gt; &lt;sql-update&gt;UPDATE PERSON SET NAME=UPPER(?) WHERE ID=?&lt;/sql-update&gt; &lt;sql-delete&gt;DELETE FROM PERSON WHERE ID=?&lt;/sql-delete&gt; &lt;/class&gt;

source: <![CDATA[Query query = sess.createSQLQuery("SELECT * FROM CATS WHERE NAME like ?").addEntity(Cat.class); List pusList = query.setString(0, "Pus%").list(); query = sess.createSQLQuery("SELECT * FROM CATS WHERE NAME like :name").addEntity(Cat.class); List pusList = query.setString("name", "Pus%").list(); ]]>
fr_fr: Le SQL est directement exécuté dans votre base de données, donc vous êtes libre d'utiliser le dialecte que vous souhaitez. Cela réduira bien sûr la portabilité de votre mapping si vous utilisez du SQL spécifique à votre base de données.

source: Named SQL queries
fr_fr: Les procédures stockées sont supportées si l'attribut <literal>callable</literal> est paramétré :
