Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/query_hql.po
Languages: fr_fr, ja_jp

source: This will replace the keywords <literal>true</literal> and <literal>false</literal> with the literals <literal>1</literal> and <literal>0</literal> in the translated SQL from this HQL:
fr_fr: Pour les collections indexées, vous pouvez faire référence aux indices minimum et maximum en utilisant les fonctions <literal>minindex</literal> and <literal>maxindex</literal>. De manière similaire, vous pouvez faire référence aux éléments minimum et maximum d'une collection de type basiques en utilisant les fonctions <literal>minelement</literal> et <literal>maxelement</literal>.
ja_jp: インデックス付きのコレクションでは、<literal>minindex</literal> と <literal>maxindex</literal> 関数を使って、インデックスの最小値と最大値を参照できます。 同様に、<literal>minelement</literal> と <literal>maxelement</literal> を使って、 基本型のコレクション要素の最小値と最大値を参照できます。

source: <![CDATA[from Cat cat where cat.alive = true]]>
fr_fr: <![CDATA[from Calendar cal where maxelement(cal.holidays) > current date]]>
ja_jp: <![CDATA[from Calendar cal where maxelement(cal.holidays) > current_date]]>

source: You may test the size of a collection with the special property <literal>size</literal>, or the special <literal>size()</literal> function.
fr_fr: <![CDATA[from Order order where maxindex(order.items) > 100]]>
ja_jp: <![CDATA[from Order order where maxindex(order.items) > 100]]>

source: <![CDATA[from Cat cat where cat.kittens.size > 0]]>
fr_fr: <![CDATA[from Order order where minelement(order.items) > 10000]]>
ja_jp: <![CDATA[from Order order where minelement(order.items) > 10000]]>

source: <![CDATA[from Cat cat where size(cat.kittens) > 0]]>
fr_fr: Les fonctions SQL <literal>any, some, all, exists, in</literal> supportent que leur soient passées l'élément, l'index d'une collection (fonctions <literal>elements</literal> et <literal>indices</literal>) ou le résultat d'une sous requête (voir ci dessous).
ja_jp: コレクションの要素やインデックスのセット（<literal>elements</literal> と <literal>indices</literal> 関数）、または副問い合わせ（後述）の結果が受け取れるときは、 SQL関数 <literal>any, some, all, exists, in</literal> がサポートされます。

source: For indexed collections, you may refer to the minimum and maximum indices using <literal>minindex</literal> and <literal>maxindex</literal> functions. Similarly, you may refer to the minimum and maximum elements of a collection of basic type using the <literal>minelement</literal> and <literal>maxelement</literal> functions.
fr_fr: <![CDATA[select mother from Cat as mother, Cat as kit where kit in elements(foo.kittens)]]>
ja_jp: <![CDATA[select mother from Cat as mother, Cat as kit where kit in elements(foo.kittens)]]>

source: <![CDATA[from Calendar cal where maxelement(cal.holidays) > current_date]]>
fr_fr: <![CDATA[select p from NameList list, Person p where p.name = some elements(list.names)]]>
ja_jp: <![CDATA[select p from NameList list, Person p where p.name = some elements(list.names)]]>

source: <![CDATA[from Order order where maxindex(order.items) > 100]]>
fr_fr: <![CDATA[from Cat cat where exists elements(cat.kittens)]]>
ja_jp: <![CDATA[from Cat cat where exists elements(cat.kittens)]]>

source: <![CDATA[from Order order where minelement(order.items) > 10000]]>
fr_fr: <![CDATA[from Player p where 3 > all elements(p.scores)]]>
ja_jp: <![CDATA[from Player p where 3 > all elements(p.scores)]]>

source: The SQL functions <literal>any, some, all, exists, in</literal> are supported when passed the element or index set of a collection (<literal>elements</literal> and <literal>indices</literal> functions) or the result of a subquery (see below).
fr_fr: <![CDATA[from Show show where 'fizard' in indices(show.acts)]]>
ja_jp: <![CDATA[from Show show where 'fizard' in indices(show.acts)]]>

source: <![CDATA[select mother from Cat as mother, Cat as kit where kit in elements(foo.kittens)]]>
fr_fr: Notez que l'écriture de - <literal>size</literal>, <literal>elements</literal>, <literal>indices</literal>, <literal>minindex</literal>, <literal>maxindex</literal>, <literal>minelement</literal>, <literal>maxelement</literal> - peuvent seulement être utilisée dans la clause where dans Hibernate3.
ja_jp: <literal>size</literal>, <literal>elements</literal>, <literal>indices</literal>, <literal>minindex</literal>, <literal>maxindex</literal>, <literal>minelement</literal>, <literal>maxelement</literal> はHibernate3のwhere節だけで利用可能であることに注意してください。

source: <![CDATA[select p from NameList list, Person p where p.name = some elements(list.names)]]>
fr_fr: Les éléments de collections indexées (arrays, lists, maps) peuvent être référencés via index (dans une clause where seulement) :
ja_jp: インデックス付きのコレクション（arrays, lists, maps）の要素は、 インデックスで参照できます（where節内でのみ）。

source: <![CDATA[from Cat cat where exists elements(cat.kittens)]]>
fr_fr: <![CDATA[from Order order where order.items[0].id = 1234]]>
ja_jp: <![CDATA[from Order order where order.items[0].id = 1234]]>

source: <![CDATA[from Player p where 3 > all elements(p.scores)]]>
fr_fr: <![CDATA[select person from Person person, Calendar calendar where calendar.holidays['national day'] = person.birthDay and person.nationality.calendar = calendar]]>
ja_jp: <![CDATA[select person from Person person, Calendar calendar where calendar.holidays['national day'] = person.birthDay and person.nationality.calendar = calendar]]>

source: <![CDATA[from Show show where 'fizard' in indices(show.acts)]]>
fr_fr: <![CDATA[select item from Item item, Order order where order.items[ order.deliveredItemIndices[0] ] = item and order.id = 11]]>
ja_jp: <![CDATA[select item from Item item, Order order where order.items[ order.deliveredItemIndices[0] ] = item and order.id = 11]]>

source: Note that these constructs - <literal>size</literal>, <literal>elements</literal>, <literal>indices</literal>, <literal>minindex</literal>, <literal>maxindex</literal>, <literal>minelement</literal>, <literal>maxelement</literal> - may only be used in the where clause in Hibernate3.
fr_fr: <![CDATA[select item from Item item, Order order where order.items[ maxindex(order.items) ] = item and order.id = 11]]>
ja_jp: <![CDATA[select item from Item item, Order order where order.items[ maxindex(order.items) ] = item and order.id = 11]]>

source: Elements of indexed collections (arrays, lists, maps) may be referred to by index (in a where clause only):
fr_fr: L'expression entre <literal>[]</literal> peut même être une expression arithmétique.
ja_jp: <literal>[]</literal> 内部の式は、算術式でも構いません。

source: <![CDATA[from Order order where order.items[0].id = 1234]]>
fr_fr: <![CDATA[select item from Item item, Order order where order.items[ size(order.items) - 1 ] = item]]>
ja_jp: <![CDATA[select item from Item item, Order order where order.items[ size(order.items) - 1 ] = item]]>

source: <![CDATA[select person from Person person, Calendar calendar where calendar.holidays['national day'] = person.birthDay and person.nationality.calendar = calendar]]>
fr_fr: HQL propose aussi une fonction <literal>index()</literal> interne, pour les éléments d'une association one-to-many ou d'une collections de valeurs.
ja_jp: 一対多関連や値のコレクションの要素に対しては、HQLは組み込みの <literal>index()</literal> 関数も用意しています。

source: <![CDATA[select item from Item item, Order order where order.items[ order.deliveredItemIndices[0] ] = item and order.id = 11]]>
fr_fr: <![CDATA[select item, index(item) from Order order join order.items item where index(item) < 5]]>
ja_jp: <![CDATA[select item, index(item) from Order order join order.items item where index(item) < 5]]>

source: <![CDATA[select item from Item item, Order order where order.items[ maxindex(order.items) ] = item and order.id = 11]]>
fr_fr: Les fonctions SQL scalaires supportées par la base de données utilisée peuvent être utilisées
ja_jp: ベースとなるデータベースがサポートしているスカラーSQL関数が使用できます

source: The expression inside <literal>[]</literal> may even be an arithmetic expression.
fr_fr: <![CDATA[from DomesticCat cat where upper(cat.name) like 'FRI%']]>
ja_jp: <![CDATA[from DomesticCat cat where upper(cat.name) like 'FRI%']]>

source: <![CDATA[select item from Item item, Order order where order.items[ size(order.items) - 1 ] = item]]>
fr_fr: Si vous n'êtes pas encore convaincu par tout cela, imaginez la taille et l'illisibilité qui caractériseraient la transformation SQL de la requête HQL suivante :
ja_jp: もしまだ全てを理解していないなら、下のクエリをSQLでどれだけ長く、読みづらく出来るか考えてください。:

source: HQL also provides the built-in <literal>index()</literal> function, for elements of a one-to-many association or collection of values.
fr_fr: <![CDATA[select cust from Product prod, Store store inner join store.customers cust where prod.name = 'widget' and store.location.name in ( 'Melbourne', 'Sydney' ) and prod = all elements(cust.currentOrder.lineItems)]]>
ja_jp: <![CDATA[select cust from Product prod, Store store inner join store.customers cust where prod.name = 'widget' and store.location.name in ( 'Melbourne', 'Sydney' ) and prod = all elements(cust.currentOrder.lineItems)]]>

source: <![CDATA[select item, index(item) from Order order join order.items item where index(item) < 5]]>
fr_fr: <emphasis>Un indice :</emphasis> cela donnerait quelque chose comme
ja_jp: <emphasis>ヒント:</emphasis> 例えばこのように出来ます。

source: Scalar SQL functions supported by the underlying database may be used
fr_fr: <![CDATA[SELECT cust.name, cust.address, cust.phone, cust.id, cust.current_order FROM customers cust, stores store, locations loc, store_customers sc, product prod WHERE prod.name = 'widget' AND store.loc_id = loc.id AND loc.name IN ( 'Melbourne', 'Sydney' ) AND sc.store_id = store.id AND sc.cust_id = cust.id AND prod.id = ALL( SELECT item.prod_id FROM line_items item, orders o WHERE item.order_id = o.id AND cust.current_order = o.id )]]>
ja_jp: <![CDATA[SELECT cust.name, cust.address, cust.phone, cust.id, cust.current_order FROM customers cust, stores store, locations loc, store_customers sc, product prod WHERE prod.name = 'widget' AND store.loc_id = loc.id AND loc.name IN ( 'Melbourne', 'Sydney' ) AND sc.store_id = store.id AND sc.cust_id = cust.id AND prod.id = ALL( SELECT item.prod_id FROM line_items item, orders o WHERE item.order_id = o.id AND cust.current_order = o.id )]]>

source: <![CDATA[from DomesticCat cat where upper(cat.name) like 'FRI%']]>
fr_fr: La clause order by
ja_jp: order by節

source: If you are not yet convinced by all this, think how much longer and less readable the following query would be in SQL:
fr_fr: La liste retounée par la requête peut être triée par n'importe quelle propriété de la classe ou du composant retourné :
ja_jp: クエリが返すlistは、返されるクラスやコンポーネントの任意の属性によって並べ替えられます。：

source: <![CDATA[select cust from Product prod, Store store inner join store.customers cust where prod.name = 'widget' and store.location.name in ( 'Melbourne', 'Sydney' ) and prod = all elements(cust.currentOrder.lineItems)]]>
fr_fr: <![CDATA[from DomesticCat cat order by cat.name asc, cat.weight desc, cat.birthdate]]>
ja_jp: <![CDATA[from DomesticCat cat order by cat.name asc, cat.weight desc, cat.birthdate]]>

source: <emphasis>Hint:</emphasis> something like
fr_fr: Le mot optionnel <literal>asc</literal> ou <literal>desc</literal> indique respectivement si le tri doit être croissant ou décroissant.
ja_jp: オプションの <literal>asc</literal> と <literal>desc</literal> はそれぞれ昇順か降順の整列を示します。

source: <![CDATA[SELECT cust.name, cust.address, cust.phone, cust.id, cust.current_order FROM customers cust, stores store, locations loc, store_customers sc, product prod WHERE prod.name = 'widget' AND store.loc_id = loc.id AND loc.name IN ( 'Melbourne', 'Sydney' ) AND sc.store_id = store.id AND sc.cust_id = cust.id AND prod.id = ALL( SELECT item.prod_id FROM line_items item, orders o WHERE item.order_id = o.id AND cust.current_order = o.id )]]>
fr_fr: La clause group by
ja_jp: group by節

source: The order by clause
fr_fr: Si la requête retourne des valeurs aggrégées, celles ci peuvent être groupées par propriété ou composant :
ja_jp: 集約値を返すクエリは、返されるクラスやコンポーネントの任意のプロパティによってグループ化できます。:

source: The list returned by a query may be ordered by any property of a returned class or components:
fr_fr: <![CDATA[select cat.color, sum(cat.weight), count(cat) from Cat cat group by cat.color]]>
ja_jp: <![CDATA[select cat.color, sum(cat.weight), count(cat) from Cat cat group by cat.color]]>

source: <![CDATA[from DomesticCat cat order by cat.name asc, cat.weight desc, cat.birthdate]]>
fr_fr: <![CDATA[select foo.id, avg(name), max(name) from Foo foo join foo.names name group by foo.id]]>
ja_jp: <![CDATA[select foo.id, avg(name), max(name) from Foo foo join foo.names name group by foo.id]]>

source: The optional <literal>asc</literal> or <literal>desc</literal> indicate ascending or descending order respectively.
fr_fr: Une clause <literal>having</literal> est aussi permise.
ja_jp: <literal>having</literal> 節も使えます。

source: The group by clause
fr_fr: <![CDATA[select cat.color, sum(cat.weight), count(cat) from Cat cat group by cat.color having cat.color in (eg.Color.TABBY, eg.Color.BLACK)]]>
ja_jp: <![CDATA[select cat.color, sum(cat.weight), count(cat) from Cat cat group by cat.color having cat.color in (eg.Color.TABBY, eg.Color.BLACK)]]>

source: A query that returns aggregate values may be grouped by any property of a returned class or components:
fr_fr: Les fonctions SQL et les fonctions d'aggrégations sont permises dans les clauses <literal>having</literal> et <literal>order by</literal>, si elles sont supportées par la base de données (ce que ne fait pas MySQL par exemple).
ja_jp: もし使用するデータベースがサポートしているなら、 <literal>having</literal> と <literal>order by</literal> 節でSQL関数と集約関数が使えます （例えばMySQLにはありません）。

source: <![CDATA[select cat.color, sum(cat.weight), count(cat) from Cat cat group by cat.color]]>
fr_fr: <![CDATA[select cat from Cat cat join cat.kittens kitten group by cat having avg(kitten.weight) > 100 order by count(kitten) asc, sum(kitten.weight) desc]]>
ja_jp: <![CDATA[select cat from Cat cat join cat.kittens kitten group by cat having avg(kitten.weight) > 100 order by count(kitten) asc, sum(kitten.weight) desc]]>

source: <![CDATA[select foo.id, avg(name), max(name) from Foo foo join foo.names name group by foo.id]]>
fr_fr: Notez que ni la clause <literal>group by</literal> ni la clause <literal>order by</literal> ne peuvent contenir d'expressions arithmétiques.
ja_jp: <literal>group by</literal> 節や <literal>order by</literal> 節に 算術式を含むことができないことに注意してください。

source: A <literal>having</literal> clause is also allowed.
fr_fr: Sous-requêtes
ja_jp: 副問い合わせ

source: <![CDATA[select cat.color, sum(cat.weight), count(cat) from Cat cat group by cat.color having cat.color in (eg.Color.TABBY, eg.Color.BLACK)]]>
fr_fr: Pour les bases de données le supportant, Hibernate supporte les sous requêtes dans les requêtes. Une sous requête doit être entre parenthèses (souvent pour un appel à une fonction d'agrégation SQL) Même les sous requêtes corrélées (celles qui font référence à un alias de la requête principale) sont supportées.
ja_jp: サブセレクトをサポートするデータベースのため、Hibernateは副問い合わせをサポートしています。 副問い合わせは括弧で囲まなければなりません（SQLの集約関数呼び出しによる事が多いです）。 関連副問い合わせ(外部クエリ中の別名を参照する副問い合わせのこと)さえ許可されます。

source: SQL functions and aggregate functions are allowed in the <literal>having</literal> and <literal>order by</literal> clauses, if supported by the underlying database (eg. not in MySQL).
fr_fr: <![CDATA[from Cat as fatcat where fatcat.weight > ( select avg(cat.weight) from DomesticCat cat )]]>
ja_jp: <![CDATA[from Cat as fatcat where fatcat.weight > ( select avg(cat.weight) from DomesticCat cat )]]>

source: <![CDATA[select cat from Cat cat join cat.kittens kitten group by cat.id, cat.name, cat.other, cat.properties having avg(kitten.weight) > 100 order by count(kitten) asc, sum(kitten.weight) desc]]>
fr_fr: <![CDATA[from DomesticCat as cat where cat.name = some ( select name.nickName from Name as name )]]>
ja_jp: <![CDATA[from DomesticCat as cat where cat.name = some ( select name.nickName from Name as name )]]>

source: Note that neither the <literal>group by</literal> clause nor the <literal>order by</literal> clause may contain arithmetic expressions. Also note that Hibernate currently does not expand a grouped entity, so you can't write <literal>group by cat</literal> if all properties of <literal>cat</literal> are non-aggregated. You have to list all non-aggregated properties explicitly.
fr_fr: <![CDATA[from Cat as cat where not exists ( from Cat as mate where mate.mate = cat )]]>
ja_jp: <![CDATA[from Cat as cat where not exists ( from Cat as mate where mate.mate = cat )]]>

source: Subqueries
fr_fr: <![CDATA[from DomesticCat as cat where cat.name not in ( select name.nickName from Name as name )]]>
ja_jp: <![CDATA[from DomesticCat as cat where cat.name not in ( select name.nickName from Name as name )]]>

source: For databases that support subselects, Hibernate supports subqueries within queries. A subquery must be surrounded by parentheses (often by an SQL aggregate function call). Even correlated subqueries (subqueries that refer to an alias in the outer query) are allowed.
fr_fr: <![CDATA[select cat.id, (select max(kit.weight) from cat.kitten kit) from Cat as cat]]>
ja_jp: <![CDATA[select cat.id, (select max(kit.weight) from cat.kitten kit) from Cat as cat]]>

source: <![CDATA[from Cat as fatcat where fatcat.weight > ( select avg(cat.weight) from DomesticCat cat )]]>
fr_fr: Notez que les sous-requêtes HQL peuvent arriver seulememnt dans les clauses select ou where.
ja_jp: HQL副問い合わせは、selectまたはwhere節だけで使われることに注意してください。

source: <![CDATA[from DomesticCat as cat where cat.name = some ( select name.nickName from Name as name )]]>
fr_fr: Pour des sous-requêtes avec plus d'une expression dans le select, vous pouvez utiliser un constructeur de tuples :
ja_jp: selectリストに複数の式を持つ副問い合わせには、タプルを使うことができます。

source: <![CDATA[from Cat as cat where not exists ( from Cat as mate where mate.mate = cat )]]>
fr_fr: <![CDATA[from Cat as cat where not ( cat.name, cat.color ) in ( select cat.name, cat.color from DomesticCat cat )]]>
ja_jp: <![CDATA[from Cat as cat where not ( cat.name, cat.color ) in ( select cat.name, cat.color from DomesticCat cat )]]>

source: <![CDATA[from DomesticCat as cat where cat.name not in ( select name.nickName from Name as name )]]>
fr_fr: Notez que sur certaines bases de données (mais par Oracle ou HSQL), vous pouvez utiliser des constructeurs de tuples dans d'autres contextes, par exemple lors du requêtage de composants ou de types utilisateur composites :
ja_jp: いくつかのデータベース（OracleやHSQLにはありません）では、 他のコンテキストでもタプルが使えます。 例えば、クエリコンポーネントや複合ユーザ型においてです。

source: <![CDATA[select cat.id, (select max(kit.weight) from cat.kitten kit) from Cat as cat]]>
fr_fr: <![CDATA[from Person where name = ('Gavin', 'A', 'King')]]>
ja_jp: <![CDATA[from Person where name = ('Gavin', 'A', 'King')]]>

source: Note that HQL subqueries may occur only in the select or where clauses.
fr_fr: Ce qui est équivalent à la forme plus verbeuse suivante :
ja_jp: 同等ですが、より冗長なクエリです：

source: Note that subqueries can also utilize <literal>row value constructor</literal> syntax. See <xref linkend="queryhql-tuple"/> for more details.
fr_fr: <![CDATA[from Person where name.first = 'Gavin' and name.initial = 'A' and name.last = 'King')]]>
ja_jp: <![CDATA[from Person where name.first = 'Gavin' and name.initial = 'A' and name.last = 'King')]]>

source: HQL examples
fr_fr: Il y a deux bonnes raisons que vous ne puissiez ne pas vouloir faire cette sorte de choses : d'abord, ce n'est pas complètement portable entre les plateformes de base de données ; deuxièmement, la requête est maintenant dépendante de l'ordre des propriétés dans le document de mapping.
ja_jp: このようなことをしたくないのには2つの理由があります： 1つ目は、データベースプラットフォーム間で完全な互換性はないからです。 2つ目は、クエリがマッピングドキュメントのプロパティの順序に依存するからです。

source: Hibernate queries can be quite powerful and complex. In fact, the power of the query language is one of Hibernate's main selling points. Here are some example queries very similar to queries that I used on a recent project. Note that most queries you will write are much simpler than these!
fr_fr: Exemples HQL
ja_jp: HQLの例

source: The following query returns the order id, number of items and total value of the order for all unpaid orders for a particular customer and given minimum total value, ordering the results by total value. In determining the prices, it uses the current catalog. The resulting SQL query, against the <literal>ORDER</literal>, <literal>ORDER_LINE</literal>, <literal>PRODUCT</literal>, <literal>CATALOG</literal> and <literal>PRICE</literal> tables has four inner joins and an (uncorrelated) subselect.
fr_fr: Les requêtes Hibernate peuvent être relativement puissantes et complexes. En fait, la puissance du langage de requêtage est l'un des avantages principaux d'Hibernate. Voici quelques exemples très similaires aux requêtes que nous avons utilisées lors d'un récent projet. Notez que la plupart des requêtes que vous écrirez seront plus simples que les exemples suivantes !
ja_jp: Hibernateクエリは非常に強力で複雑にできます。実際、クエリ言語の威力はHibernateの主要なセールスポイントの一つです。 ここに最近のプロジェクトで使用したクエリと非常によく似た例があります。 ほとんどのクエリはこれらの例より簡単に記述できることに注意してください!

source: <![CDATA[select order.id, sum(price.amount), count(item) from Order as order join order.lineItems as item join item.product as product, Catalog as catalog join catalog.prices as price where order.paid = false and order.customer = :customer and price.product = product and catalog.effectiveDate < sysdate and catalog.effectiveDate >= all ( select cat.effectiveDate from Catalog as cat where cat.effectiveDate < sysdate ) group by order having sum(price.amount) > :minAmount order by sum(price.amount) desc]]>
fr_fr: La requête suivante retourne l'id de commande (order), le nombre d'articles (items) et la valeur totale de la commande (order) pour toutes les commandes non payées d'un client (customer) particulier pour un total minimum donné, le tout trié par la valeur totale. La requête SQL générée sur les tables <literal>ORDER</literal>, <literal>ORDER_LINE</literal>, <literal>PRODUCT</literal>, <literal>CATALOG</literal> et <literal>PRICE</literal> est composée de quatre jointures interne ainsi que d'une sous-requête (non corrélée).
ja_jp: 以下のクエリは特定の顧客と与えられた最小の合計値に対する未払い注文の注文ID、 商品の数、注文の合計を合計値で整列して返します。 価格を決定する際、現在のカタログを使います。結果として返されるSQLクエリは <literal>ORDER</literal>, <literal>ORDER_LINE</literal>, <literal>PRODUCT</literal>, <literal>CATALOG</literal> および <literal>PRICE</literal> テーブルに対し4つの内部結合と (関連しない)副問い合わせを持ちます。

source: What a monster! Actually, in real life, I'm not very keen on subqueries, so my query was really more like this:
fr_fr: <![CDATA[select order.id, sum(price.amount), count(item) from Order as order join order.lineItems as item join item.product as product, Catalog as catalog join catalog.prices as price where order.paid = false and order.customer = :customer and price.product = product and catalog.effectiveDate < sysdate and catalog.effectiveDate >= all ( select cat.effectiveDate from Catalog as cat where cat.effectiveDate < sysdate ) group by order having sum(price.amount) > :minAmount order by sum(price.amount) desc]]>
ja_jp: <![CDATA[select order.id, sum(price.amount), count(item) from Order as order join order.lineItems as item join item.product as product, Catalog as catalog join catalog.prices as price where order.paid = false and order.customer = :customer and price.product = product and catalog.effectiveDate < sysdate and catalog.effectiveDate >= all ( select cat.effectiveDate from Catalog as cat where cat.effectiveDate < sysdate ) group by order having sum(price.amount) > :minAmount order by sum(price.amount) desc]]>
