Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/session_api.po
Languages: fr_fr

source: The application should individually <literal>update()</literal> detached instances reachable from the given detached instance if and <emphasis>only</emphasis> if it wants their state also updated. This can be automated of course, using <emphasis>transitive persistence</emphasis>, see <xref linkend="objectstate-transitive"/>.
fr_fr: Notez que <literal>lock()</literal> peut être utilisé avec différents <literal>LockMode</literal>s, voir la documentation de l'API documentation et le chapitre sur la gestion des transactions pour plus d'informations. Le réattachement n'est pas le seul cas d'utilisation pour <literal>lock()</literal>.

source: The <literal>lock()</literal> method also allows an application to reassociate an object with a new session. However, the detached instance has to be unmodified!
fr_fr: D'autres modèles pour de longues unités de travail sont traités dans <xref linkend="transactions-optimistic"/>.

source: <![CDATA[//just reassociate: sess.lock(fritz, LockMode.NONE); //do a version check, then reassociate: sess.lock(izi, LockMode.READ); //do a version check, using SELECT ... FOR UPDATE, then reassociate: sess.lock(pk, LockMode.UPGRADE);]]>
fr_fr: Détection automatique d'un état

source: Note that <literal>lock()</literal> can be used with various <literal>LockMode</literal>s, see the API documentation and the chapter on transaction handling for more information. Reattachment is not the only usecase for <literal>lock()</literal>.
fr_fr: Les utilisateurs d'Hibernate ont demandé une méthode dont l'intention générale serait soit de sauvegarder une instance éphémère en générant un nouvel identifiant, soit mettre à jour/réattacher les instances détachées associées à l'identifiant courant. La méthode <literal>saveOrUpdate()</literal> implémente cette fonctionnalité.

source: Other models for long units of work are discussed in <xref linkend="transactions-optimistic"/>.
fr_fr: <![CDATA[// dans la première session Cat cat = (Cat) firstSession.load(Cat.class, catID); // dans une partie plus haute de l'application Cat mate = new Cat(); cat.setMate(mate); // plus tard, dans une nouvelle session secondSession.saveOrUpdate(cat); // met à jour un état existant (cat a un identifiant non-null) secondSession.saveOrUpdate(mate); // sauvegarde les nouvelles instances (mate a un identiant null)]]>

source: Automatic state detection
fr_fr: L'usage et la sémantique de <literal>saveOrUpdate()</literal> semble être confuse pour les nouveaux utilisateurs. Premièrement, aussi longtemps que vous n'essayez pas d'utiliser des instances d'une session dans une autre, vous ne devriez pas avoir besoin d'utiliser <literal>update()</literal>, <literal>saveOrUpdate()</literal>, ou <literal>merge()</literal>. Certaines applications n'utiliseront jamais ces méthodes.

source: Hibernate users have requested a general purpose method that either saves a transient instance by generating a new identifier or updates/reattaches the detached instances associated with its current identifier. The <literal>saveOrUpdate()</literal> method implements this functionality.
fr_fr: Généralement <literal>update()</literal> ou <literal>saveOrUpdate()</literal> sont utilisées dans le scénario suivant :

source: <![CDATA[// in the first session Cat cat = (Cat) firstSession.load(Cat.class, catID); // in a higher tier of the application Cat mate = new Cat(); cat.setMate(mate); // later, in a new session secondSession.saveOrUpdate(cat); // update existing state (cat has a non-null id) secondSession.saveOrUpdate(mate); // save the new instance (mate has a null id)]]>
fr_fr: l'application charge un objet dans la première session

source: The usage and semantics of <literal>saveOrUpdate()</literal> seems to be confusing for new users. Firstly, so long as you are not trying to use instances from one session in another new session, you should not need to use <literal>update()</literal>, <literal>saveOrUpdate()</literal>, or <literal>merge()</literal>. Some whole applications will never use either of these methods.
fr_fr: l'objet est passé à la couche utilisateur

source: Usually <literal>update()</literal> or <literal>saveOrUpdate()</literal> are used in the following scenario:
fr_fr: certaines modifications sont effectuées sur l'objet

source: the application loads an object in the first session
fr_fr: l'objet est retourné à la couche logique métier

source: the object is passed up to the UI tier
fr_fr: l'application persiste ces modifications en appelant <literal>update()</literal> dans une seconde sessin

source: some modifications are made to the object
fr_fr: <literal>saveOrUpdate()</literal> s'utilise dans le cas suivant :

source: the object is passed back down to the business logic tier
fr_fr: si l'objet est déjà persistant dans cette session, ne rien faire

source: the application persists these modifications by calling <literal>update()</literal> in a second session
fr_fr: si un autre objet associé à la session a le même identifiant, lever une exception

source: <literal>saveOrUpdate()</literal> does the following:
fr_fr: si l'objet n'a pas de propriété d'identifiant, appeler <literal>save()</literal>

source: if the object is already persistent in this session, do nothing
fr_fr: si l'identifiant de l'objet a une valeur assignée à un objet nouvellement instancié, appeler <literal>save()</literal>

source: if another object associated with the session has the same identifier, throw an exception
fr_fr: si l'objet est versionné (par <literal>&lt;version&gt;</literal> ou <literal>&lt;timestamp&gt;</literal>), et la valeur de la propriété de version est la même valeur que celle assignée à un objet nouvellement instancié, appeler <literal>save()</literal>

source: if the object has no identifier property, <literal>save()</literal> it
fr_fr: sinon mettre à jour l'objet avec <literal>update()</literal>

source: if the object's identifier has the value assigned to a newly instantiated object, <literal>save()</literal> it
fr_fr: et <literal>merge()</literal> est très différent :

source: if the object is versioned (by a <literal>&lt;version&gt;</literal> or <literal>&lt;timestamp&gt;</literal>), and the version property value is the same value assigned to a newly instantiated object, <literal>save()</literal> it
fr_fr: s'il y a une instance persistante avec le même identifiant couramment associée à la session, copier l'état de l'objet donné dans l'instance persistante

source: otherwise <literal>update()</literal> the object
fr_fr: s'il n'y a pas d'instance persistante associée à cette session, essayer de le charger à partir de la base de données, ou créer une nouvelle instance persistante

source: and <literal>merge()</literal> is very different:
fr_fr: l'instance persistante est retournée

source: if there is a persistent instance with the same identifier currently associated with the session, copy the state of the given object onto the persistent instance
fr_fr: l'instance donnée ne devient pas associée à la session, elle reste détachée

source: if there is no persistent instance currently associated with the session, try to load it from the database, or create a new persistent instance
fr_fr: Suppression d'objets persistants

source: the persistent instance is returned
fr_fr: <literal>Session.delete()</literal> supprimera l'état d'un objet de la base de données. Bien sûr, votre application pourrait encore conserver une référence vers un objet effacé. Il est mieux de penser à <literal>delete()</literal> comme rendant une instance persistante éphémère.

source: the given instance does not become associated with the session, it remains detached
fr_fr: <![CDATA[sess.delete(cat);]]>

source: Deleting persistent objects
fr_fr: Vous pouvez effacer des objets dans l'ordre que vous voulez, sans risque de violations de contrainte de clef étrangère. Il est encore possible de violer une contrainte <literal>NOT NULL</literal> sur une colonne de clef étrangère en effaçant des objets dans le mauvais ordre, par exemple si vous effacer le parent, mais oubliez d'effacer les enfants.

source: <literal>Session.delete()</literal> will remove an object's state from the database. Of course, your application might still hold a reference to a deleted object. It's best to think of <literal>delete()</literal> as making a persistent instance transient.
fr_fr: Réplication d'objets entre deux entrepôts de données

source: <![CDATA[sess.delete(cat);]]>
fr_fr: Il est occasionnellement utile de pouvoir prendre un graphe d'instances persistantes et de les rendre persistantes dans un entrepôt différent, sans regénérer les valeurs des identifiants.

source: You may delete objects in any order you like, without risk of foreign key constraint violations. It is still possible to violate a <literal>NOT NULL</literal> constraint on a foreign key column by deleting objects in the wrong order, e.g. if you delete the parent, but forget to delete the children.
fr_fr: <![CDATA[//récupère un cat de la base de données Session session1 = factory1.openSession(); Transaction tx1 = session1.beginTransaction(); Cat cat = session1.get(Cat.class, catId); tx1.commit(); session1.close(); // réconcilie la seconde base de données Session session2 = factory2.openSession(); Transaction tx2 = session2.beginTransaction(); session2.replicate(cat, ReplicationMode.LATEST_VERSION); tx2.commit(); session2.close();]]>

source: Replicating object between two different datastores
fr_fr: Le <literal>ReplicationMode</literal> détermine comment <literal>replicate()</literal> traitera les conflits avec les lignes existantes dans la base de données.

source: It is occasionally useful to be able to take a graph of persistent instances and make them persistent in a different datastore, without regenerating identifier values.
fr_fr: <literal>ReplicationMode.IGNORE</literal> - ignore l'objet s'il y a une ligne existante dans la base de données avec le même identifiant

source: <![CDATA[//retrieve a cat from one database Session session1 = factory1.openSession(); Transaction tx1 = session1.beginTransaction(); Cat cat = session1.get(Cat.class, catId); tx1.commit(); session1.close(); //reconcile with a second database Session session2 = factory2.openSession(); Transaction tx2 = session2.beginTransaction(); session2.replicate(cat, ReplicationMode.LATEST_VERSION); tx2.commit(); session2.close();]]>
fr_fr: <literal>ReplicationMode.OVERWRITE</literal> - écrase n'importe quelle ligne existante dans la base de données avec le même identifiant

source: The <literal>ReplicationMode</literal> determines how <literal>replicate()</literal> will deal with conflicts with existing rows in the database.
fr_fr: <literal>ReplicationMode.EXCEPTION</literal> - lève une exception s'il y une ligne dans la base de données avec le même identifiant

source: <literal>ReplicationMode.IGNORE</literal> - ignore the object when there is an existing database row with the same identifier
fr_fr: <literal>ReplicationMode.LATEST_VERSION</literal> - écrase la ligne si son numéro de version est plus petit que le numéro de version de l'objet, ou ignore l'objet sinon

source: <literal>ReplicationMode.OVERWRITE</literal> - overwrite any existing database row with the same identifier
fr_fr: Les cas d'utilisation de cette fonctionnalité incluent la réconciliation de données entrées dans différentes base de données, l'extension des informations de configuration du système durant une mise à jour du produit, retour en arrière sur les changements effectués durant des transactions non-ACID, et plus.

source: <literal>ReplicationMode.EXCEPTION</literal> - throw an exception if there is an existing database row with the same identifier
fr_fr: Flush de la session

source: <literal>ReplicationMode.LATEST_VERSION</literal> - overwrite the row if its version number is earlier than the version number of the object, or ignore the object otherwise
fr_fr: De temps en temps la <literal>Session</literal> exécutera les expressions SQL requises pour syncrhoniser l'état de la connexion JDBC avec l'état des objets retenus en mémoire. Ce processus, <emphasis>flush</emphasis>, arrive par défaut aux points suivants :

source: Usecases for this feature include reconciling data entered into different database instances, upgrading system configuration information during product upgrades, rolling back changes made during non-ACID transactions and more.
fr_fr: lors de certaines exécutions de requête

source: Flushing the Session
fr_fr: lors d'un appel à <literal>org.hibernate.Transaction.commit()</literal>

source: From time to time the <literal>Session</literal> will execute the SQL statements needed to synchronize the JDBC connection's state with the state of objects held in memory. This process, <emphasis>flush</emphasis>, occurs by default at the following points
fr_fr: lors d'un appel à <literal>Session.flush()</literal>

source: before some query executions
fr_fr: Les expressions SQL sont effectuées dans l'ordre suivant :

source: from <literal>org.hibernate.Transaction.commit()</literal>
fr_fr: insertion des entités, dans le même ordre que celui des objets correspondants sauvegardés par l'appel à <literal>Session.save()</literal>

source: from <literal>Session.flush()</literal>
fr_fr: mise à jours des entités

source: The SQL statements are issued in the following order
fr_fr: suppression des collections

source: all entity insertions, in the same order the corresponding objects were saved using <literal>Session.save()</literal>
fr_fr: suppression, mise à jour et insertion des éléments des collections

source: all entity updates
fr_fr: insertion des collections

source: all collection deletions
fr_fr: suppression des entités, dans le même ordre que celui des objets correspondants qui ont été supprimés par l'appel à <literal>Session.delete()</literal>

source: all collection element deletions, updates and insertions
fr_fr: (Une exception est que des objets utilisant la génération <literal>native</literal> d'identifiants sont insérés lorsqu'ils sont sauvegardés.)

source: all collection insertions
fr_fr: Excepté lorsque vous appelez <literal>flush()</literal> explicitement, il n'y absolument aucune garantie à propos de <emphasis>quand</emphasis> la <literal>Session</literal> exécute les appels JDBC, seulement sur l'<emphasis>ordre</emphasis> dans lequel ils sont exécutés. Cependant, Hibernate garantit que <literal>Query.list(..)</literal> ne retournera jamais de données périmées, ni des données fausses.

source: all entity deletions, in the same order the corresponding objects were deleted using <literal>Session.delete()</literal>
fr_fr: Il est possible de changer le comportement par défaut, donc que le flush se produise moins fréquemment. La classe <literal>FlushMode</literal> définit trois modes différents : flush seulement lors du commit (et seulement quand l'API <literal>Transaction</literal> d'Hibernate est utilisée), flush automatiquement en utilisant la procédure expliquée, ou jamais de flush à moins que <literal>flush()</literal> soit appelée explicitement. Le dernier mode est utile pour l'exécution de longues unités de travail, où une <literal>Session</literal> est gardée ouverte et déconnectée pour un long moment (voir <xref linkend="transactions-optimistic-longsession"/>).

source: (An exception is that objects using <literal>native</literal> ID generation are inserted when they are saved.)
fr_fr: <![CDATA[sess = sf.openSession(); Transaction tx = sess.beginTransaction(); sess.setFlushMode(FlushMode.COMMIT); // permet aux requêtes de retourner un état périmé Cat izi = (Cat) sess.load(Cat.class, id); izi.setName(iznizi); // pourrait retourner des données périmées sess.find("from Cat as cat left outer join cat.kittens kitten"); // le changement pour izi n'est pas flushé ! ... tx.commit(); // le flush se produit]]>

source: Except when you explicity <literal>flush()</literal>, there are absolutely no guarantees about <emphasis>when</emphasis> the <literal>Session</literal> executes the JDBC calls, only the <emphasis>order</emphasis> in which they are executed. However, Hibernate does guarantee that the <literal>Query.list(..)</literal> will never return stale data; nor will they return the wrong data.
fr_fr: Durant le flush, une exception peut se produire (par exemple, si une opération de la DML viole une contrainte). Puisque les exceptions de gestion impliquent une certaine compréhension du comportement transactionnel d'Hibernate, nous le traitons dans <xref linkend="transactions"/>.

source: It is possible to change the default behavior so that flush occurs less frequently. The <literal>FlushMode</literal> class defines three different modes: only flush at commit time (and only when the Hibernate <literal>Transaction</literal> API is used), flush automatically using the explained routine, or never flush unless <literal>flush()</literal> is called explicitly. The last mode is useful for long running units of work, where a <literal>Session</literal> is kept open and disconnected for a long time (see <xref linkend="transactions-optimistic-longsession"/>).
fr_fr: Persistance transitive

source: <![CDATA[sess = sf.openSession(); Transaction tx = sess.beginTransaction(); sess.setFlushMode(FlushMode.COMMIT); // allow queries to return stale state Cat izi = (Cat) sess.load(Cat.class, id); izi.setName(iznizi); // might return stale data sess.find("from Cat as cat left outer join cat.kittens kitten"); // change to izi is not flushed! ... tx.commit(); // flush occurs sess.close();]]>
fr_fr: Il est assez pénible de sauvegarder, supprimer, ou réattacher des objets un par un, surtout si vous traitez un graphe d'objets associés. Un cas habituel est une relation parent/enfant. Considérez l'exemple suivant :

source: During flush, an exception might occur (e.g. if a DML operation violates a constraint). Since handling exceptions involves some understanding of Hibernate's transactional behavior, we discuss it in <xref linkend="transactions"/>.
fr_fr: Si les enfants de la relation parent/enfant étaient des types de valeur (par exemple, une collection d'adresses ou de chaînes de caractères), leur cycle de vie dépendraient du parent et aucune action ne serait requise pour "cascader" facilement les changements d'état. Si le parent est sauvegardé, les objets enfants de type de valeur sont sauvegardés également, si le parent est supprimé, les enfants sont supprimés, etc. Ceci fonctionne même pour des opérations telles que la suppression d'un enfant de la collection ; Hibernate détectera cela et, puisque les objets de type de valeur ne peuvent pas avoir des références partagées, supprimera l'enfant de la base de données.

source: Transitive persistence
fr_fr: Maintenant considérez le même scénario avec un parent et dont les objets enfants sont des entités, et non des types de valeur (par exemple, des catégories et des objets, ou un parent et des chatons). Les entités ont leur propre cycle de vie, supportent les références partagées (donc supprimer une entité de la collection ne signifie pas qu'elle peut être supprimée), et il n'y a par défaut pas de cascade d'état d'une entité vers n'importe quelle entité associée. Hibernate n'implémente pas la <emphasis>persistance par accessibilité</emphasis> par défaut.

source: It is quite cumbersome to save, delete, or reattach individual objects, especially if you deal with a graph of associated objects. A common case is a parent/child relationship. Consider the following example:
fr_fr: Pour chaque opération basique de la session d'Hibernate - incluant <literal>persist(), merge(), saveOrUpdate(), delete(), lock(), refresh(), evict(), replicate()</literal> - il y a un style de cascade correspondant. Respectivement, les styles de cascade s'appellent <literal>persist, merge, save-update, delete, lock, refresh, evict, replicate</literal>. Si vous voulez qu'une opération soit cascadée le long d'une association, vous devez l'indiquer dans le document de mapping. Par exemple :

source: If the children in a parent/child relationship would be value typed (e.g. a collection of addresses or strings), their life cycle would depend on the parent and no further action would be required for convenient "cascading" of state changes. When the parent is saved, the value-typed child objects are saved as well, when the parent is deleted, the children will be deleted, etc. This even works for operations such as the removal of a child from the collection; Hibernate will detect this and, since value-typed objects can't have shared references, delete the child from the database.
fr_fr: <![CDATA[<one-to-one name="person" cascade="persist"/>]]>

source: Now consider the same scenario with parent and child objects being entities, not value-types (e.g. categories and items, or parent and child cats). Entities have their own life cycle, support shared references (so removing an entity from the collection does not mean it can be deleted), and there is by default no cascading of state from one entity to any other associated entities. Hibernate does not implement <emphasis>persistence by reachability</emphasis> by default.
fr_fr: Les styles de cascade peuvent être combinés :

source: For each basic operation of the Hibernate session - including <literal>persist(), merge(), saveOrUpdate(), delete(), lock(), refresh(), evict(), replicate()</literal> - there is a corresponding cascade style. Respectively, the cascade styles are named <literal>create, merge, save-update, delete, lock, refresh, evict, replicate</literal>. If you want an operation to be cascaded along an association, you must indicate that in the mapping document. For example:
fr_fr: <![CDATA[<one-to-one name="person" cascade="persist,delete,lock"/>]]>

source: <![CDATA[<one-to-one name="person" cascade="persist"/>]]>
fr_fr: Vous pouvez même utiliser <literal>cascade="all"</literal> pour spécifier que <emphasis>toutes</emphasis> les opérations devraient être cascadées le long de l'association. La valeur par défaut <literal>cascade="none"</literal> spécifie qu'aucune opération ne sera cascadée.

source: Cascade styles my be combined:
fr_fr: Une style de cascade spécial, <literal>delete-orphan</literal>, s'applique seulement aux associations un-vers-plusieurs, et indique que l'opération <literal>delete()</literal> devrait être appliquée à n'importe quel enfant qui est supprimé de l'association.

source: <![CDATA[<one-to-one name="person" cascade="persist,delete,lock"/>]]>
fr_fr: Recommandations :

source: You may even use <literal>cascade="all"</literal> to specify that <emphasis>all</emphasis> operations should be cascaded along the association. The default <literal>cascade="none"</literal> specifies that no operations are to be cascaded.
fr_fr: Cela n'a généralement aucun sens d'activer la cascade sur une association <literal>&lt;many-to-one&gt;</literal> ou <literal>&lt;many-to-many&gt;</literal>. Les cascades sont souvent utiles pour des associations <literal>&lt;one-to-one&gt;</literal> et <literal>&lt;one-to-many&gt;</literal>.

source: A special cascade style, <literal>delete-orphan</literal>, applies only to one-to-many associations, and indicates that the <literal>delete()</literal> operation should be applied to any child object that is removed from the association.
fr_fr: Si la durée de vie de l'objet enfant est liée à la durée de vie de l'objet parent, faites en un <emphasis>objet du cycle de vie</emphasis> en spécifiant <literal>cascade="all,delete-orphan"</literal>.

source: Recommendations:
fr_fr: Sinon, vous pourriez ne pas avoir besoin de cascade du tout. Mais si vous pensez que vous travaillerez souvent avec le parent et les enfants ensemble dans la même transaction, et que vous voulez vous éviter quelques frappes, considérez l'utilisation de <literal>cascade="persist,merge,save-update"</literal>.
