Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/toolset_guide.po
Languages: fr_fr, ja_jp

source: Using Ant
fr_fr: Utiliser Ant
ja_jp: <![CDATA[<target name="schemaexport"> <taskdef name="schemaexport" classname="org.hibernate.tool.hbm2ddl.SchemaExportTask" classpathref="class.path"/> <schemaexport properties="hibernate.properties" quiet="no" text="no" drop="no" delimiter=";" output="schema-export.sql"> <fileset dir="src"> <include name="**/*.hbm.xml"/> </fileset> </schemaexport> </target>]]>

source: You can call <literal>SchemaExport</literal> from your Ant build script:
fr_fr: Vous pouvez appeler <literal>SchemaExport</literal> depuis votre script de construction Ant :
ja_jp: インクリメンタルなスキーマ更新

source: <![CDATA[<target name="schemaexport"> <taskdef name="schemaexport" classname="org.hibernate.tool.hbm2ddl.SchemaExportTask" classpathref="class.path"/> <schemaexport properties="hibernate.properties" quiet="no" text="no" drop="no" delimiter=";" output="schema-export.sql"> <fileset dir="src"> <include name="**/*.hbm.xml"/> </fileset> </schemaexport> </target>]]>
ja_jp: <literal>SchemaUpdate</literal> ツールは既存のスキーマをインクリメンタルに更新します。 <literal>SchemaUpdate</literal> はJDBCのメタデータAPIに強く依存します。 そのため、すべてのJDBCドライバでうまくいくとは限らないことに注意してください。

source: Incremental schema updates
fr_fr: Mises à jour incrémentales du schéma
ja_jp: <literal>java -cp </literal> <emphasis>hibernate_classpaths</emphasis> <literal>org.hibernate.tool.hbm2ddl.SchemaUpdate</literal> <emphasis>options mapping_files</emphasis>

source: The <literal>SchemaUpdate</literal> tool will update an existing schema with "incremental" changes. Note that <literal>SchemaUpdate</literal> depends heavily upon the JDBC metadata API, so it will not work with all JDBC drivers.
fr_fr: L'outil <literal>SchemaUpdate</literal> mettra à jour un schéma existant en effectuant les changement par "incrément". Notez que <literal>SchemaUpdate</literal> dépends beaucoup de l'API JDBC metadata, il ne fonctionnera donc pas avec tous les drivers JDBC.
ja_jp: <literal>SchemaUpdate</literal> のコマンドライン･オプション

source: <literal>java -cp </literal><emphasis>hibernate_classpaths</emphasis> <literal>org.hibernate.tool.hbm2ddl.SchemaUpdate</literal> <emphasis>options mapping_files</emphasis>
fr_fr: <literal>java -cp </literal><emphasis>classpath_hibernate</emphasis> <literal>net.sf.hibernate.tool.hbm2ddl.SchemaUpdate</literal> <emphasis>options fichiers_de_mapping</emphasis>
ja_jp: オプション

source: <literal>SchemaUpdate</literal> Command Line Options
fr_fr: <literal>SchemaUpdate</literal> Options de ligne de commande
ja_jp: <entry>説明</entry>

source: don't export the script to the database
fr_fr: ne pas exporter vers la base de données
ja_jp: <literal>NamingStrategy</literal> を選択します。

source: specify a <literal>.cfg.xml</literal> file
fr_fr: <![CDATA[Configuration cfg = ....; new SchemaUpdate(cfg).execute(false);]]>
ja_jp: <![CDATA[Configuration cfg = ....; new SchemaUpdate(cfg).execute(false);]]>

source: You may embed <literal>SchemaUpdate</literal> in your application:
fr_fr: Utiliser Ant pour des mises à jour de schéma par incrément
ja_jp: インクリメンタルなスキーマ更新に対するAntの使用

source: <![CDATA[Configuration cfg = ....; new SchemaUpdate(cfg).execute(false);]]>
fr_fr: Vous pouvez appeler <literal>SchemaUpdate</literal> depuis le script Ant :
ja_jp: Antスクリプトから <literal>SchemaUpdate</literal> を呼び出すことができます：

source: Using Ant for incremental schema updates
fr_fr: <![CDATA[<target name="schemaupdate"> <taskdef name="schemaupdate" classname="org.hibernate.tool.hbm2ddl.SchemaUpdateTask" classpathref="class.path"/> <schemaupdate properties="hibernate.properties" quiet="no"> <fileset dir="src"> <include name="**/*.hbm.xml"/> </fileset> </schemaupdate> </target>]]>
ja_jp: <![CDATA[<target name="schemaupdate"> <taskdef name="schemaupdate" classname="org.hibernate.tool.hbm2ddl.SchemaUpdateTask" classpathref="class.path"/> <schemaupdate properties="hibernate.properties" quiet="no"> <fileset dir="src"> <include name="**/*.hbm.xml"/> </fileset> </schemaupdate> </target>]]>

source: You can call <literal>SchemaUpdate</literal> from the Ant script:
fr_fr: Validation du schéma
ja_jp: Schema validation

source: <![CDATA[<target name="schemaupdate"> <taskdef name="schemaupdate" classname="org.hibernate.tool.hbm2ddl.SchemaUpdateTask" classpathref="class.path"/> <schemaupdate properties="hibernate.properties" quiet="no"> <fileset dir="src"> <include name="**/*.hbm.xml"/> </fileset> </schemaupdate> </target>]]>
fr_fr: L'outil <literal>SchemaValidator</literal> validera que le schéma existant correspond à vos documents de mapping. Notez que le <literal>SchemaValidator</literal> dépends de l'API metadata de JDBC, il ne fonctionnera donc pas avec tous les drivers JDBC. Cet outil est extrêmement utile pour tester.
ja_jp: <literal>SchemaValidator</literal> ツールは、既存のデータベーススキーマと作成したマッピングドキュメントが"一致する"ことを検証します。 <literal>SchemaValidator</literal> はJDBCのメタデータAPIに強く依存することに注意してください。そのため、すべてのJDBCドライバーで作動するものではありません。このツールはテスト時に非常に有用です。

source: Schema validation
fr_fr: <literal>java -cp </literal><emphasis>hibernate_classpaths</emphasis> <literal>org.hibernate.tool.hbm2ddl.SchemaValidator</literal> <emphasis>options mapping_files</emphasis>
ja_jp: <literal>java -cp </literal> <emphasis>hibernate_classpaths</emphasis> <literal>org.hibernate.tool.hbm2ddl.SchemaValidator</literal> <emphasis>options mapping_files</emphasis>

source: The <literal>SchemaValidator</literal> tool will validate that the existing database schema "matches" your mapping documents. Note that <literal>SchemaValidator</literal> depends heavily upon the JDBC metadata API, so it will not work with all JDBC drivers. This tool is extremely useful for testing.
fr_fr: <literal>SchemaValidator</literal> Options de ligne de commande
ja_jp: <literal>SchemaValidator</literal> のコマンドライン・オプション

source: <literal>java -cp </literal><emphasis>hibernate_classpaths</emphasis> <literal>org.hibernate.tool.hbm2ddl.SchemaValidator</literal> <emphasis>options mapping_files</emphasis>
fr_fr: Option
ja_jp: オプション

source: <literal>SchemaValidator</literal> Command Line Options
fr_fr: Description
ja_jp: <entry>説明</entry>

source: You may embed <literal>SchemaValidator</literal> in your application:
fr_fr: Utiliser Ant pour la validation du Schéma
ja_jp: スキーマのバリデーションにAntを使用します

source: <![CDATA[Configuration cfg = ....; new SchemaValidator(cfg).validate();]]>
fr_fr: Vous pouvez appeler <literal>SchemaValidator</literal> depuis le script Ant:
ja_jp: Antスクリプトから <literal>SchemaValidator</literal> を呼び出せます:

source: Using Ant for schema validation
fr_fr: <![CDATA[<target name="schemavalidate"> <taskdef name="schemavalidator" classname="org.hibernate.tool.hbm2ddl.SchemaValidatorTask" classpathref="class.path"/> <schemavalidator properties="hibernate.properties"> <fileset dir="src"> <include name="**/*.hbm.xml"/> </fileset> </schemavalidator> </target>]]>
ja_jp: <![CDATA[<target name="schemavalidate"> <taskdef name="schemavalidator" classname="org.hibernate.tool.hbm2ddl.SchemaValidatorTask" classpathref="class.path"/> <schemavalidator properties="hibernate.properties"> <fileset dir="src"> <include name="**/*.hbm.xml"/> </fileset> </schemavalidator> </target>]]>

source: ROLES_OF_TRANSLATORS
fr_fr: <!--TRANS:ROLES_OF_TRANSLATORS-->
ja_jp: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
fr_fr: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
ja_jp: <!--TRANS:CREDIT_FOR_TRANSLATORS-->

source: Ant Tasks:
fr_fr: Tâches Ant :
