Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/toolset_guide.po
Languages: fr_fr, ja_jp

source: Toolset Guide
fr_fr: Guide des outils
ja_jp: Toolset Guide ツールセットガイド

source: Roundtrip engineering with Hibernate is possible using a set of Eclipse plugins, commandline tools, as well as Ant tasks.
fr_fr: Des outils en ligne de commande, des plugins Eclipse ainsu que des tâches Ant permettent de gérer de cycles de développement complet de projets utilisant Hibernate.
ja_jp: Hibernateを使ったラウンドトリップエンジニアリングは、 Eclipseプラグインやコマンドラインツール、もちろんAntタスクを使うことで可能です。

source: The <emphasis>Hibernate Tools</emphasis> currently include plugins for the Eclipse IDE as well as Ant tasks for reverse engineering of existing databases:
fr_fr: Les <emphasis>outils Hibernate</emphasis> actuels incluent des plugins pour l'IDE Eclipse ainsi que des tâches Ant pour l'ingénierie inverse de bases de données existantes :
ja_jp: <emphasis>Hibernate Tools</emphasis> は現在、既存データベースのリバースエンジニアリングのAntタスクに加えて、EclipseIDEのプラグインを含みます。

source: <emphasis>Mapping Editor:</emphasis> An editor for Hibernate XML mapping files, supporting auto-completion and syntax highlighting. It also supports semantic auto-completion for class names and property/field names, making it much more versatile than a normal XML editor.
fr_fr: <emphasis>Mapping Editor :</emphasis> un éditeur pour les fichiers de mapping XML Hibernate, supportant l'auto-complétion et la mise en valeur de la syntaxe. Il supporte aussi l'auto-complétion automatique pour les noms de classes et les noms de propriété/champ, le rendant beaucoup plus polyvalent qu'un éditeurXML normal.
ja_jp: <emphasis>マッピングエディタ:</emphasis> HibernateのXMLマッピングファイル用のエディタで、 自動補完と構文強調表示をサポートしています。クラス名やプロパティ/フィールド名に対する自動補完もサポートし、 通常のXMLエディタよりも強力です。

source: <emphasis>Console:</emphasis> The console is a new view in Eclipse. In addition to a tree overview of your console configurations, you also get an interactive view of your persistent classes and their relationships. The console allows you to execute HQL queries against your database and browse the result directly in Eclipse.
fr_fr: <emphasis>Console :</emphasis> la console est une nouvelle vue d'Eclipse. En plus de la vue d'ensemble arborescente de vos configurations de console, vous obtenez aussi une vue interactive de vos classes persistantes et de leurs relations. La console vous permet d'exécuter des requête HQL dans votre base de données et de parcourir les résultats directement dans Eclipse.
ja_jp: <emphasis>Console:</emphasis> コンソールはエクリプスの新しいビューです。 コンソールコンフィギュレーションのツリーオーバービューに加えて、永続クラスとその関連の相互作用ビューも得られます。 データベースにHQLを実行し、結果を直接エクリプス上で見ることができます。

source: <emphasis>Development Wizards:</emphasis> Several wizards are provided with the Hibernate Eclipse tools; you can use a wizard to quickly generate Hibernate configuration (cfg.xml) files, or you may even completely reverse engineer an existing database schema into POJO source files and Hibernate mapping files. The reverse engineering wizard supports customizable templates.
fr_fr: <emphasis>Development Wizards :</emphasis> plusieurs assistants sont fournis avec les outils d'Hibernate pour Eclipse ; vous pouvez utiliser un assistant pour générer rapidement les fichiers de configuration d'Hibernate (cfg.xml), ou vous pouvez même complètement générer les fichiers de mapping Hibernate et les sources des POJOs à partir d'un schéma de base de données existant. L'assistant d'ingénierie inverse supporte les modèles utilisateur.
ja_jp: <emphasis>開発ウィザード</emphasis> HibernateのEclipseツールはいくつかのウィザードを提供します。 ウィザードを使ってHibernateの設定ファイル(cfg.xml)をすばやく生成したり、 既存のデータベーススキーマをPOJOのソースファイルとHibernateのマッピングファイルへと、 完全にリバースエンジニアリングすることができます。 リバースエンジニアリングウィザードはカスタマイズ可能なテンプレートをサポートします。

source: Please refer to the <emphasis>Hibernate Tools</emphasis> package and it's documentation for more information.
fr_fr: Veuillez-vous référer au paquet <emphasis>outils Hibernate</emphasis> et sa documentation pour plus d'informations.
ja_jp: より詳しい情報は <emphasis>Hibernate Tools</emphasis> パッケージとそのドキュメントを参照してください。

source: However, the Hibernate main package comes bundled with an integrated tool (it can even be used from "inside" Hibernate on-the-fly): <emphasis>SchemaExport</emphasis> aka <literal>hbm2ddl</literal>.
fr_fr: Pourtant, le paquet principal d'Hibernate arrive avec un lot d'outils intégrés (il peut même être utilisé de "l'intérieur" d'Hibernate à la volée) : <emphasis>SchemaExport</emphasis> aussi connu comme <literal>hbm2ddl</literal>.
ja_jp: しかし、Hibernateのメインパッケージは <emphasis>SchemaExport</emphasis> 、 別名 <literal>hbm2ddl</literal> も含みます(Hibernate内でオンザフライで使用できます)。

source: Automatic schema generation
fr_fr: Génération automatique du schéma
ja_jp: スキーマの自動生成

source: DDL may be generated from your mapping files by a Hibernate utility. The generated schema includes referential integrity constraints (primary and foreign keys) for entity and collection tables. Tables and sequences are also created for mapped identifier generators.
fr_fr: La DDL peut être générée à partir de vos fichiers de mapping par un utilitaire d'Hibernate. Le schéma généré inclut les contraintes d'intégrité référentielle (clefs primaires et étrangères) pour les tables d'entités et de collections. Les tables et les séquences sont aussi créées pour les générateurs d'identifiant mappés.
ja_jp: DDLはHibernateユーティリティによりマッピングファイルから生成することができます。 生成されたスキーマはエンティティやコレクションのテーブルに対する参照整合性制約(主キーと外部キー)を含みます。 テーブルとシーケンスはマッピングする識別子ジェネレータに対して生成されます。

source: You <emphasis>must</emphasis> specify a SQL <literal>Dialect</literal> via the <literal>hibernate.dialect</literal> property when using this tool, as DDL is highly vendor specific.
fr_fr: Vous <emphasis>devez</emphasis> spécifier un <literal>Dialect</literal> SQL via la propriété <literal>hibernate.dialect</literal> lors de l'utilisation de cet outils, puisque la DDL est fortement dépendante de la base de données.
ja_jp: DDLはベンダー依存なので、このツールを使うときは、<literal>hibernate.dialect</literal> プロパティでSQLの <literal>方言</literal> を指定 <emphasis>しなければなりません</emphasis> 。

source: First, customize your mapping files to improve the generated schema.
fr_fr: D'abord, personnalisez vos fichiers de mapping pour améliorer le schéma généré.
ja_jp: まず、生成されるスキーマを改善するように、マッピングファイルをカスタマイズしてください。

source: Customizing the schema
fr_fr: Personnaliser le schéma
ja_jp: スキーマのカスタマイズ

source: Many Hibernate mapping elements define optional attributes named <literal>length</literal>, <literal>precision</literal> and <literal>scale</literal>. You may set the length, precision and scale of a column with this attribute.
fr_fr: Plusieurs éléments du mapping hibernate définissent des attributs optionnels nommés <literal>length</literal>, <literal>precision</literal> et <literal>scale</literal>. Vous pouvez paramétrer la longueur, la précision,... d'une colonne avec ces attributs.
ja_jp: 多くのHibernateのマッピング要素では、オプションの <literal>length</literal> という名の属性を定義しています。 この属性でカラム長を設定することができます(またはNUMERIC/DECIMAL型のデータの精度を設定できます)。

source: <![CDATA[<property name="zip" length="5"/>]]>
ja_jp: <literal>not-null</literal> 属性（テーブルのカラムへ <literal>NOT NULL</literal> 制約を生成する）と <literal>unique</literal> 属性（テーブルのカラムへ <literal>UNIQUE</literal> 制約を生成する）が設定できるタグもあります。

source: <![CDATA[<property name="balance" precision="12" scale="2"/>]]>
ja_jp: <![CDATA[<many-to-one name="bar" column="barId" not-null="true"/>]]>

source: Some tags also accept a <literal>not-null</literal> attribute (for generating a <literal>NOT NULL</literal> constraint on table columns) and a <literal>unique</literal> attribute (for generating <literal>UNIQUE</literal> constraint on table columns).
fr_fr: Certains éléments acceptent aussi un attribut <literal>not-null</literal> (utilisé pour générer les contraintes de colonnes <literal>NOT NULL</literal>) et un attribut <literal>unique</literal> (pour générer une contrainte de colonne <literal>UNIQUE</literal>).
ja_jp: <![CDATA[<element column="serialNumber" type="long" not-null="true" unique="true"/>]]>

source: <![CDATA[<many-to-one name="bar" column="barId" not-null="true"/>]]>
ja_jp: <literal>unique-key</literal> 属性はカラムをグループ化して一つのキー制約にするために使われます。 現在、<literal>unique-key</literal> 属性で指定された値は制約の指定には <emphasis>使われず</emphasis> 、 マッピングファイルでカラムをグループ化することにのみ使われます。

source: <![CDATA[<element column="serialNumber" type="long" not-null="true" unique="true"/>]]>
ja_jp: <![CDATA[<many-to-one name="org" column="orgId" unique-key="OrgEmployeeId"/> <property name="employeeId" unique-key="OrgEmployeeId"/>]]>

source: A <literal>unique-key</literal> attribute may be used to group columns in a single unique key constraint. Currently, the specified value of the <literal>unique-key</literal> attribute is <emphasis>not</emphasis> used to name the constraint in the generated DDL, only to group the columns in the mapping file.
fr_fr: Un attribut <literal>unique-key</literal> peut être utilisé pour grouper les colonnes en une seule contrainte d'unicité. Actuellement, la valeur spécifiée par l'attribut <literal>unique-key</literal> n'est <emphasis>pas</emphasis> utilisée pour nommer la contrainte dans le DDL généré, elle sert juste à grouper les colonnes dans le fichier de mapping.
ja_jp: <literal>index</literal> 属性はマッピングするカラムを使って生成したインデックスの名前を指定します。 複数カラムを１つのインデックスにグループ化できます。単に、同じインデックス名を指定するだけです。

source: <![CDATA[<many-to-one name="org" column="orgId" unique-key="OrgEmployeeId"/> <property name="employeeId" unique-key="OrgEmployee"/>]]>
fr_fr: <![CDATA[<many-to-one name="org" column="orgId" unique-key="OrgEmployeeId"/> <property name="employeeId" unique-key="OrgEmployeeId"/>]]>
ja_jp: <![CDATA[<property name="lastName" index="CustName"/> <property name="firstName" index="CustName"/>]]>

source: An <literal>index</literal> attribute specifies the name of an index that will be created using the mapped column or columns. Multiple columns may be grouped into the same index, simply by specifying the same index name.
fr_fr: Un attribut <literal>index</literal> indique le nom d'un index qui sera créé en utilisant la ou les colonnes mappées. Plusieurs colonnes peuvent être groupées dans un même index, en spécifiant le même nom d'index.
ja_jp: <literal>foreign-key</literal> 属性は、生成された外部キー制約の名前をオーバーライドするために使用できます。

source: <![CDATA[<property name="lastName" index="CustName"/> <property name="firstName" index="CustName"/>]]>
ja_jp: <![CDATA[<many-to-one name="bar" column="barId" foreign-key="FKFooBar"/>]]>

source: A <literal>foreign-key</literal> attribute may be used to override the name of any generated foreign key constraint.
fr_fr: Un attribut <literal>foreign-key</literal> peut être utilisé pour surcharger le nom des clés étrangères générées.
ja_jp: 多くのマッピング要素は、子 <literal>&lt;column&gt;</literal> 要素を記述できます。これは複数カラム型のマッピングには特に有用です。

source: <![CDATA[<many-to-one name="bar" column="barId" foreign-key="FKFooBar"/>]]>
ja_jp: <![CDATA[<property name="name" type="my.customtypes.Name"/> <column name="last" not-null="true" index="bar_idx" length="30"/> <column name="first" not-null="true" index="bar_idx" length="20"/> <column name="initial"/> </property>]]>

source: Many mapping elements also accept a child <literal>&lt;column&gt;</literal> element. This is particularly useful for mapping multi-column types:
fr_fr: Plusieurs éléments de mapping acceptent aussi un élément fils <literal>&lt;column&gt;</literal>. Ceci est utile pour les type multi-colonnes:
ja_jp: <literal>default</literal> 属性はカラムのデフォルト値を指定します (マッピングしたクラスの新しいインスタンスを保存する前に、 マッピングしたプロパティへ同じ値を代入すべきです)。

source: <![CDATA[<property name="name" type="my.customtypes.Name"/> <column name="last" not-null="true" index="bar_idx" length="30"/> <column name="first" not-null="true" index="bar_idx" length="20"/> <column name="initial"/> </property>]]>
ja_jp: <![CDATA[<property name="credits" type="integer" insert="false"> <column name="credits" default="10"/> </property>]]>

source: The <literal>default</literal> attribute lets you specify a default value for a column (you should assign the same value to the mapped property before saving a new instance of the mapped class).
fr_fr: L'attribut <literal>default</literal> vous laisse spécifier une valeur par défaut pour une colonnes (vous devriez assigner la même valeur à la propriété mappée avant de sauvegarder une nouvelle instance de la classe mappée).
ja_jp: <![CDATA[<version name="version" type="integer" insert="false"> <column name="version" default="0"/> </property>]]>

source: <![CDATA[<property name="credits" type="integer" insert="false"> <column name="credits" default="10"/> </property>]]>
ja_jp: <literal>sql-type</literal> 属性で、デフォルトのHibernate型からSQLのデータ型へのマッピングをオーバーライドできます。

source: <![CDATA[<version name="version" type="integer" insert="false"> <column name="version" default="0"/> </property>]]>
ja_jp: <![CDATA[<property name="balance" type="float"> <column name="balance" sql-type="decimal(13,3)"/> </property>]]>

source: The <literal>sql-type</literal> attribute allows the user to override the default mapping of a Hibernate type to SQL datatype.
fr_fr: L'attribut <literal>sql-type</literal> laisse l'utilisateur surcharger le mapping par défaut du type Hibernate vers un type SQL.
ja_jp: <literal>check</literal> 属性でチェック制約を指定することができます。

source: <![CDATA[<property name="balance" type="float"> <column name="balance" sql-type="decimal(13,3)"/> </property>]]>
ja_jp: <![CDATA[<property name="foo" type="integer"> <column name="foo" check="foo > 10"/> </property>]]>

source: The <literal>check</literal> attribute allows you to specify a check constraint.
fr_fr: L'attribut <literal>check</literal> permet de spécifier une contrainte de vérification.
ja_jp: <![CDATA[<class name="Foo" table="foos" check="bar < 100.0"> ... <property name="bar" type="float"/> </class>]]>

source: <![CDATA[<property name="foo" type="integer"> <column name="foo" check="foo > 10"/> </property>]]>
ja_jp: <title>まとめ</title>

source: <![CDATA[<class name="Foo" table="foos" check="bar < 100.0"> ... <property name="bar" type="float"/> </class>]]>
ja_jp: <entry>属性</entry>

source: Summary
ja_jp: <entry>値</entry>

source: Attribute
fr_fr: Attribut
ja_jp: <entry>説明</entry>

source: Values
fr_fr: Valeur
ja_jp: length

source: Interpretation
fr_fr: Interprétation
ja_jp: <entry>数値</entry>

source: length
ja_jp: カラムの長さ

source: number
fr_fr: numérique
ja_jp: precision

source: column length
fr_fr: taille d'une colonne
ja_jp: <entry>数値</entry>

source: precision
ja_jp: カラムのDECIMAL型の精度（precision）

source: column decimal precision
fr_fr: précision décimale de la colonne
ja_jp: <entry>数値</entry>

source: scale
ja_jp: カラムのDECIMAL型のスケール（scale）

source: column decimal scale
fr_fr: scale décimale de la colonne
ja_jp: true|false

source: not-null
ja_jp: カラムがnull値を取らないことを指定します

source: true|false
ja_jp: unique

source: specfies that the column should be non-nullable
fr_fr: spécifie que la colonne doit être non-nulle
ja_jp: true|false

source: unique
ja_jp: カラムがユニーク制約を持つことを指定します

source: specifies that the column should have a unique constraint
fr_fr: spécifie que la colonne doit avoir une contrainte d'unicité
ja_jp: インデックス名

source: index
ja_jp: (複数カラムの)インデックスの名前を指定します

source: index_name
ja_jp: unique-key

source: specifies the name of a (multi-column) index
fr_fr: spécifie le nom d'un index (multi-colonnes)
ja_jp: ユニークキー名

source: unique-key
ja_jp: 複数カラムのユニーク制約の名前を指定します

source: unique_key_name
ja_jp: foreign-key

source: specifies the name of a multi-column unique constraint
fr_fr: spécifie le nom d'une contrainte d'unicité multi-colonnes
ja_jp: 外部キー名

source: foreign-key
ja_jp: &lt;one-to-one&gt;、&lt;many-to-one&gt;、&lt;many-to-many&gt;マッピング要素を使って、 関連に対し生成された外部キー制約の名前を指定します。 <literal>SchemaExport</literal> は <literal>inverse="true"</literal> 側を考慮しないことに注意してください。

source: foreign_key_name
ja_jp: sql-type

source: specifies the name of the foreign key constraint generated for an association, for a <literal>&lt;one-to-one&gt;</literal>, <literal>&lt;many-to-one&gt;</literal>, <literal>&lt;key&gt;</literal>, or <literal>&lt;many-to-many&gt;</literal> mapping element. Note that <literal>inverse="true"</literal> sides will not be considered by <literal>SchemaExport</literal>.
fr_fr: spécifie le nom d'une contrainte de clé étrangère générée pour une association, utilisez-la avec les éléments de mapping &lt;one-to-one&gt;, &lt;many-to-one&gt;, &lt;key&gt;, et &lt;many-to-many&gt; Notez que les extrêmités <literal>inverse="true"</literal> se seront pas prises en compte par <literal>SchemaExport</literal>.
ja_jp: SQLのカラム型

source: sql-type
ja_jp: デフォルトのカラム型をオーバーライドします( <literal>&lt;column&gt;</literal> 要素の属性のみ)

source: SQL column type
ja_jp: default

source: overrides the default column type (attribute of <literal>&lt;column&gt;</literal> element only)
fr_fr: surcharge le type par défaut (attribut de l'élément <literal>&lt;column&gt;</literal> uniquement)
ja_jp: SQL式

source: default
ja_jp: カラムのデフォルト値を指定します

source: SQL expression
fr_fr: expression SQL
ja_jp: check

source: specify a default value for the column
fr_fr: spécifie une valeur par défaut pour la colonne
ja_jp: SQL式

source: check
ja_jp: カラムかテーブルにSQLのチェック制約を作成します

source: create an SQL check constraint on either column or table
fr_fr: crée une contrainte de vérification sur la table ou la colonne
ja_jp: <![CDATA[<class name="Customer" table="CurCust"> <comment>Current customers only</comment> ... </class>]]>

source: The <literal>&lt;comment&gt;</literal> element allows you to specify comments for the generated schema.
fr_fr: L'élément <literal>&lt;comment&gt;</literal> vous permet de spécifier un commentaire pour le schéma généré.
ja_jp: <![CDATA[<property name="balance"> <column name="bal"> <comment>Balance in USD</comment> </column> </property>]]>

source: <![CDATA[<class name="Customer" table="CurCust"> <comment>Current customers only</comment> ... </class>]]>
ja_jp: これにより、生成したDDLに <literal>comment on table</literal> や <literal>comment on column</literal> 文が書かれます。

source: <![CDATA[<property name="balance"> <column name="bal"> <comment>Balance in USD</comment> </column> </property>]]>
ja_jp: ツールの実行

source: This results in a <literal>comment on table</literal> or <literal>comment on column</literal> statement in the generated DDL (where supported).
fr_fr: Ceci a pour résultat une expression <literal>comment on table</literal> ou <literal>comment on column</literal> dans la DDL générée (où supportée).
ja_jp: <literal>SchemaExport</literal> は標準出力に対してDDLスクリプトを書き出し、DDL文を実行したりもします。

source: Running the tool
fr_fr: Exécuter l'outil
ja_jp: <literal>java -cp </literal> <emphasis>hibernate_classpaths</emphasis> <literal>org.hibernate.tool.hbm2ddl.SchemaExport</literal> <emphasis>options mapping_files</emphasis>

source: The <literal>SchemaExport</literal> tool writes a DDL script to standard out and/or executes the DDL statements.
fr_fr: L'outil <literal>SchemaExport</literal> génère un script DDL vers la sortie standard et/ou exécute les ordres DDL.
ja_jp: <literal>SchemaExport</literal> Command Line Options <literal>SchemaExport</literal> のコマンドラインオプション

source: <literal>java -cp </literal><emphasis>hibernate_classpaths</emphasis> <literal>org.hibernate.tool.hbm2ddl.SchemaExport</literal> <emphasis>options mapping_files</emphasis>
fr_fr: <literal>java -cp </literal><emphasis>classpath_hibernate</emphasis> <literal>net.sf.hibernate.tool.hbm2ddl.SchemaExport</literal> <emphasis>options fichiers_de_mapping</emphasis>
ja_jp: オプション

source: <literal>SchemaExport</literal> Command Line Options
fr_fr: <literal>SchemaExport</literal> Options de la ligne de commande
ja_jp: <entry>説明</entry>

source: Option
ja_jp: --quiet

source: Description
ja_jp: スクリプトを標準出力に出力しません

source: --quiet
ja_jp: --drop

source: don't output the script to stdout
fr_fr: ne pas écrire le script vers la sortie standard
ja_jp: テーブルの削除だけを行います

source: --drop
ja_jp: --create

source: only drop the tables
fr_fr: supprime seuleument les tables
ja_jp: テーブルの生成のみを行います。

source: --create
ja_jp: --text

source: only create the tables
fr_fr: ne créé que les tables
ja_jp: データベースにエクスポートしません

source: --text
ja_jp: --output=my_schema.ddl

source: don't export to the database
fr_fr: ne pas exécuter sur la base de données
ja_jp: DDLスクリプトをファイルに出力します

source: --output=my_schema.ddl
ja_jp: --naming=eg.MyNamingStrategy

source: output the ddl script to a file
fr_fr: écrit le script ddl vers un fichier
ja_jp: <literal>NamingStrategy</literal> を選択します

source: --naming=eg.MyNamingStrategy
ja_jp: --config=hibernate.cfg.xml

source: select a <literal>NamingStrategy</literal>
fr_fr: sélectionne une <literal>NamingStrategy</literal>
ja_jp: XMLファイルからHibernateの定義情報を読み込みます

source: --config=hibernate.cfg.xml
ja_jp: --properties=hibernate.properties

source: read Hibernate configuration from an XML file
fr_fr: lit la configuration Hibernate à partir d'un fichier XML
ja_jp: ファイルからデータベースプロパティを読み込みます

source: --properties=hibernate.properties
ja_jp: --format

source: read database properties from a file
fr_fr: lit les propriétés de la base de données à partir d'un fichier
ja_jp: スクリプト内に生成するSQLを読みやすいようにフォーマットします

source: --format
ja_jp: --delimiter=x

source: format the generated SQL nicely in the script
fr_fr: formatte proprement le SQL généré dans le script
ja_jp: スクリプトの行区切り文字を設定します

source: --delimiter=;
fr_fr: --delimiter=x
ja_jp: アプリケーションに <literal>SchemaExport</literal> を組み込むこともできます：

source: set an end of line delimiter for the script
fr_fr: paramètre un délimiteur de fin de ligne pour le script
ja_jp: <![CDATA[Configuration cfg = ....; new SchemaExport(cfg).create(false, true);]]>

source: You may even embed <literal>SchemaExport</literal> in your application:
fr_fr: Vous pouvez même intégrer <literal>SchemaExport</literal> dans votre application :
ja_jp: プロパティ

source: <![CDATA[Configuration cfg = ....; new SchemaExport(cfg).create(false, true);]]>
ja_jp: 次のように、データベースのプロパティを指定することができます。

source: Properties
fr_fr: Propriétés
ja_jp: <literal>-D</literal> <emphasis>&lt;property&gt;</emphasis> を使って、システムプロパティとして

source: Database properties may be specified
fr_fr: Les propriétés de la base de données peuvent être spécifiées
ja_jp: <literal>hibernate.properties</literal> ファイル内で

source: as system properties with <literal>-D</literal><emphasis>&lt;property&gt;</emphasis>
fr_fr: comme propriétés système avec <literal>-D</literal><emphasis>&lt;property&gt;</emphasis>
ja_jp: <literal>--properties</literal> を使って指定したプロパティファイル内で

source: in <literal>hibernate.properties</literal>
fr_fr: dans <literal>hibernate.properties</literal>
ja_jp: 必要なプロパティは以下のものです：

source: in a named properties file with <literal>--properties</literal>
fr_fr: dans un fichier de propriétés déclaré avec <literal>--properties</literal>
ja_jp: SchemaExportコネクションプロパティ

source: The needed properties are:
fr_fr: Les propriétés nécessaires sont :
ja_jp: プロパティ名

source: SchemaExport Connection Properties
ja_jp: <entry>説明</entry>

source: Property Name
fr_fr: Nom de la propriété
ja_jp: hibernate.connection.driver_class

source: hibernate.connection.driver_class
ja_jp: hibernate.connection.url

source: jdbc driver class
fr_fr: classe du driver JDBC
ja_jp: jdbcのurl

source: hibernate.connection.url
ja_jp: hibernate.connection.username

source: jdbc url
fr_fr: URL JDBC
ja_jp: データベースのユーザ

source: hibernate.connection.username
ja_jp: hibernate.connection.password

source: database user
fr_fr: utilisateur de la base de données
ja_jp: ユーザパスワード

source: hibernate.connection.password
ja_jp: hibernate.dialect

source: user password
fr_fr: mot de passe de l'utilisateur
ja_jp: データベース方言

source: hibernate.dialect
ja_jp: Antを使用する

source: dialect
fr_fr: dialecte
ja_jp: Antのビルドスクリプトから <literal>SchemaExport</literal> を呼び出すことができます。:
