Repository: TiftGolofebitke/hibernate-orm
Catalog: documentation/manual/translations/*/content/xml.po
Languages: fr_fr

source: XML Mapping
fr_fr: Mapping XML

source: Note that this is an experimental feature in Hibernate 3.0 and is under extremely active development.
fr_fr: Notez que cette fonctionnalité est expérimentale dans Hibernate 3.0 et est en développement extrêmement actif.

source: Working with XML data
fr_fr: Travailler avec des données XML

source: Hibernate lets you work with persistent XML data in much the same way you work with persistent POJOs. A parsed XML tree can be thought of as just another way to represent the relational data at the object level, instead of POJOs.
fr_fr: Hibernate vous laisse travailler avec des données XML persistantes de la même manière que vous travaillez avec des POJOs persistants. Un arbre XML peut être vu comme une autre manière de représenter les données relationnelles au niveau objet, à la place des POJOs.

source: Hibernate supports dom4j as API for manipulating XML trees. You can write queries that retrieve dom4j trees from the database and have any modification you make to the tree automatically synchronized to the database. You can even take an XML document, parse it using dom4j, and write it to the database with any of Hibernate's basic operations: <literal>persist(), saveOrUpdate(), merge(), delete(), replicate()</literal> (merging is not yet supported).
fr_fr: Hibernate supporte dom4j en tant qu'API pour la manipulation des arbres XML. Vous pouvez écrire des requêtes qui récupèrent des arbres dom4j à partie de la base de données, et avoir toutes les modifications que vous faites sur l'arbre automatiquement synchronisées dans la base de données. Vous pouvez même prendre un document XML, l'analyser en utilisant dom4j, et l'écrire dans la base de données via les opérations basiques d'Hibernate : <literal>persist(), saveOrUpdate(), merge(), delete(), replicate()</literal> (merge() n'est pas encore supporté).

source: This feature has many applications including data import/export, externalization of entity data via JMS or SOAP and XSLT-based reporting.
fr_fr: Cette fonctionnalité a plusieurs applications dont l'import/export de données, l'externalisation d'entités via JMS ou SOAP et les rapports XSLT.

source: A single mapping may be used to simultaneously map properties of a class and nodes of an XML document to the database, or, if there is no class to map, it may be used to map just the XML.
fr_fr: Un simple mapping peut être utilisé pour simultanément mapper les propriétés d'une classe et les noeuds d'un document XML vers la base de données, ou, si il n'y a pas de classe à mapper, il peut être utilisé juste pour mapper le XML.

source: Specifying XML and class mapping together
fr_fr: Spécifier le mapping XML et le mapping d'une classe ensemble

source: Here is an example of mapping a POJO and XML simultaneously:
fr_fr: Voici un exemple de mapping d'un POJO et du XML simultanément :

source: Specifying only an XML mapping
fr_fr: Spécifier seulement un mapping XML

source: Here is an example where there is no POJO class:
fr_fr: Voici un exemple dans lequel il n'y a pas de class POJO :

source: This mapping allows you to access the data as a dom4j tree, or as a graph of property name/value pairs (java <literal>Map</literal>s). The property names are purely logical constructs that may be referred to in HQL queries.
fr_fr: Ce mapping vous permet d'accéder aux données comme un arbre dom4j, ou comme un graphe de paire nom de propriété/valeur (<literal>Map</literal>s java). Les noms des propriétés sont des constructions purement logiques qui peuvent être référées des dans requêtes HQL.

source: XML mapping metadata
fr_fr: Métadonnées du mapping XML

source: Many Hibernate mapping elements accept the <literal>node</literal> attribute. This let's you specify the name of an XML attribute or element that holds the property or entity data. The format of the <literal>node</literal> attribute must be one of the following:
fr_fr: Plusieurs éléments du mapping Hibernate acceptent l'attribut <literal>node</literal>. Ceci vous permet de spécifier le nom d'un attribut XML ou d'un élément qui contient la propriété ou les données de l'entité. Le format de l'attribut <literal>node</literal> doit être un des suivants :

source: <literal>"element-name"</literal> - map to the named XML element
fr_fr: <literal>"element-name"</literal> - mappe vers l'élément XML nommé

source: <literal>"@attribute-name"</literal> - map to the named XML attribute
fr_fr: <literal>"@attribute-name"</literal> - mappe vers l'attribut XML nommé

source: <literal>"."</literal> - map to the parent element
fr_fr: <literal>"."</literal> - mappe vers le parent de l'élément

source: <literal>"element-name/@attribute-name"</literal> - map to the named attribute of the named element
fr_fr: <literal>"element-name/@attribute-name"</literal> - mappe vers l'élément nommé de l'attribut nommé

source: For collections and single valued associations, there is an additional <literal>embed-xml</literal> attribute. If <literal>embed-xml="true"</literal>, the default, the XML tree for the associated entity (or collection of value type) will be embedded directly in the XML tree for the entity that owns the association. Otherwise, if <literal>embed-xml="false"</literal>, then only the referenced identifier value will appear in the XML for single point associations and collections will simply not appear at all.
fr_fr: Pour des collections et de simples associations valuées, il y a un attribut <literal>embed-xml</literal> supplémentaire. Si <literal>embed-xml="true"</literal>, qui est la valeur par défaut, l'arbre XML pour l'entité associée (ou la collection des types de valeurs) sera embarquée directement dans l'arbre XML pour l'entité qui possède l'association. Sinon, si <literal>embed-xml="false"</literal>, alors seule la valeur de l'identifiant référencé apparaîtra dans le XML pour de simples associations de points, et les collections n'appraîtront simplement pas.

source: You should be careful not to leave <literal>embed-xml="true"</literal> for too many associations, since XML does not deal well with circularity!
fr_fr: Vous devriez faire attention à ne pas laisser <literal>embed-xml="true"</literal> pour trop d'associations, puisque XML ne traite pas bien les liens circurlaires.

source: in this case, we have decided to embed the collection of account ids, but not the actual account data. The following HQL query:
fr_fr: dans ce cas, nous avons décidé d'embarquer la collection d'identifiants de compte, mais pas les données actuelles du compte. La requête HQL suivante :

source: Would return datasets such as this:
fr_fr: devrait retourner l'ensemble de données suivant :

source: If you set <literal>embed-xml="true"</literal> on the <literal>&lt;one-to-many&gt;</literal> mapping, the data might look more like this:
fr_fr: Si vous positionnez <literal>embed-xml="true"</literal> sur le mapping <literal>&lt;one-to-many&gt;</literal>, les données pourraient ressembler plus à ça :

source: Manipulating XML data
fr_fr: Manipuler des données XML

source: Let's rearead and update XML documents in the application. We do this by obtaining a dom4j session:
fr_fr: Relisons et mettons à jour des documents XML dans l'application. Nous faisons ça en obtenant une session dom4j :

source: <![CDATA[Document doc = ....; Session session = factory.openSession(); Session dom4jSession = session.getSession(EntityMode.DOM4J); Transaction tx = session.beginTransaction(); List results = dom4jSession .createQuery("from Customer c left join fetch c.accounts where c.lastName like :lastName") .list(); for ( int i=0; i<results.size(); i++ ) { //add the customer data to the XML document Element customer = (Element) results.get(i); doc.add(customer); } tx.commit(); session.close();]]>
fr_fr: <![CDATA[Document doc = ....; Session session = factory.openSession(); Session dom4jSession = session.getSession(EntityMode.DOM4J); Transaction tx = session.beginTransaction(); List results = dom4jSession .createQuery("from Customer c left join fetch c.accounts where c.lastName like :lastName") .list(); for ( int i=0; i<results.size(); i++ ) { //add the customer data to the XML document Element customer = (Element) results.get(i); doc.getRootElement().add(customer); } tx.commit(); session.close();]]>

source: It is extremely useful to combine this feature with Hibernate's <literal>replicate()</literal> operation to implement XML-based data import/export.
fr_fr: Il est extrêmement utile de combiner cette fonctionnalité avec l'opération <literal>replicate()</literal> d'Hibernate pour implémenter des imports/exports de données XML.

source: ROLES_OF_TRANSLATORS
fr_fr: <!--TRANS:ROLES_OF_TRANSLATORS-->

source: CREDIT_FOR_TRANSLATORS
fr_fr: <!--TRANS:CREDIT_FOR_TRANSLATORS-->
